{"text": "It is so unfortunate about  how ladies treat men's heart these days", "source": "empathetic_dialogues", "db_id": 11832}
{"text": "My cat spit up a hairball in my shoes today. I was so peeved!", "source": "empathetic_dialogues", "db_id": 12036}
{"text": "I really thought the new Star Wars movies would better but they are not. They are so aweful!", "source": "empathetic_dialogues", "db_id": 13021}
{"text": "Anytime I see a mall, I get nostalgic about all the times going there to play in the arcade.  Good Ole' Days.", "source": "empathetic_dialogues", "db_id": 11666}
{"text": "I got a bad mark on my math test. I should have studied harder.", "source": "empathetic_dialogues", "db_id": 13019}
{"text": "I was waiting for nearly 2 entire months for the results of a test that I prepared for a long time to take.", "source": "empathetic_dialogues", "db_id": 11289}
{"text": "When I was in high school, a few classmates and I cheated on a math test. I regret that too this day.", "source": "empathetic_dialogues", "db_id": 11391}
{"text": "My friend graduated valedictorian while working full-time during his junior and senior year.", "source": "empathetic_dialogues", "db_id": 11755}
{"text": "I felt proud when I had accomplished a dream that I wanted to do for a long time. ", "source": "empathetic_dialogues", "db_id": 11557}
{"text": "Went to the rec center today after work, and it was closed. They didn't announce it or anything", "source": "empathetic_dialogues", "db_id": 13106}
{"text": "I sure am glad that we live in a free country.", "source": "empathetic_dialogues", "db_id": 12802}
{"text": "I do not like the fact my brother always uses my car.", "source": "empathetic_dialogues", "db_id": 12202}
{"text": "I was going to be meeting with the Pres of the USA.  I knew going into the meeting what I wanted to tell him about my denuclearization", "source": "empathetic_dialogues", "db_id": 11435}
{"text": "I'm trying to be more careful with my money these days.", "source": "empathetic_dialogues", "db_id": 12411}
{"text": "i was in a competition,tomorrow is the elimination stage", "source": "empathetic_dialogues", "db_id": 11911}
{"text": "I feel so wonderful and blessed to have an amazing girlfriend. She is very understanding, like one time i was sick and she made me soup from scratch and a tea to help my throat.", "source": "empathetic_dialogues", "db_id": 12587}
{"text": "I took my co-workers phone charger and brought it home with me. I am planning on keeping it", "source": "empathetic_dialogues", "db_id": 11892}
{"text": "The weatherman said that we would have a snow event so I was ready.", "source": "empathetic_dialogues", "db_id": 13107}
{"text": "I was so sad the other day but my friend cheered me up.  I am so thankful for him.", "source": "empathetic_dialogues", "db_id": 11986}
{"text": "MY daughter cannot follow simple directions because she is glued to her phone", "source": "empathetic_dialogues", "db_id": 12457}
{"text": "I let someone borrow a $230 tool and had to trust them to bring it back.", "source": "empathetic_dialogues", "db_id": 12897}
{"text": "I listened to some old music I used to listen to recently. It literally made me feel like I was reliving the past!", "source": "empathetic_dialogues", "db_id": 12424}
{"text": "im going to a concert on sunday, i am thinking its going to be good", "source": "empathetic_dialogues", "db_id": 12937}
{"text": "I get aggravated when my daughters have too much homework.\\", "source": "empathetic_dialogues", "db_id": 11242}
{"text": "I am sitting here and there is a gigantic storm a brewing!", "source": "empathetic_dialogues", "db_id": 13069}
{"text": "It was a happy weekend. I got to go kayaking with friends", "source": "empathetic_dialogues", "db_id": 13159}
{"text": "Super excited about some moisturizer I am getting tomorrow. It seems like I can't ever find the right one for my skin so I am hoping this works.", "source": "empathetic_dialogues", "db_id": 11706}
{"text": "Tesla's new autopilot drove autonomously for 4 miles", "source": "empathetic_dialogues", "db_id": 12043}
{"text": "A co-worker of my husband asked me out on a date. I think that was rude and i told him no.", "source": "empathetic_dialogues", "db_id": 12408}
{"text": "I've got some big medical tests coming up.  I wish they would have done them that day, but I have to wait now.", "source": "empathetic_dialogues", "db_id": 12532}
{"text": "Manager schedueled me for an entire week of shifts, many of them doubles and without much time for a break between.", "source": "empathetic_dialogues", "db_id": 11449}
{"text": "I am happy today I can feed my birds and get everything I need and there is no drama.", "source": "empathetic_dialogues", "db_id": 11281}
{"text": "I just found out I am moving to a larger office at work. I was very shocked.", "source": "empathetic_dialogues", "db_id": 12401}
{"text": "i felt bad when i couldnt get a gift my daughter wanted", "source": "empathetic_dialogues", "db_id": 11816}
{"text": "I was shocked that the Eagles won the superbowl last year, really caught me off guard", "source": "empathetic_dialogues", "db_id": 12304}
{"text": "I broke my mothers favorite vase and blamed it on my cat. I was only 10 years old.", "source": "empathetic_dialogues", "db_id": 11808}
{"text": "I won the MVP award at a hockey tournament. I had 8 goals.", "source": "empathetic_dialogues", "db_id": 12540}
{"text": "I was unable to help my friend who's in need. But I tried my level best to help her to solve the issue. She understand and get the issue solved through our another colleague.", "source": "empathetic_dialogues", "db_id": 12477}
{"text": "Honestly, I am, for the most part, scared of the dark.  I think it is from all the scary movies I watched when I was a kid.", "source": "empathetic_dialogues", "db_id": 12045}
{"text": "I was playing baseball in my backyard with my friends and when I hit the ball it flew over my fence and I heard a window get smashed.", "source": "empathetic_dialogues", "db_id": 11688}
{"text": "I was planning a vacation soon, but due to an emergency at work, all vacation time was cancelled.", "source": "empathetic_dialogues", "db_id": 11287}
{"text": "I forgot my best friend's birthday this year. I've known him forever and am usually great about remebering and doing special thigns.", "source": "empathetic_dialogues", "db_id": 11610}
{"text": "Next month we are finally taking a family vacation. It's been so long, it seems!", "source": "empathetic_dialogues", "db_id": 12287}
{"text": "I went shopping today and tried on a cute dress. I walked out to look in the big mirror and the dress wasn't pulled down all the way.", "source": "empathetic_dialogues", "db_id": 12010}
{"text": "Bleh, I just had the worst food ever. I almost puked after I ate the rotten cheese burger I was given at McDonalds. ", "source": "empathetic_dialogues", "db_id": 12167}
{"text": "It was really dark and rainy one time when we were driving. We also crashed and it scared the hell outta me.", "source": "empathetic_dialogues", "db_id": 11495}
{"text": "My girlfriend wants me to go to Thanksgiving at her parents this year, but I haven't even met them yet.", "source": "empathetic_dialogues", "db_id": 11575}
{"text": "What does it take to not ever have someone in one's life", "source": "empathetic_dialogues", "db_id": 11551}
{"text": "I just feel for an email scam. I am so gulible and they are getting really good at stealing my money", "source": "empathetic_dialogues", "db_id": 12143}
{"text": "i knew i shouldnt have trusted my brother with my dog", "source": "empathetic_dialogues", "db_id": 12149}
{"text": "My friend is having a baby. I don't know what a nice gift to get her would be.", "source": "empathetic_dialogues", "db_id": 11542}
{"text": "My boyfriend can sing really well but I can't", "source": "empathetic_dialogues", "db_id": 11974}
{"text": "I can't wait to get out of these work clothes and into my sweats", "source": "empathetic_dialogues", "db_id": 11569}
{"text": "i am sure the braves will contend for the title this year!", "source": "empathetic_dialogues", "db_id": 12484}
{"text": "I watched Spice World yesterday.  I couldn't help but think about all of the fun times I had in junior high school watching that movie repeatedly", "source": "empathetic_dialogues", "db_id": 11638}
{"text": "when i found out that my daughter had a bad reaction to her shot. it was scary ", "source": "empathetic_dialogues", "db_id": 12413}
{"text": "I went camping the other week, and I was so happy to not have to worry about the troubles of the world for a while. It was therapeutic, honestly. ", "source": "empathetic_dialogues", "db_id": 12764}
{"text": "I am so sick of cleaning up after everyone. I cleaned the whole house last week and no one will even help keep it that way by at least cleaning up after themselves.", "source": "empathetic_dialogues", "db_id": 12016}
{"text": "My kids are getting so big, They aren't my litlle babies anymore", "source": "empathetic_dialogues", "db_id": 12355}
{"text": "I owe some guys some money after playing a poker game. They know where I live and I see them driving by late at night.", "source": "empathetic_dialogues", "db_id": 11797}
{"text": "I'm going to ask this girl I've been talking online with for a while out on a date.", "source": "empathetic_dialogues", "db_id": 12568}
{"text": "Ordered some pho, and the delivery guy gave me pizza, too.", "source": "empathetic_dialogues", "db_id": 11852}
{"text": "I feel so guilty.  I cheated on my husband.", "source": "empathetic_dialogues", "db_id": 12539}
{"text": "Broke up with my girlfriend last week. I don't have anyone to do stuff with anymore.", "source": "empathetic_dialogues", "db_id": 12212}
{"text": "Up extra early today, I couldn't sleep. I am starting a new job today.", "source": "empathetic_dialogues", "db_id": 12759}
{"text": "My son is being bullied in school and no one is doing anything about it.", "source": "empathetic_dialogues", "db_id": 12789}
{"text": "I am very happy to be an American.", "source": "empathetic_dialogues", "db_id": 11462}
{"text": "I have been studying a month for a test and I am ready to knock it out of the park.", "source": "empathetic_dialogues", "db_id": 11952}
{"text": "My dog threw-up all over my bed. I can't believe it. ", "source": "empathetic_dialogues", "db_id": 11731}
{"text": "I was once given a watch and I got the opportunity to make a lot of money off it, but I kept it for it's emotional value.", "source": "empathetic_dialogues", "db_id": 12825}
{"text": "I moved far away from the city. I hardly ever see my friends anymore.", "source": "empathetic_dialogues", "db_id": 11529}
{"text": "I'm texting 2 girls right now, one 18 and one 24 both smart and super attractive.  I'm curious to see who I'll end up dating first", "source": "empathetic_dialogues", "db_id": 11420}
{"text": "We used some of the money we'd set aside for my son's college to fix our hot water heater.  We're trying to repay it monthly til it's replenished.", "source": "empathetic_dialogues", "db_id": 11361}
{"text": "I took the bus without paying for it. I feel bad afterward.", "source": "empathetic_dialogues", "db_id": 12559}
{"text": "My friend and I had planned to go hiking last Sunday morning. I overslept and the whole plan blew out. So disappointed in myself", "source": "empathetic_dialogues", "db_id": 11255}
{"text": "As I attend all the graduations over the summer for family, I can't help to think back to my graduation.", "source": "empathetic_dialogues", "db_id": 11370}
{"text": "Before I met my girlfriend I felt lonely very often, I am glad that is better now", "source": "empathetic_dialogues", "db_id": 13227}
{"text": "I never get to go out and see people.", "source": "empathetic_dialogues", "db_id": 12716}
{"text": "My dog is 16 years old. He is starting to have health problems.", "source": "empathetic_dialogues", "db_id": 11654}
{"text": "I heard a noise outside my window! I hope nobody is out there waiting to kill me!", "source": "empathetic_dialogues", "db_id": 11664}
{"text": "My friends left to dinner without me since I canceled last minute.", "source": "empathetic_dialogues", "db_id": 12669}
{"text": "I took out the trash this morning. The trash bag ripped open and made a mess, I didn't clean it up. I felt so bad.", "source": "empathetic_dialogues", "db_id": 11824}
{"text": "I just got a new car. I parked it in front of my house. Right away some neighborhood teens came around and keyed it. Now I have to get it fixed.", "source": "empathetic_dialogues", "db_id": 13135}
{"text": "I've a business meeting tomorrow. I'm looking forward to it. Hope I'll do my best.", "source": "empathetic_dialogues", "db_id": 12528}
{"text": "I need to replace the engine in my car.  I am sure I can do it.", "source": "empathetic_dialogues", "db_id": 12348}
{"text": "My husband's been out of town this week, and will be gone for another week.  It's so quiet around the house, I can't get used to it.", "source": "empathetic_dialogues", "db_id": 12830}
{"text": "Everything is alright these days", "source": "empathetic_dialogues", "db_id": 11389}
{"text": "I got an extra 2 days paid time off from work.", "source": "empathetic_dialogues", "db_id": 12821}
{"text": "My parents planned a welcoming party for me.", "source": "empathetic_dialogues", "db_id": 11346}
{"text": "I was embarrassed when I fell at school.", "source": "empathetic_dialogues", "db_id": 12574}
{"text": "My cat has to be put down next week. She has been very sick for a month and not improving.", "source": "empathetic_dialogues", "db_id": 12849}
{"text": "i was suprised when i saw this guy dunk the other ball the other day", "source": "empathetic_dialogues", "db_id": 12328}
{"text": "My friend used to not be very active. Now she does triathlons!", "source": "empathetic_dialogues", "db_id": 11753}
{"text": "MY new neighbors have people coming in and out at all times of the night", "source": "empathetic_dialogues", "db_id": 11984}
{"text": "My social anxiety acted up and I failed at doing basic math in my head when paying the cashier and looked like an idiot!", "source": "empathetic_dialogues", "db_id": 12013}
{"text": "I am going back to school. I never thought I would. I can't wait", "source": "empathetic_dialogues", "db_id": 12829}
{"text": "If I'm going on a date with a really attractive girl I sometimes feel more ready if I have a drink beforehand.", "source": "empathetic_dialogues", "db_id": 11368}
{"text": "I made a brilliant pizza the other day", "source": "empathetic_dialogues", "db_id": 11298}
{"text": "I was afraid during the earthquake.", "source": "empathetic_dialogues", "db_id": 12175}
{"text": "I am upset the Eagles lost yesterday, they lost to the worst team in the league, and got shutout", "source": "empathetic_dialogues", "db_id": 11844}
{"text": "I slipped while carrying a tray of coffee. I got it all over myself.", "source": "empathetic_dialogues", "db_id": 11546}
{"text": "My friend invited me on a cruise but I wasn't sure about it because I get seasick easily.", "source": "empathetic_dialogues", "db_id": 12834}
{"text": "My cat vomited on my shoes the other day", "source": "empathetic_dialogues", "db_id": 12579}
{"text": "I went to six flags last year and got on a roller coaster for the first time. And when it stated I was ok but as went on I was scared to death.", "source": "empathetic_dialogues", "db_id": 13143}
{"text": "My daughter said her first word yesterday. I was so filled with pride.", "source": "empathetic_dialogues", "db_id": 12923}
{"text": "When i was younger i wanted a new computer so bad. I didn't have good parts and the computer was so slow. When i got the new computer i was ecstatic. ", "source": "empathetic_dialogues", "db_id": 12280}
{"text": "There's 2 escaped convicts loose in my town! They were last seen in my neighborhood!", "source": "empathetic_dialogues", "db_id": 12291}
{"text": "I just got cable and ther is seriously nothing on any of these 600 channels", "source": "empathetic_dialogues", "db_id": 12004}
{"text": "My nephew dropped his ice cream on the ground and started crying. His older brother gave him his ice cream.", "source": "empathetic_dialogues", "db_id": 11800}
{"text": "I asked my friend to get some stuff for a party, I knew I could count on him though.", "source": "empathetic_dialogues", "db_id": 11942}
{"text": "I saw a guy scratching his behind on the train this morning.", "source": "empathetic_dialogues", "db_id": 12870}
{"text": "Everytime my friend comes over and brings his kids, he never keeps a close eye on them and they ravage my place!", "source": "empathetic_dialogues", "db_id": 11716}
{"text": "I am grateful for my life right now, I have a girlfriend, a good job, and a good group of friends", "source": "empathetic_dialogues", "db_id": 11989}
{"text": "My manager has taken my coworker for a work trip to New York. I was also suppose to go with them.", "source": "empathetic_dialogues", "db_id": 12153}
{"text": "I am looking forward to tomorrow. I think church will be good for me", "source": "empathetic_dialogues", "db_id": 11739}
{"text": "i'm so mad at my sister because she always talks bad things about me behind my back", "source": "empathetic_dialogues", "db_id": 12531}
{"text": "I recently saw someone eat a week old tuna sandwich.  I wanted to throw up.", "source": "empathetic_dialogues", "db_id": 12946}
{"text": "I was furious when my mom was gossipped about.", "source": "empathetic_dialogues", "db_id": 12395}
{"text": "On my drive home from work I noticed there were a lot of dark clouds rolling in. Usually this means there will be a lot of rain. I anticipated thunderstorms and was right.", "source": "empathetic_dialogues", "db_id": 12714}
{"text": "I was forced to give a speech in front of a large and completly full auditorium. I had barley any time to prepare and really had no idea what I was supposed to say.", "source": "empathetic_dialogues", "db_id": 11312}
{"text": "My brother had to go out of town with his family to a funeral lst month.He asked me to take care of his house plant for him and I said yes, but after he left I got so caught up in myself i forgot to water his plants and they all died.", "source": "empathetic_dialogues", "db_id": 11274}
{"text": "I was very positively suprissed by the work done by a coworker.", "source": "empathetic_dialogues", "db_id": 12295}
{"text": "I am going wakeboarding this weekend for the 5th time this summer!  I am really good at it and can do some flawless jumps!  I wonder if I should go pro!", "source": "empathetic_dialogues", "db_id": 11295}
{"text": "I once trsuted my dog to not run off. he is a good boy.", "source": "empathetic_dialogues", "db_id": 11616}
{"text": "I know I will win my court case.", "source": "empathetic_dialogues", "db_id": 11845}
{"text": "I was pretty surprised that my friend was able to step his money game up last week.  I was pretty proud of him", "source": "empathetic_dialogues", "db_id": 11446}
{"text": "Someone threw a pretzel at me at the baseball game.  I was so mad at that guy.", "source": "empathetic_dialogues", "db_id": 13051}
{"text": "i get frustrated when i let someone out in traffic and dont get a wave", "source": "empathetic_dialogues", "db_id": 11859}
{"text": "I felt successful when I received an internship offer last year. I know I beat out some other candidates!", "source": "empathetic_dialogues", "db_id": 12208}
{"text": "My best friend just got a girlfriend who is smoking hot. I wish I could find a girl like that. I don't know how he did it.", "source": "empathetic_dialogues", "db_id": 11612}
{"text": "My car gets me where i need to go.", "source": "empathetic_dialogues", "db_id": 12366}
{"text": "I lost my Grandpa 2 months ago.  He died within a week all of a sudden and I miss him every day.", "source": "empathetic_dialogues", "db_id": 12633}
{"text": "I can't believe they threw me a party for my birthday!", "source": "empathetic_dialogues", "db_id": 11271}
{"text": "Watching someone stream an old video game on Twitch, one that I used to play. It's one that's like almost 20 years old, that I used to play when I was 11. Makes me wish I didn't have so many bills and responsibilities!", "source": "empathetic_dialogues", "db_id": 11668}
{"text": "I ordered McDonalds yesterday and since my lazy daughter wouldn't get out of bed I ate her food. I kind of fell bad about it.", "source": "empathetic_dialogues", "db_id": 12657}
{"text": "I saw a homeless man sleeping near Walmart when i came out after shopping. It was so sad to see him in such situation", "source": "empathetic_dialogues", "db_id": 11908}
{"text": "I came home from grocery shopping to find that my husband had cleaned the entire house up and started dinner.  I was amazed.", "source": "empathetic_dialogues", "db_id": 12730}
{"text": "I was supposed to go to Busch Gardens last weekend , but it was raining and we had to cancel.", "source": "empathetic_dialogues", "db_id": 13060}
{"text": "My friend is coming in from out of town today.", "source": "empathetic_dialogues", "db_id": 12721}
{"text": "I saw a snake outside my apartment today", "source": "empathetic_dialogues", "db_id": 11593}
{"text": "a situation where i felt that way would be when i graduated school", "source": "empathetic_dialogues", "db_id": 11532}
{"text": "I walked into my physics exam after studying for it for days. I was so hyped that I was gonna get an A on it.", "source": "empathetic_dialogues", "db_id": 11855}
{"text": "I am a first generation Filipino.  I am Maharlika, a warrior class meaning \"Chosen by God\" and I'm one of the last of my kind.  I've got royal blood running through my veins", "source": "empathetic_dialogues", "db_id": 13113}
{"text": "On my first crazy roller coaster.", "source": "empathetic_dialogues", "db_id": 12683}
{"text": "i was excited when i got to leave work early", "source": "empathetic_dialogues", "db_id": 11356}
{"text": "I was just accused from my wife that I stole $10 from her Purse. I am so furious right now, I would never do that", "source": "empathetic_dialogues", "db_id": 12751}
{"text": "Was playing rough with my relatives, running around outside, doing touch football. I think I twisted my ankle or something. I'm dumb and don't have health insurance this year.. Worried how much money I'm gonna have to spend", "source": "empathetic_dialogues", "db_id": 12697}
{"text": "I got spayed in the face with wound juices", "source": "empathetic_dialogues", "db_id": 12739}
{"text": "I ordered a half pound of turley and the lady at the deli gave me roast beef. I didn't notice until we got home. It was terrible", "source": "empathetic_dialogues", "db_id": 12220}
{"text": "I felt embarrassed when I went in too the store with my clothes dirty", "source": "empathetic_dialogues", "db_id": 11568}
