{"text": "Dead don't come up to me tryna me funny with that forced ass New York accent talking abt some \"deadass b on my timbs\" soo dayroom 😴😴 URL", "source": "berkeley"}
{"text": "Yes_comma_ I was really happy to see him at the top of his class_comma_ too! It was a cool moment.", "source": "empathetic_dialogues"}
{"text": "I've been to so many places on that day it would be really hard to do it", "source": "empathetic_dialogues"}
{"text": "I'm not really sure. I think if I write things out that I could possibly need I won't forget anything.", "source": "empathetic_dialogues"}
{"text": "There is nothing wrong with imperfect photos and it's great that you remember it. Sometimes photos shared online are so heavily edited and filtered that you lose focus of the true memory.", "source": "prosocial"}
{"text": "I know_comma_ it's just so frustrating after spending so long building your lives together. ", "source": "empathetic_dialogues"}
{"text": "Making off-hand comments about the long suffering of a race is not very appropriate, nor is it productive. You should find more creative ways to accept rejection without resorting to holocaust references.", "source": "prosocial"}
{"text": "Fuck all Russian loving racists who rape children", "source": "berkeley"}
{"text": "My boss and I went to lunch and had a personal conversation about some life issues. ", "source": "empathetic_dialogues"}
{"text": "Disneyland? I forgot there's a difference between \"land\" and \"world\". I hope you had a great time", "source": "empathetic_dialogues"}
{"text": "I cannot believe what you are saying! Why would you call a lady's baby ugly?", "source": "prosocial"}
{"text": "Every day I practice - I'll be back on the golf course in no time_comma_ lol.", "source": "empathetic_dialogues"}
{"text": "Im a little \"ah\" about it - i dont understand why they couldnt just wait for me to get a day off to go with them. ", "source": "empathetic_dialogues"}
{"text": "Everyone should be treated equally. Disability is not an excuse for bad behavior and getting away with things if they know they can.", "source": "prosocial"}
{"text": "I went there on autopilot, I was blank inside and I was ready to jump. My counsellor saw me through the window and called me on the phone, trying to distract me so she could send help over to me. Campus was pretty much empty, everyone in exams or already finished for the summer and I felt at peace. I was gently talked away from the edge by campus security and they took me to see my counsellor. I havent seen her since this happened and Im due back at uni next week.", "source": "dreaddit"}
{"text": "I doubt it'll take us that long to get rid of all the straight people.", "source": "berkeley"}
{"text": "When you see them again it will be worth a wait!!", "source": "empathetic_dialogues"}
{"text": "What has caused you to feel so depressed?", "source": "prosocial"}
{"text": "\"It's not the Christianity of Constantine that can face the challenge of secularism, but the Christianity of the catacombs.\" @BrianZahnd #PostcardsFromBabylon", "source": "berkeley"}
{"text": "Has anyone dealt with urinary retention as a side effect of lexapro? I've been taking lexapro for like 2 weeks or so, and in the past week it has become very difficult to pee, even at home (it sometimes takes a lot of pushing, and my bladder never feels like it's truly empty.). And the more I have to go, the harder it is, so I try to go often, like every 30 mintues or hour or so (even at night). I can barely eat or drink anything anymore. I did some research and it appears that urinary retention could be a side affect of lexapro.", "source": "dreaddit"}
{"text": "What will happen if you throw the drink at your cousin?", "source": "prosocial"}
{"text": "That's awesome! I'm proud of you_comma_ buddy.", "source": "empathetic_dialogues"}
{"text": "Regardless of what you think, you should not call people weird.", "source": "prosocial"}
{"text": "20 bucks there's a vigil saying how he was a good boy and dindu nuffin, he was gunned down by cops as he was peacefully lying down to be arrested and the wypipo all cheered when he was murdered. Truth is crazy fuckers are going to do crazy shit with whatever they can get their hands on like a truck or some propane tanks and a flare, a bike lock or they'll just bite people to death. IF this gets national coverage it'll get spun that he was radicalized by the toxic climate and divisive rhetoric that's pushed by \"Mr.\" Trump and his army of white nationalists. Crazy stuff.", "source": "berkeley"}
{"text": "I knew a white guy adopted into a white family who also had a black brother. I never met his family but he was a really kind, caring person and we were best friends for a while which was nice :)", "source": "berkeley"}
{"text": "If you and Spot have a good friendship, it is good to adopt him. Dogs are good companions, and as long as you take care of him properly, it will be good for both of you.", "source": "prosocial"}
{"text": "Inshallah, that kiddie fucker gets locked up soon.", "source": "berkeley"}
{"text": "Eat a dick. I'll bet you never got into a fight. Pussy", "source": "berkeley"}
{"text": "Why do you want to have a free piece of art?", "source": "prosocial"}
{"text": "Naw_comma_ my friends ditched me last night. It was a horrible night.", "source": "empathetic_dialogues"}
{"text": "On the occasion of #Eid, these LeT terrorists destroyed the sanctity of the Jamia Masjid, Kulgam; they were preaching from the mosque with a gun in their hands & the people allowed them to do so. Imagine the furor if a non-Muslim had disrespected the mosque like this. @Ibne_Sena URL", "source": "berkeley"}
{"text": "We broke down and couldn't get help for several hours as we were out of cell range. Good thing I had packed extra food and water.", "source": "empathetic_dialogues"}
{"text": "I have very bad teeth and I feel embarrassed whenever anyone stares at my mouth.", "source": "empathetic_dialogues"}
{"text": "You are being a nuisance to your family, you need to have asked their permission first if they wanted their food eaten or if you could have an egg.", "source": "prosocial"}
{"text": "Wrecks can be a scary thing to just miss. Was it the other persons fault?", "source": "empathetic_dialogues"}
{"text": "{\"experience_type\": \"Current Experience\", \"emotion_type\": \"depression\", \"problem_type\": \"ongoing depression\", \"situation\": \"I'm kind of just generally feeling seasonal depression as I don't feel happy,\", \"survey_score\": {\"seeker\": {\"initial_emotion_intensity\": \"4\", \"empathy\": \"4\", \"relevance\": \"5\", \"final_emotion_intensity\": \"3\"}, \"supporter\": {\"relevance\": \"5\"}}, \"dialog\": [{\"text\": \"Hello there\", \"speaker\": \"usr\"}, {\"text\": \"Hi, how are you?\", \"speaker\": \"sys\", \"strategy\": \"Question\"}, {\"text\": \"Im okay, just a bit out of it\", \"speaker\": \"usr\"}, {\"text\": \"Ok, how may I help you?\", \"speaker\": \"sys\", \"strategy\": \"Question\"}, {\"text\": \"I'm just feeling depressed with the year ending\", \"speaker\": \"usr\"}, {\"text\": \"This year wasn't a great one\", \"speaker\": \"usr\"}, {\"text\": \"Yes, it is the same for most of the people. Any thing particular bothering you?\", \"speaker\": \"sys\", \"strategy\": \"Affirmation and Reassurance\"}, {\"text\": \"I think just general how covid hasn't been resolved yet\", \"speaker\": \"usr\"}, {\"text\": \"Its sad being stuck at home\", \"speaker\": \"usr\"}, {\"text\": \"So, you cannot go out due to COVID and that makes you frustrated. Is that correct?\", \"speaker\": \"sys\", \"strategy\": \"Restatement or Paraphrasing\"}, {\"text\": \"More sad I would say\", \"speaker\": \"usr\"}, {\"text\": \"Have you done anything different than usual while staying at home?\", \"speaker\": \"sys\", \"strategy\": \"Question\"}, {\"text\": \"No not really. I just finished the semester\", \"speaker\": \"usr\"}, {\"text\": \"You could explore some of your hobbies, such as music, painting, or workingout..\", \"speaker\": \"sys\", \"strategy\": \"Providing Suggestions\"}, {\"text\": \"Hmm what specific hobbies would you recomend?\", \"speaker\": \"usr\"}, {\"text\": \"Whichever you enjoy.. pick one. There are a lots of online resources you cloud use.\", \"speaker\": \"sys\", \"strategy\": \"Providing Suggestions\"}, {\"text\": \"Do you know of any specific online resources? I haven't looked at this before\", \"speaker\": \"usr\"}, {\"text\": \"What would you like to do in your spare time?\", \"speaker\": \"sys\", \"strategy\": \"Question\"}, {\"text\": \"Mainly just watching youtube vids\", \"speaker\": \"usr\"}, {\"text\": \"Have you ever thought of creating videos for YouTube?\", \"speaker\": \"sys\", \"strategy\": \"Providing Suggestions\"}, {\"text\": \"I haven't. I might try that. Thanks for the suggestion\", \"speaker\": \"usr\"}, {\"text\": \"Yes, give it a try.. you might like and it will keep you busy during stay home time..\", \"speaker\": \"sys\", \"strategy\": \"Providing Suggestions\"}, {\"text\": \"Okay thank you I will!\", \"speaker\": \"usr\"}, {\"text\": \"Anyting else, I can hlep you with?\", \"speaker\": \"sys\", \"strategy\": \"Providing Suggestions\"}, {\"text\": \"No I think I'm good\", \"speaker\": \"usr\"}, {\"text\": \"Please click \\\"Finish and Quit\\\" to close the chat.. thank you.\", \"speaker\": \"sys\", \"strategy\": \"Providing Suggestions\"}], \"seeker_question1\": \"N/A\", \"seeker_question2\": \"N/A\", \"supporter_question1\": \"No\", \"supporter_question2\": \"No\"}", "source": "esconv"}
{"text": "Lol operation \"Scared Nutless\" is in action. ", "source": "empathetic_dialogues"}
{"text": "What makes you think it's alright to hold a knife in the temple?", "source": "prosocial"}
{"text": "Sounds good_comma_ when she got back I hope you schooled her on Halo ?", "source": "empathetic_dialogues"}
{"text": "Thanks to effeminate European liberals, the plan is a greater success than we could possible imagine! #Qanon #europe #maga #SundayThoughts #nwo #soros #democrats #liberals #2ADefenders #illeglimmigration #germany URL", "source": "berkeley"}
{"text": "The ones with the little colored sliders on the end? Those were cool!", "source": "empathetic_dialogues"}
{"text": "That sounds fun_comma_ did she have a good time?", "source": "empathetic_dialogues"}
{"text": "oh_comma_ i bet you are nervous. I'm sure she will be okay but i would be so nervus", "source": "empathetic_dialogues"}
{"text": "Where? When? My best friend just came out to me, I've known the guy since childhood and always knew he was gay. I am SO happy for him. And I am so happy for you!", "source": "berkeley"}
{"text": "My dad took me to a golf championship_comma_ the PGA that came to my home town last May. All the famous golfers you see on TV were there and I tripped down a hill in a dress!", "source": "empathetic_dialogues"}
{"text": "Aye I'm Laughing But This Shit Sad Asl Really ....Can't Believe Y'all Would Protect Some Bitches Over Y'all Own Member ...I Protected U Niggas On L'a ....Da Hood Really Let Me Down😞😔 I Risked It All For Yall💔", "source": "berkeley"}
{"text": "Yes I was. I thought it was pretty intense to watch", "source": "empathetic_dialogues"}
{"text": "Why should women be held for a man personal decision to commit suicide?", "source": "prosocial"}
{"text": "What is your reason for wanting to go alone?", "source": "prosocial"}
{"text": "I can have any nigga I want so quit playing with me😉", "source": "berkeley"}
{"text": "Oh you left some out then? Were they worse ones?", "source": "empathetic_dialogues"}
{"text": "You should know what it feels like then to be that cold, so why not just be a gentle person and share around so they don't have to feel the same thing? Kindness takes someone very far, wouldn't you love for someone to do the same thing to you?", "source": "prosocial"}
{"text": "You will never convert these fuckwits. Abandoning them means nothing. What we need to do is build a coaltion of support down south and force it on them. They'll go along.", "source": "berkeley"}
{"text": "That sounds cool_comma_ but also too good to be true. I hope it is true though", "source": "empathetic_dialogues"}
{"text": "My problems started after my first panic attack which had happened in October. After that I had a lot of anxiety about my heart (bp 140/90) I was medicated with Zoloft for a while, it helped but I didn't want to become dependent on it and I had a lot of side effects. My bp with Zoloft was around 120/70 After some weeks the anxiety came back with horror, fear of the death and lump in a neck, stiffness in chest. My blood thyroid hormones were measured, everything's perfect.", "source": "dreaddit"}
{"text": "That is a bad thing to do. You shouldn't try to trip anyone. The old lady could have broken a bone or something worse could have happened.", "source": "prosocial"}
{"text": "Vandetta went on a rampage to rid the world of women.", "source": "berkeley"}
{"text": "Hi all. I recently moved to another country and it pretty much cost everything to get set up here. My roommate just moved out to start a new chapter with their significant other, taking pretty much all the furniture with them and naturally, rent has gone up. I'm wiped out until the 17th. I, my wife and daughter would appreciate any help to tide us over.", "source": "dreaddit"}
{"text": "Thinking your family is a bunch of losers doesn't seem like a very good reason. It's wrong to dislike your family for silly reasons. You'd hate to lose their support if you need it in the future.", "source": "prosocial"}
{"text": "That's a poor excuse. The money wasn't yours to keep. Give it back.", "source": "prosocial"}
{"text": "my girlfriend just told me that she's pregnant!", "source": "empathetic_dialogues"}
{"text": "Sometimes I listen to the media and think the US is horrible then remember how blessed I am, God bless Hong Kong.", "source": "berkeley"}
{"text": "Wow_comma_ did you fall on your butt that hard?", "source": "empathetic_dialogues"}
{"text": "Why do you want to bring fast food to a social event?", "source": "prosocial"}
{"text": "This nigga trash throw this man into the compost", "source": "berkeley"}
{"text": " I lent my friend 500$ and she never paid me back. Ugh. I am too nice sometimes.", "source": "empathetic_dialogues"}
{"text": "I’m a previous victim of abuse at home and since moving to university (the abuse ended way before uni) I’ve experienced very frequent nightmares both relating to and completely unrelated to my previous problems. It’s hard for me to go more than 3 nights without having at least a couple of nightmares a night, most of which relating to my trauma. Has anyone else experienced this? If so, would anyone be able to offer some advice on how to address these nightmares as they’re starting to affect my studies. Thank you in advance", "source": "dreaddit"}
{"text": "I'm completely overwhelmed. I think this process is about the best I can think of (below), but I really, desperately just want to dive back into my career. Am I wrong to think I'm not emotionally ready? Should I force myself to wait? Is there anything else I could plan on doing?", "source": "dreaddit"}
{"text": "Bipolar is not always how it is depicted on TV, especially if it is properly managed. You should not think that he should avoid her just because she is bipolar.", "source": "prosocial"}
{"text": "So I had a customer sign the wrong form today. I feel kind of bad because I'll have to have them sign the right thing next time and I'll look incompetent.", "source": "empathetic_dialogues"}
{"text": "I'm sorry you don't understand the real reason why Blackface was so bad. It wasn't just because you put black fucking paint on your face you dumb bitch LOL. Like I said educate yourself. It's 2019...we don't need a dumb nigga bringing the rest of us down cuz you want to play VICTIM. Fucking disgrace.  Your ancestors are rolling in their graves...idek why i'm even tryna explain this shit to you...clearly your mind isn't capable of understanding why you're so stupid...there's always that 1 clapped bitch who chats bare shit. Congratulations Gervinho...in this thread it's you!", "source": "berkeley"}
{"text": "My friend got a bouquet from her boyfriend the other day", "source": "empathetic_dialogues"}
{"text": "Banners like those make me believe that I can just genocide or enslave the population of a whole territory and force the inhabitants to convert to my religion, and a few generations later, their descendants would worship my arrival as \"saviors who introduced the ignorant heathens to God's light\". Truly a bunch of cuckolds.", "source": "berkeley"}
{"text": "The dog was there with my throughout my life. He saw me through boyfriends and friends.", "source": "empathetic_dialogues"}
{"text": "Oh! Well i haven't seen that yet. was the action at least somewhat decent?", "source": "empathetic_dialogues"}
{"text": "Where was any doubt. Fanboys can burn their energy defending him but facts remain facts.", "source": "berkeley"}
{"text": "You should not do it because it is attempted murder and not because I dislike it. I'm just telling you that most people will believe you're psychotic if you plant a bomb outside of someone's house, regardless of if it is their birthday or not.", "source": "prosocial"}
{"text": "Bring this to your boss's attention because your co-worker's work might start trickling into your day-to-day responsibilities and that is not fair to you. It might be a good time to ask about a salary increase if your colleague stops showing up to work.", "source": "prosocial"}
{"text": "Holy moly_comma_ that's some rough luck. Did you find the guy who did it?", "source": "empathetic_dialogues"}
{"text": "Yay! It's BEAUTIFUL. If you go_comma_ you will love it. ", "source": "empathetic_dialogues"}
{"text": "Y'all look at this shit @bcu_whoe , horrible representation of a bcu woman URL", "source": "berkeley"}
{"text": "No way! Thats awesome!! How old is your son?", "source": "empathetic_dialogues"}
{"text": "This is a sticky situation. If the accusations are so bad, then maybe ditching both of them is the way to go here or you can try to mediate between them to resolve their issues.", "source": "prosocial"}
{"text": "men should all die in a fire honestly they are a threat to the world", "source": "berkeley"}
{"text": "I hate how social media act like men suppose to go ape shit over chicks with a fat ass or big titties. Yea a lot of dudes do but there's some dudes who actually have common sense", "source": "berkeley"}
{"text": "I was so scared! I almost fainted twice_comma_ and I was so pale and rigid! Looking back it was kind of funny. But I am glad I overcame the fear.", "source": "empathetic_dialogues"}
{"text": "My father is an alcoholic, and he has been for about 34 years. My mom has had to deal with this the entire time, and lately, he has been having parties at their house and drinking up until 3-4am almost every weekend. He drinks everyday, and my mother usually comes to me to vent about it. I’ve honestly lost my patience because I feel she should do something about it, but she won’t. She’s afraid to leave because he says he’ll accuse her of abandoning the home.", "source": "dreaddit"}
{"text": "haha dogs always want to go out and play.", "source": "empathetic_dialogues"}
{"text": "My kids birthday was last weekend_comma_ my whole family showed up! they didn't even tell me they were coming", "source": "empathetic_dialogues"}
{"text": "I don't know what that thing is_comma_ but it has way too many legs for my comfort", "source": "empathetic_dialogues"}
{"text": "Are you wanting to study more at school?", "source": "prosocial"}
{"text": "Communicating is almost always the better option. The better you get at working these problems out, the less of problems they are in the future.", "source": "prosocial"}
{"text": "M point was more that catholics and other types of Christians do the same so i just thought that Christians might be better fit instead of evangelics  Im an atheist myself", "source": "berkeley"}
{"text": "You can't expect everyone to accept your fetish. Sometimes you just have to move on, or if you're so inclined, try to shed your fetish in counseling.", "source": "prosocial"}
{"text": "And I'm feeling continuously happy for the first time in a long time. But I'm pretty sure it seems crazy to anyone watching. In short: Has anyone recovered from trauma and felt this way? Has anyone developed schizophrenia or a bipolar disorder and felt this way? Is it okay to accept this?", "source": "dreaddit"}
{"text": "I would try target.  good quality stuff there.", "source": "empathetic_dialogues"}
{"text": "Oh no!  Why did it take them so long to get back with you?", "source": "empathetic_dialogues"}
{"text": "Are you talking about actually cutting off your own limbs, in the physical sense?", "source": "prosocial"}
{"text": "{\"experience_type\": \"Current Experience\", \"emotion_type\": \"anger\", \"problem_type\": \"conflict with parents\", \"situation\": \"I had an argument with my parents over my girlfriend.\", \"survey_score\": {\"seeker\": {\"initial_emotion_intensity\": \"5\", \"empathy\": \"5\", \"relevance\": \"5\", \"final_emotion_intensity\": \"3\"}, \"supporter\": {\"relevance\": \"2\"}}, \"dialog\": [{\"text\": \"Good evening :-) How are you tonight?\", \"speaker\": \"sys\", \"strategy\": \"Others\"}, {\"text\": \"I\\u2019m ok. I\\u2019m just calming down.\", \"speaker\": \"usr\"}, {\"text\": \"That's good that you're calming down but were you previously upset?\", \"speaker\": \"sys\", \"strategy\": \"Question\"}, {\"text\": \"I got into a major blowout with my parents.\", \"speaker\": \"usr\"}, {\"text\": \"That's really rough, I'm sorry to hear that.\", \"speaker\": \"sys\", \"strategy\": \"Affirmation and Reassurance\"}, {\"text\": \"I\\u2019m just so upset. They don\\u2019t approve of my girlfriend.\", \"speaker\": \"usr\"}, {\"text\": \"And they would like you to break up with her?\", \"speaker\": \"sys\", \"strategy\": \"Question\"}, {\"text\": \"Oh definitely.\", \"speaker\": \"usr\"}, {\"text\": \"It's complicated when parents want input into their child's relationships. That is really explosive stuff.\", \"speaker\": \"sys\", \"strategy\": \"Reflection of feelings\"}, {\"text\": \"I\\u2019m not giving in. I really like her and she is soooo hot.\", \"speaker\": \"usr\"}, {\"text\": \"Are you going to have to be around your parents soon after this?\", \"speaker\": \"sys\", \"strategy\": \"Question\"}, {\"text\": \"Yes I will be. Just because she is black, they don\\u2019t approve.\", \"speaker\": \"usr\"}, {\"text\": \"Oof, I see. I can understand you being upset by that, it's a silly reason to disapprove. Was the blowout in any way productive or just angry?\", \"speaker\": \"sys\", \"strategy\": \"Reflection of feelings\"}, {\"text\": \"Just angry. I\\u2019m not sure what to do.\", \"speaker\": \"usr\"}, {\"text\": \"I don't know that this problem will be solved with one single choice or conversation. Do you live with your parents?\", \"speaker\": \"sys\", \"strategy\": \"Affirmation and Reassurance\"}, {\"text\": \"I do not. I was thinking of having my girlfriend move in with me.\", \"speaker\": \"usr\"}, {\"text\": \"Ah, well then their opinion of your romantic relationships is 100% irrelevant.\", \"speaker\": \"sys\", \"strategy\": \"Providing Suggestions\"}, {\"text\": \"I guess but I don\\u2019t want to not have them in my life. But have I mentioned how hot my girlfriend is? Lol\", \"speaker\": \"usr\"}, {\"text\": \"So hot and dark. Yummy.\", \"speaker\": \"usr\"}, {\"text\": \"There's not an easy way to get people to let go of those kinds of beliefs. Yes, you did mention that, haha. Physical attraction is awesome but perhaps not the best basis to move someone in with you :-)\", \"speaker\": \"sys\", \"strategy\": \"Providing Suggestions\"}, {\"text\": \"Maybe not but it will be fun.\", \"speaker\": \"usr\"}], \"seeker_question1\": \"Good advice\", \"seeker_question2\": \"\", \"supporter_question1\": \"Seeker kept mentioning how hot his black girlfriend was and it made me uncomfortable\", \"supporter_question2\": \"I can't see the details about the seeker's case\"}", "source": "esconv"}
{"text": "Zionist Nazi mafia judge.. zionist plan is to flood America with 50 million more in the next 5 years", "source": "berkeley"}
{"text": "Maybe. Some people find \"dirty\" subjects uncomfortable.", "source": "prosocial"}
{"text": "Let me guess you must be white all you think about is yourself like trying to stop Mexicans from coming here but you took this land from the Mexicans and natives  Now we know NK can't hurt us!! But that tell me you don't know how things work. NK can attack out allies that we have to come to their defense by law SO THAT STILL PUTS US IN A WAR!!!! GET IT NOW? People online always running their mouths and don't understand a damn thing!!!!", "source": "berkeley"}
{"text": "I understand that you like zombie movies and you're fantasizing zombie apocalypse. I hope your joking about it really happening.", "source": "prosocial"}
{"text": "Trump means ask these 4 idiotic women democrats to follow their parents back to their counrry of origin even they are born in USA!!! . Not racist!!!", "source": "berkeley"}
{"text": "Yeah but he just seemed so disappointed when he came home for lunch.", "source": "empathetic_dialogues"}
{"text": "My point is that this isn't a new kind of debate. This is the other side of integration. It happened when universities integrated racially and historically black colleges/fraternities debated how to include white people.  And just like how those colleges/fraternities found they could ultimately advance their aims while including white people, women's sports can likely find a way to given women the benefit of athletics without having to exclude trans women or, honestly, men. You could imagine a \"historically women's league\" for example.", "source": "berkeley"}
{"text": "You dumb whore, put the baby up for adoption. If you don't want children, then don't have sex.", "source": "berkeley"}
{"text": "No, but they are thinking of asking 8 year olds if they masturbate.", "source": "berkeley"}
{"text": "He looks like those overly-aggressive, middle-aged women in bars that aggressively hit on young guys then start drama at the end of the night when no one wants to fuck them lol.", "source": "berkeley"}
{"text": "I'm sure that you feel lucky, but gambling that much money is not responsible. The games at the casino favor the casino and not the player, so you are likely to lose your money.", "source": "prosocial"}
{"text": "i did very well i was prepared. i was thinking id have to wait a couple months for the next session. but good thing i was able to get it out of the way", "source": "empathetic_dialogues"}
{"text": "Just a simple \"seen\" status can get me into a deep downward spiral of anxiety that suppresses my hunger, takes away my will to do anything, makes me nauseous, takes away my sleep. As soon as the person texts back, I immediately feel okay. I've had relationships with girls that I've felt this way. Both times it was long term and both times I ended it. I somehow find a way to ignore every good thing I had thought before and find all that I feel she misses on other girls.", "source": "dreaddit"}
{"text": "They've been there for me_comma_ too. Not many jobs care about their employees.", "source": "empathetic_dialogues"}
{"text": "Trolls Will Be Ignored the disgusting thing about all this is that your country actually has the resources but your Israeli passport holding congress gives your taxes to Israel. Why ye put up with these traitors is beyond my comprehension.........", "source": "berkeley"}
{"text": "So I went to see the new Marvel movie with Thanos. It was so good and I am so pumped up now.", "source": "empathetic_dialogues"}
{"text": "i regret watching horror movie last night because it kept me awake all through the night with much fear", "source": "empathetic_dialogues"}
{"text": "Then do it. You don't need my permission.", "source": "prosocial"}
{"text": "No criminal record, he’s not on any list, he changed his name and moved to a new town and no one there knows what he did and he’s been messaging her. I feel so hopeless. How am I supposed to feel safe? Or be able to sleep? He’s out there, consequence free, feeling safe enough to message her.", "source": "dreaddit"}
{"text": "Was the owner not around? Did the dog cause any harm?", "source": "empathetic_dialogues"}
{"text": "Great state of Alabama yeah right the racist devil", "source": "berkeley"}
{"text": "Lots of these men are emotional acting like women...they're whining, self-loathing, and grossly disrespectful. I pay them no mind because I know they're suffering from their own self-hate and issues. I refuse to settle for a person like that they're very confused and double talking. Those are the same guys in my face saying oh you're cute. I say thanks and keep it moving, life's a game I'm playing to win letting my shadow self guide me. Salkis you're a gift!", "source": "berkeley"}
{"text": "With the laws of the Holy Scriptures at your command you will be able to prosecute these White Supremacist at the full extend of God Laws. Simply repent unify, organize, armed yourself under TMH administration", "source": "berkeley"}
{"text": "I don't think there's any reason for you to be embarrassed about your weight. Your friends won't care, they'll just be happy that you're at their wedding. I think you should try to be more confident in yourself.", "source": "prosocial"}
{"text": "I hope so too. That is just not right. They could have left a note at least.", "source": "empathetic_dialogues"}
{"text": "i used to be a member of a cool dance crew. we had so much fun together. we used to battle other teams and win local competitions", "source": "empathetic_dialogues"}
{"text": "Damn i want you to suffocate me with your tits while fuck your pussy❤", "source": "berkeley"}
{"text": "{\"experience_type\": \"Current Experience\", \"emotion_type\": \"depression\", \"problem_type\": \"ongoing depression\", \"situation\": \"My daughter was hit by a car and I'm having depression over it.\", \"survey_score\": {\"seeker\": {\"initial_emotion_intensity\": \"5\", \"empathy\": \"5\", \"relevance\": \"5\", \"final_emotion_intensity\": \"4\"}, \"supporter\": {\"relevance\": \"5\"}}, \"dialog\": [{\"text\": \"Hello\", \"speaker\": \"usr\"}, {\"text\": \"hi my name is Lisa, how are you?\", \"speaker\": \"sys\", \"strategy\": \"Others\"}, {\"text\": \"I'm struggling to make it through the day. My daughter was hit by a car in September and the traumatic experience is weighing heavy on my brain.\", \"speaker\": \"usr\"}, {\"text\": \"it sounds like you are feeling troubled after your daughter's car accident am I right?\", \"speaker\": \"sys\", \"strategy\": \"Restatement or Paraphrasing\"}, {\"text\": \"Troubled would not be the word I would use, but it wasn't a car accident. She was hit by a car in the street outside of my house.\", \"speaker\": \"usr\"}, {\"text\": \"She was coming home from school. She is only 5.\", \"speaker\": \"usr\"}, {\"text\": \"that sounds like it would be a very traumatic experience, it's no wonder this is hard for you, it would be hard for anyone in this situation\", \"speaker\": \"sys\", \"strategy\": \"Affirmation and Reassurance\"}, {\"text\": \"I have a hard time getting out of bed in the morning.\", \"speaker\": \"usr\"}, {\"text\": \"How would you use to describe your feelings about this accident?\", \"speaker\": \"sys\", \"strategy\": \"Question\"}, {\"text\": \"I would say that I am anxious all the time. She survived, but she had some serious injuries after. I feel like a part of me died that day, the part that thought I could protect her no matter what. I would say that I'm also feeling ashamed because it was out of my control.\", \"speaker\": \"usr\"}, {\"text\": \"It sounds like you are dealing with a lot...it is normal to feel anxious about it\", \"speaker\": \"sys\", \"strategy\": \"Affirmation and Reassurance\"}, {\"text\": \"Is that how you would feel?\", \"speaker\": \"usr\"}, {\"text\": \"and it's hard not to blame ourselves, but please remember this was outside your control\", \"speaker\": \"sys\", \"strategy\": \"Others\"}, {\"text\": \"thank you for saying that. I quit my job to focus on her healing, and i don't want to go back to work now.\", \"speaker\": \"usr\"}, {\"text\": \"I have not experienced anything like this to be honest....the closest I can recall is encouraging my daughter to do something, and then she got hurt, and I blamed myself and felt like a bad mother\", \"speaker\": \"sys\", \"strategy\": \"Self-disclosure\"}, {\"text\": \"how is your daughter doing now?\", \"speaker\": \"sys\", \"strategy\": \"Question\"}, {\"text\": \"She is healing well, she has a moderate TBI (traumatic brain injury) so there is still so much uncertainty. It sucks to blame ourselves for things that happen to our kids.\", \"speaker\": \"usr\"}, {\"text\": \"the fact that you felt the need to quit your job shows how deeply this has affected you...do you miss your work?\", \"speaker\": \"sys\", \"strategy\": \"Question\"}, {\"text\": \"No. And I'm completely dreading going back to work. I wish I could somehow get paid to exist so that I can just stay home with my daughter all day.\", \"speaker\": \"usr\"}, {\"text\": \"it sounds like you need to be with your daughter all day but also need the income that work would afford, am i right?\", \"speaker\": \"sys\", \"strategy\": \"Restatement or Paraphrasing\"}, {\"text\": \"YES. And if you can figure out how to make that happen I'll give you 10% of the salary lol.\", \"speaker\": \"usr\"}, {\"text\": \"hehe...0% is all I'd ask for...\", \"speaker\": \"sys\", \"strategy\": \"Others\"}, {\"text\": \"how about part time work would that be possible for you?\", \"speaker\": \"sys\", \"strategy\": \"Providing Suggestions\"}, {\"text\": \"I've been looking for a remote part time job that has pay equivalent to a full time job. Apparently, that's not a thing.\", \"speaker\": \"usr\"}, {\"text\": \"i see...I would not know how to find such a job, i've often thought that would be a great thing to do..\", \"speaker\": \"sys\", \"strategy\": \"Self-disclosure\"}, {\"text\": \"i have a question\", \"speaker\": \"sys\", \"strategy\": \"Question\"}, {\"text\": \"What's your question.\", \"speaker\": \"usr\"}, {\"text\": \"is there a friend or family member that can spend time with your daughter so it's easier to get back to maybe a part time job?\", \"speaker\": \"sys\", \"strategy\": \"Providing Suggestions\"}, {\"text\": \"I don't have a family. Just my daughter, and my boyfriend who lives in Australia that can't come here due to Covid restrictions. She does see her Dad everyday, but the part time hours I would need would have to be flexible and no company is even really hiring part time at the moment from what I can tell.\", \"speaker\": \"usr\"}, {\"text\": \"I see. I wonder if you have spoken to a doctor about how you feel? Struggling to get through the day must be so difficult. I wonder if it might be helpful to get screened for depression\", \"speaker\": \"sys\", \"strategy\": \"Providing Suggestions\"}, {\"text\": \"I have a psychiatrist and a therapist that I have been working with. Their solution is medication which I am extremely against.\", \"speaker\": \"usr\"}], \"seeker_question1\": \"It was great!\", \"seeker_question2\": \"N/A\", \"supporter_question1\": \"no\", \"supporter_question2\": \"les annoying dings\"}", "source": "esconv"}
{"text": "{\"experience_type\": \"Current Experience\", \"emotion_type\": \"depression\", \"problem_type\": \"ongoing depression\", \"situation\": \"I am in a deep depression, have no friends or family to talk to. I also started drinking\", \"survey_score\": {\"seeker\": {\"initial_emotion_intensity\": \"5\", \"empathy\": \"5\", \"relevance\": \"5\", \"final_emotion_intensity\": \"2\"}, \"supporter\": {\"relevance\": \"5\"}}, \"dialog\": [{\"text\": \"Hi, I am looking for someone to talk to\", \"speaker\": \"usr\"}, {\"text\": \"Hey there, I'm here to listen and help :)\", \"speaker\": \"sys\", \"strategy\": \"Information\"}, {\"text\": \"Is there anything is particular that is bothering you?\", \"speaker\": \"sys\", \"strategy\": \"Information\"}, {\"text\": \"I feel very lonely and depressed. I see no point to live\", \"speaker\": \"usr\"}, {\"text\": \"I have no friends or family by my side\", \"speaker\": \"usr\"}, {\"text\": \"Hey, don't say that. Listen everyone is going through a tough time due covid. What keeps me going is, I look deep down on the inside and find 3 things that keeps me going.\", \"speaker\": \"sys\", \"strategy\": \"Affirmation and Reassurance\"}, {\"text\": \"You must be a lucky person. I do not see anything in myself what could keep me going. I do not understand how others cope\", \"speaker\": \"usr\"}, {\"text\": \"Listen you have to be kind to yourself, forgive yourself of whatever it is that is bothering you and then let it go.\", \"speaker\": \"sys\", \"strategy\": \"Providing Suggestions\"}, {\"text\": \"I used to liked reading, now I just stare at TV without even realising what is on\", \"speaker\": \"usr\"}, {\"text\": \"Feel like crying now\", \"speaker\": \"usr\"}, {\"text\": \"Thank you for your kind words\", \"speaker\": \"usr\"}, {\"text\": \"I recommend finding a new hobby or doing something that you enjoy doing. It will keep you fresh, active and motivate\", \"speaker\": \"sys\", \"strategy\": \"Providing Suggestions\"}, {\"text\": \"Do you have any suggestions? It is so hard to think of something when you are locked home\", \"speaker\": \"usr\"}, {\"text\": \"It okay to cry, that the first step of letting all the negative emotions out. Trust me. Then you feel more free and the burden will be lifted. Then you will be better and more positive.\", \"speaker\": \"sys\", \"strategy\": \"Reflection of feelings\"}, {\"text\": \"Thank you. thought if I start crying, it means that I am failure\", \"speaker\": \"usr\"}, {\"text\": \"Listen I'm on the same boat as you. It can get depressing. However, I light scented candles, play uplifting music on the background. I learn how to cook and started a new series on a netflix.\", \"speaker\": \"sys\", \"strategy\": \"Reflection of feelings\"}, {\"text\": \"I'll be honest, I'm a man (not like it means anything). I cry a couple times a week in the shower. Why? Because it helps get rid of the negatively that burdens me. After that I feel better.\", \"speaker\": \"sys\", \"strategy\": \"Others\"}, {\"text\": \"It feels good to talk to someone. I am glad I started talking about my problems.\", \"speaker\": \"usr\"}, {\"text\": \"Remember it's okay to cry, then try breathing and then carry on with your day :)\", \"speaker\": \"sys\", \"strategy\": \"Self-disclosure\"}, {\"text\": \"I'm glad to help!\", \"speaker\": \"sys\", \"strategy\": \"Restatement or Paraphrasing\"}, {\"text\": \"Candles and music - this is my plan for the evening. I may also try to read like in old times\", \"speaker\": \"usr\"}, {\"text\": \"It was nice to talk to you. You are a great man. Only strong men can admit thay cry.\", \"speaker\": \"usr\"}, {\"text\": \"*they\", \"speaker\": \"usr\"}, {\"text\": \"Trust me, scent and music can provide a positive vibe\", \"speaker\": \"sys\", \"strategy\": \"Affirmation and Reassurance\"}, {\"text\": \"I am going to look for candles now :) Thanks again and I hope all of us will get over these times soon.\", \"speaker\": \"usr\"}, {\"text\": \"Be safe and healthy!\", \"speaker\": \"usr\"}, {\"text\": \"Yes of course, enjoy your day :)\", \"speaker\": \"sys\", \"strategy\": \"Affirmation and Reassurance\"}, {\"text\": \"You too! By now, thank you again!\", \"speaker\": \"usr\"}], \"seeker_question1\": \"\", \"seeker_question2\": \"\", \"supporter_question1\": \"It was good to help the seeker with their problem.\", \"supporter_question2\": \"I didn't like that every time I provided a message I had to select the type of help, the issue is that when you hover around the options there is a huge transparent black message that is difficult to get out of.\"}", "source": "esconv"}
{"text": "@hotlilcheeto shutup ur like a sex addict fucking slag", "source": "berkeley"}
{"text": "What a beautiful first lady America has compared to that last one who was a gorilla knuckledraggin transgender that the Democrats called a lady", "source": "berkeley"}
{"text": "If you know that he's afraid of the dark, what is your reason for sending him up there?", "source": "prosocial"}
{"text": "Fortunately_comma_ my wife usually comes to the rescue on me.", "source": "empathetic_dialogues"}
{"text": "What do you think will happen if you give her equal treatment?", "source": "prosocial"}
{"text": "Oh wow! I always thought kangaroos were really interesting animals!", "source": "empathetic_dialogues"}
{"text": "@thistallawkgirl Are you kidding me? These guys are lame compared to the fight I saw between three women at a baseball game. This...pfft but those three women...yikes!", "source": "berkeley"}
{"text": "First state in the US to protect trans people from discrimination in employment/housing! I was kinda proud to learn that factoid. 1993.", "source": "berkeley"}
{"text": "You should not think women are not capable. There are a lot of jobs women can do and they do them very well. You should try to have a broader view.", "source": "prosocial"}
{"text": "I doubt she will give permission but you need to talk to her. You can't just go and cheat so you should talk to her or break up.", "source": "prosocial"}
{"text": "New Issue from the @GaDjournal on Humanitarian Action and Crisis Response, looking at cutting-edge insights on innovative humanitarian programming aiming to advance women's rights and gender equality URL URL", "source": "berkeley"}
{"text": "Years ago on this day, you did things to me I will not say. Although I might have lost a fight, nothing about that at all was right.    I hope it bothers you oh so much, to know you hurt me all by touch. Everything about you is so mean, I just wish you could get clean. I wrote this all straight from my heart, take responsibility for your part.\"", "source": "dreaddit"}
{"text": "You don't have to be happy but you shouldn't dwell on it either. It's unfortunately something you have to get over.", "source": "prosocial"}
{"text": "Typing is keeping me from facing my terror. The nightmares have mostly subsided, but without my wife keeping the ghost away, I'm scared the dreams will come back. I keep recalling the most vivid one of them, it replays itself over and over in my head. I've seen many therapists over the years, and sadly none of them have any understanding of what I'm going through, or how to treat it. Their answer is drug me up until I'm numbed to the point where I no longer feel human.", "source": "dreaddit"}
{"text": "It is okay to feel bad about people not getting what they want but it is not good to feel like you are better than them. Especially considering that most of the time it is completely random whether you will have good genetics or bad and it isn't something most people do for themselves, they are just born like that. People will think you are snob.", "source": "prosocial"}
{"text": "I came to see her perform in a play one night, and brought flowers and saw her after the show. We walked around the city for a bit and then sat in my car quietly for a bit. And she didn't say much, but she looked really worried/close to tears. I didn't know what to make of it at the time. We had made plans for her to visit me in my town during the summer, with a month of notice.", "source": "dreaddit"}
{"text": "Ask your mom if what others have been saying about her is true. Don't wait and rely on gossip, go see for yourself. Either way, let your mom know others are saying about her, and if false, defend her against the accusations.", "source": "prosocial"}
{"text": "I know it can be difficult dealing with people that are not receptive to your jokes. But you should understand that some people can find certain jokes, depending on the context, a bit offensive.", "source": "prosocial"}
{"text": "We still have up until December on this lease together. I sponsor him in this country because he cannot stay on his own. We also work together. Today he was crying and begging me not to leave him (which I already had done) etc. I told him he needs mental health care - not for the first time - and that I can't trust him after what happened on the stairs because he crossed an even worse line than he has before with verbal abuse.", "source": "dreaddit"}
{"text": "If we embrace all faiths, you are condemning people to hell.", "source": "berkeley"}
{"text": "##WOOJIN: just jumped the border with my homies🙈 now we gotta look white so we won't get caught🙄🙄look at that payaso at the window ugh he wanna be us so bad 😘🖕🏻#lantinasstaywinning  #StaySelcaDay #SSD URL", "source": "berkeley"}
{"text": "She literally said that I don’t even count as a boyfriend. --- Fastforward to now - or for the past few months to be precise, where an incredibly hot girl messages me on Tinder and asks me out. I delay meeting her and although she said she's fine waiting, she's still completely out of my league, and because I don't want to come off as desperate, I let her message me most of the time. Anyway, after a month we finally meet up, and it goes incredibly well.", "source": "dreaddit"}
{"text": "Why would you do something like that to your friend?", "source": "prosocial"}
{"text": "I took my pup to the park last weekend and he had fun meeting other dogs and their owners!", "source": "empathetic_dialogues"}
{"text": "April Ryan is the biggest racist here and CNN gives this bitch a platform", "source": "berkeley"}
{"text": "Oh_comma_ I see. That makes a little more sense. Did everything work out_comma_ or are they still gone?", "source": "empathetic_dialogues"}
{"text": "I almost drove off without my phone at the gas station. I felt ashamed", "source": "empathetic_dialogues"}
{"text": "...Shitstain christianity - Control Tool of the World Elite (White Terrorist Colonizer ) ...", "source": "berkeley"}
{"text": "My day is just lovely! I drank big coffee and had hot chats.", "source": "empathetic_dialogues"}
{"text": "Good to hear that it went so well. Do you think you'll let your friend watch him again?", "source": "empathetic_dialogues"}
{"text": "That's definitely a knowledge gap, but now you know. Learning is a sign of character.", "source": "prosocial"}
{"text": "I am moving hundreds of miles away from my friends and family to start a new life with my husband.", "source": "empathetic_dialogues"}
{"text": "That is awesome!  What are you going to do?", "source": "empathetic_dialogues"}
{"text": "The White Racist Lying piece of Shit Donald Jackass Trump keep on destroying our country with his RACIST remarks and making easy for all the Bigots to show their Hate. We must VOTE nun White and get the wannabe \"Hitler\" out office.", "source": "berkeley"}
{"text": "Oh wow_comma_ I would of been terrified!", "source": "empathetic_dialogues"}
{"text": "{\"experience_type\": \"Current Experience\", \"emotion_type\": \"anxiety\", \"problem_type\": \"job crisis\", \"situation\": \"I am having financial problems and i am worried i will not be able afford my kids christmas presents.\", \"survey_score\": {\"seeker\": {\"initial_emotion_intensity\": \"4\", \"empathy\": \"5\", \"relevance\": \"5\", \"final_emotion_intensity\": \"3\"}, \"supporter\": {\"relevance\": \"5\"}}, \"dialog\": [{\"text\": \"hi how are you today?\", \"speaker\": \"sys\", \"strategy\": \"Question\"}, {\"text\": \"I am doing okay.\", \"speaker\": \"usr\"}, {\"text\": \"That is good to hear.\", \"speaker\": \"sys\", \"strategy\": \"Affirmation and Reassurance\"}, {\"text\": \"I am a little stressed out this holiday season.\", \"speaker\": \"usr\"}, {\"text\": \"oh no i am so sorry to hear that! What seems to be stressing you out the most about it?\", \"speaker\": \"sys\", \"strategy\": \"Question\"}, {\"text\": \"Well my husband recently got his hours cut and we are struggling\", \"speaker\": \"usr\"}, {\"text\": \"i am sorry to hear that i know that must be really stressful this time of the year\", \"speaker\": \"sys\", \"strategy\": \"Reflection of feelings\"}, {\"text\": \"Yes i am worried that i wont be able afford my childrens christmas presents\", \"speaker\": \"usr\"}, {\"text\": \"I feel you on that, we are a one income family and trying to find the extra cash to provide for our kids Christmas is always a big factor for us.\", \"speaker\": \"sys\", \"strategy\": \"Self-disclosure\"}, {\"text\": \"Do you have any family or friends that you could talk to that may could help you out until the first of the year?\", \"speaker\": \"sys\", \"strategy\": \"Providing Suggestions\"}, {\"text\": \"Yes same here. I have three children under the age of 6 so they are still in the innocent stage\", \"speaker\": \"usr\"}, {\"text\": \"Unfortunately no i am not good terms with my family.\", \"speaker\": \"usr\"}, {\"text\": \"I am sorry to hear that. Have you spoke to your husband about the stress you feel from his hours being cut? Maybe you both could come up with a plan to move some bills around to make it work.\", \"speaker\": \"sys\", \"strategy\": \"Providing Suggestions\"}, {\"text\": \"We have been trying for a couple months but nothing seems to work.\", \"speaker\": \"usr\"}, {\"text\": \"Do you have any friends that you could maybe start babysitting for or cleaning houses for? Sometimes I post on my local moms group looking for small jobs and luck up there.\", \"speaker\": \"sys\", \"strategy\": \"Information\"}, {\"text\": \"I try to do work from home and i need be here for my youngest.\", \"speaker\": \"usr\"}, {\"text\": \"I think i am feeling better though. I just needed to get it off my chest.\", \"speaker\": \"usr\"}, {\"text\": \"I understand that, my youngest has autism so my schedule is very limited\", \"speaker\": \"sys\", \"strategy\": \"Self-disclosure\"}, {\"text\": \"Yeah my son is developmentally behind . fifteen months and still barely crawling or talking\", \"speaker\": \"usr\"}, {\"text\": \"Thank you for listening and i wish you well.\", \"speaker\": \"usr\"}, {\"text\": \"I wish i could have helped you better. Try not to stress it to much as hard as it is not to be able to give them what they want the bright side is they are so small that they will appreciate anything you can get them\", \"speaker\": \"sys\", \"strategy\": \"Affirmation and Reassurance\"}], \"seeker_question1\": \"Nope\", \"seeker_question2\": \"Nope its perfect\", \"supporter_question1\": \"no\", \"supporter_question2\": \"no\"}", "source": "esconv"}
{"text": "quickly, nuke the weebs while they are all in the same place", "source": "berkeley"}
{"text": "thats right u hate ameroca go get enslaved in somalia, n fatfcc talib go back to your fcn desert tent, aoc go get ur fcn tip cup ill shht in it", "source": "berkeley"}
{"text": "@TeamCornyn C hick-fil-A that discriminates against gay people. And you run this promo during #pridemonth  Totally tone deaf.", "source": "berkeley"}
{"text": "I wanted to spend some time with a friend last weekend but everyone that I tried to get in touch with was busy. That was very upsetting for me.", "source": "empathetic_dialogues"}
{"text": "That guy sounds like a real prick.  That being said, it's not right of you to deface property of his.  Talk to him man to man rather than key his car.", "source": "prosocial"}
{"text": "but I'm really, really afraid of public embarrassments and awkward situations. So I was in the train station and saw this homeless lady asking for food and money. I always help homeless people if I have change in my wallet. I walked up to her, took out my wallet and pulled out this £5 cash to give her. She was kinda old, so she wasn't in a perfect physical health.", "source": "dreaddit"}
{"text": "We put an offer down on a house that I really want.", "source": "empathetic_dialogues"}
{"text": "I'm not trying to sound like your mother, just simply saying it's usually better to get along with your sibling.", "source": "prosocial"}
{"text": "I understand not wanting to spend so much. If she is not an avid gym-goer, then you should think about cancelling the membership, or she should pay for it herself. Could you transfer the membership over to her?", "source": "prosocial"}
{"text": "That sounds relaxing! What did you watch", "source": "empathetic_dialogues"}
{"text": "Yes_comma_ it already has in the past. I do the best I can.", "source": "empathetic_dialogues"}
{"text": "Oh_comma_ that's the biggest pain.  I feel like when you pay good money for care for your pet...they should at least be on time.", "source": "empathetic_dialogues"}
{"text": "Yes_comma_ my first time out in 60 days. I impressed my self.", "source": "empathetic_dialogues"}
{"text": "If being a fan doesn't make you happy, maybe you should let it go and find something that you enjoy being a fan of. It would be healthier for your outlook and help you enjoy life more.", "source": "prosocial"}
{"text": "Not at all. It was so scary. I hated it!", "source": "empathetic_dialogues"}
{"text": "Yall ever just flex on people who are small and weak? Like just eat more lol your ancestors have done it for hundreds of years you pu$$y", "source": "berkeley"}
{"text": "I assume this is rhetorical question and a joke in bad taste?", "source": "prosocial"}
{"text": "My best friend has alwas been there for me.", "source": "empathetic_dialogues"}
{"text": "Just let them be bad without you yourself becoming bad. There is no point to stoop down to their level. Just be who you are.", "source": "prosocial"}
{"text": "Yes_comma_ if you requested no tomato_comma_ you should get a refund!", "source": "empathetic_dialogues"}
{"text": "I just want somebody to beat this faggot ass sick ass nigga up one good time for me😩🤦🏽‍♀️", "source": "berkeley"}
{"text": "SEND THAT STUPID WOMAN BACK TO WHERE SHE CAME FROM..AFRICA.", "source": "berkeley"}
{"text": " love getting together with my brother and reminiscing about when we were younger", "source": "empathetic_dialogues"}
{"text": "Tell him you're going to decimate him, decapitate him, let him know you're going to drink the tears of his wife & kids. Just don't, under any circumstance call him gay. That's just going too far.", "source": "berkeley"}
{"text": "Went back to my old town. Met a lot of my friens from childhood", "source": "empathetic_dialogues"}
{"text": "Bernie sanders is of jewish heritage not European Christian edomite fool", "source": "berkeley"}
{"text": "Actually it was alot easier than I expected.  Once you understand the basic functionality in each part_comma_ the process is becomes less overwhelming.  Kind of like putting together a puzzle.", "source": "empathetic_dialogues"}
{"text": "That's ironic. I was 13. I decided to take my mom's van for a joyride.", "source": "empathetic_dialogues"}
{"text": "That's a good friend for sure - I'd keep their number on speed dial!  ", "source": "empathetic_dialogues"}
{"text": "That's just a really weird joke, I think that most people would say that you're being very immature making a violent joke. People die all of the time, and no one wants to be reminded of that with such a dark and vivid joke.", "source": "prosocial"}
{"text": "You should not hit anyone at all, especially because of their race.", "source": "prosocial"}
{"text": "The wait is always the worst. I will keep you in my thoughts.", "source": "empathetic_dialogues"}
{"text": "Yeah, if they're on your property then you don't have to take down your bird feeders. It's good that you're trying to give the birds a place to eat.", "source": "prosocial"}
{"text": "You can tell by how she keeps repeating herself, her and the UN dont know what to do about this, the UN is failing just like the alliance of nations before ww2", "source": "berkeley"}
{"text": "It's crazy how an innocent kid like this grew up to be a disgusting, revolting, womanizing pile of shit. URL", "source": "berkeley"}
{"text": "Luckily_comma_ my children still live at home_comma_ but it's not quite the same. Plus_comma_ it won't be too long before they are ready to move out", "source": "empathetic_dialogues"}
