{"text": "Filming someone without their knowledge is a major breach of trust and illegal in most circumstances. Having \"a lot of fangirls\" is not a defense. Why not request their permission?", "source": "prosocial"}
{"text": "It is understandable why you would be upset, and it is expected that your mom should make you a meal. Have a talk with her instead of yelling and she might consider what you want.", "source": "prosocial"}
{"text": "His reply:  \"Thanks for not punching me!\" All-in-all, I like this guy, he's been an OK manager to me, I've gotten all of my raises since I've been under him, he has kids, so he understands me as a parent, etc. Am I making too big of a deal out of this? I thought about going to HR about it, but I'm in a position where I can't jeopardize this job, and I'm not the most well-liked person on the team (nothing that I did, I was hired externally for a position that 3 internals wanted), for whatever that's worth. Your thoughts?", "source": "dreaddit"}
{"text": "You are so understanding and kind to give your friend another chance to be better. Yeah, I agree with you. Maybe a couple of years is too long, but you will know when the time comes.", "source": "prosocial"}
{"text": "{\"experience_type\": \"Current Experience\", \"emotion_type\": \"sadness\", \"problem_type\": \"Sleep Problems\", \"situation\": \"I have trouble sleeping during the night because my son is allergic to something in the house and it keeps me up during the night because he is constantly sneezing and blowing his nose.\", \"survey_score\": {\"seeker\": {\"initial_emotion_intensity\": \"5\", \"empathy\": \"5\", \"relevance\": \"5\", \"final_emotion_intensity\": \"1\"}, \"supporter\": {\"relevance\": \"5\"}}, \"dialog\": [{\"text\": \"Hi, how are you doing?\", \"speaker\": \"sys\", \"strategy\": \"Question\"}, {\"text\": \"I'm fine and how are you ?\", \"speaker\": \"usr\"}, {\"text\": \"I'm doing well. Did you have anything you wanted to talk about?\", \"speaker\": \"sys\", \"strategy\": \"Question\"}, {\"text\": \"I'm doing well. Did you have anything you wanted to talk about?\", \"speaker\": \"sys\", \"strategy\": \"Question\"}, {\"text\": \"Yes I am problems with sleeping.\", \"speaker\": \"usr\"}, {\"text\": \"*having\", \"speaker\": \"usr\"}, {\"text\": \"Is getting a good night's sleep becoming an issue?\", \"speaker\": \"sys\", \"strategy\": \"Restatement or Paraphrasing\"}, {\"text\": \"Is getting a good night's sleep becoming an issue?\", \"speaker\": \"sys\", \"strategy\": \"Restatement or Paraphrasing\"}, {\"text\": \"Yes very much so\", \"speaker\": \"usr\"}, {\"text\": \"Tons of people deal with this on many levels.\", \"speaker\": \"sys\", \"strategy\": \"Affirmation and Reassurance\"}, {\"text\": \"Yes I understand\", \"speaker\": \"usr\"}, {\"text\": \"I can feel that this affects you in a negative way.\", \"speaker\": \"sys\", \"strategy\": \"Reflection of feelings\"}, {\"text\": \"I can feel that this affects you in a negative way.\", \"speaker\": \"sys\", \"strategy\": \"Reflection of feelings\"}, {\"text\": \"Yes\", \"speaker\": \"usr\"}, {\"text\": \"I have had issues in the past personally with sleep. Many of my friends too.\", \"speaker\": \"sys\", \"strategy\": \"Self-disclosure\"}, {\"text\": \"I have had issues in the past personally with sleep. Many of my friends too.\", \"speaker\": \"sys\", \"strategy\": \"Self-disclosure\"}, {\"text\": \"I just don't know what to do anymore it's even affecting my work b/c I dont get any sleep\", \"speaker\": \"usr\"}, {\"text\": \"There are a lot of things out there to try and get your sleep pattern in better shape.\", \"speaker\": \"sys\", \"strategy\": \"Information\"}, {\"text\": \"There are a lot of things out there to try and get your sleep pattern in better shape.\", \"speaker\": \"sys\", \"strategy\": \"Information\"}, {\"text\": \"Yes and I have tried many\", \"speaker\": \"usr\"}, {\"text\": \"What about valerian root or other herbs?\", \"speaker\": \"sys\", \"strategy\": \"Providing Suggestions\"}, {\"text\": \"What about valerian root or other herbs?\", \"speaker\": \"sys\", \"strategy\": \"Providing Suggestions\"}, {\"text\": \"I never thought of that I will definitely give it a try\", \"speaker\": \"usr\"}, {\"text\": \"You could also try adjusting your diet and eating habits.\", \"speaker\": \"sys\", \"strategy\": \"Providing Suggestions\"}, {\"text\": \"Thank you for all of your help , this is greatly appreciated.\", \"speaker\": \"usr\"}, {\"text\": \"I never thought of using the herbs I will give this a try soon\", \"speaker\": \"usr\"}, {\"text\": \"You are welcome\", \"speaker\": \"sys\", \"strategy\": \"Information\"}, {\"text\": \"You are welcome\", \"speaker\": \"sys\", \"strategy\": \"Information\"}, {\"text\": \"Hello are you still there?\", \"speaker\": \"usr\"}, {\"text\": \"You can also try reducing caffeine intake 6 hours before bed.\", \"speaker\": \"sys\", \"strategy\": \"Providing Suggestions\"}, {\"text\": \"Oh that is great I drink coffee an hour before bed on some days\", \"speaker\": \"usr\"}, {\"text\": \"As you know this can keep your brain stimulated and prevent you from going to sleep.\", \"speaker\": \"sys\", \"strategy\": \"Information\"}, {\"text\": \"I didn't know that\", \"speaker\": \"usr\"}, {\"text\": \"I used to drink too much coffee and I was tired all day but could never sleep right.\", \"speaker\": \"sys\", \"strategy\": \"Self-disclosure\"}, {\"text\": \"I used to drink too much coffee and I was tired all day but could never sleep right.\", \"speaker\": \"sys\", \"strategy\": \"Self-disclosure\"}, {\"text\": \"thanks for the info\", \"speaker\": \"usr\"}, {\"text\": \"Anything else I can help with?\", \"speaker\": \"sys\", \"strategy\": \"Question\"}, {\"text\": \"Anything else I can help with?\", \"speaker\": \"sys\", \"strategy\": \"Question\"}], \"seeker_question1\": \"no i enjoyed it\", \"seeker_question2\": \"no good information\", \"supporter_question1\": \"\", \"supporter_question2\": \"\"}", "source": "esconv"}
{"text": "Suddenly she snaps and goes \"I fucking hate my brother, he is the biggest piece of shit ever, I couldn't care less about him\" and just started going off. Now, I know her brother can be pretty psychotic and from what shes told me he clearly has anger issues and the rest of her family keeps ignoring it, sometimes even enabling it. So 2 minutes into her exploding, she starts crying because apparently her brother told their dad something and the dad called her and said he doesn't trust her anymore or whatever. She was very upset about the dad thing because she's very close with her dad and she's her dads favorite child (he told me that himself when I spoke with him). I didn't want to pry too much because I felt like it isn't exactly my business of their internal family issues, but my girlfriend screenshot the text messages her brother sent her and I just could not comprehend how a human being, especially a sibling, can say that to someone.", "source": "dreaddit"}
{"text": "He did threaten to walk out when I tried to crack a third, and I stopped. He says this is so rewarding for him, but is really open about how tough it has been as well. The therapist, though she is more closed mouthed and less personally emotional, has said she has required supervision several times over me. No matter how nice they are, if I fuck up months of progress, decisions about where this is going seem likely. Getting this out seems to have helped a fair bit.", "source": "dreaddit"}
{"text": "It sometimes takes us longer than expected to get somewhere. Sexual harassment is against the law and the cashier can take you to court for that if you do it. Be more human and control your urges.", "source": "prosocial"}
{"text": "However, over the next day she changed her mind and is now convinced that she has given us enough chances, that nothing would change (in terms of me and my issues) if we tried again. The kicker is that she still loves me, she’s still attracted to me (we got onto normal conversation, joked around as usual, even had sex twice in the last couple of days), she comforted me as I bawled about her leaving. We’ve been texting a fair bit since she went, some normal and some more serious conversation. She is now back with her mother, she has taken enough clothes for the week and will come back next weekend to pick up the rest of her stuff. We’re also seeing each other on Tuesday as we have Pokémon Go plans that we can’t miss (don’t judge us).", "source": "dreaddit"}
{"text": "I get that it bothers you, but that kind of action is going to have the opposite affect that you want. They won't understand eventually and instead they are just going to start talking about you in that other language when they notice. People aren't obligated to accommodate you all the time and you should learn to accept that or at least address them about it directly.", "source": "prosocial"}
{"text": "{\"experience_type\": \"Current Experience\", \"emotion_type\": \"jealousy\", \"problem_type\": \"problems with friends\", \"situation\": \"My friend Rick is a jerk. He's got an awesome new Corvette that he brags about constantly knowing full well I ADORE Corvettes, want one badly, and can't afford one. We've been friends for a long time but he insists on rubbing this in my face every chance he gets! He thinks it's funny. I'm wondering if I should just not be friends with him anymore...\", \"survey_score\": {\"seeker\": {\"initial_emotion_intensity\": \"4\", \"empathy\": \"5\", \"relevance\": \"5\", \"final_emotion_intensity\": \"2\"}, \"supporter\": {\"relevance\": \"5\"}}, \"dialog\": [{\"text\": \"Hey.\", \"speaker\": \"usr\"}, {\"text\": \"Hello, what's on your mind today?\", \"speaker\": \"sys\", \"strategy\": \"Question\"}, {\"text\": \"Just wondering what I can do to deal with my cocky annoying friend Rick and his new car\", \"speaker\": \"usr\"}, {\"text\": \"(as above)\", \"speaker\": \"usr\"}, {\"text\": \"How long have you been friends?\", \"speaker\": \"sys\", \"strategy\": \"Question\"}, {\"text\": \"30+ years since high school\", \"speaker\": \"usr\"}, {\"text\": \"And he has always had cocky attitude? Have you ever told him that?\", \"speaker\": \"sys\", \"strategy\": \"Others\"}, {\"text\": \"He has, and yes I've told him, he just dismisses it, thinks it's funny that I get jealous\", \"speaker\": \"usr\"}, {\"text\": \"I understand your frustration, it's upsetting when they dismiss what you say even though you have been friends for so long.\", \"speaker\": \"sys\", \"strategy\": \"Reflection of feelings\"}, {\"text\": \"Thanks.\", \"speaker\": \"usr\"}, {\"text\": \"What I would recommend in this case is, spend more time with other friends who appreciate you. You also need to tell Rick your honest thought, don't beat around the bush but let him know you're serious\", \"speaker\": \"sys\", \"strategy\": \"Others\"}, {\"text\": \"That's good advice! Thanks. I wonder how I can get through to him to really let him know I'm serious. Ideas?\", \"speaker\": \"usr\"}, {\"text\": \"I have been in the same situation myself, what I usually do is sit down with them and start the conversation in a serious mood. Explain everything I need to say and tell them that I mean every word. If they don't seem to accept and change, I keep my distance from them\", \"speaker\": \"sys\", \"strategy\": \"Self-disclosure\"}, {\"text\": \"Makes sense. Unfortunately we live on the same street so it's kind of hard not to run into each other. :/\", \"speaker\": \"usr\"}, {\"text\": \"That's even easier to make it clear, if you run into him, just give him a polite greetings. The point is, make it clear you have had enough\", \"speaker\": \"sys\", \"strategy\": \"Others\"}, {\"text\": \"Right, so basically let him know if he continues to act like he does, we're done as friends, correct? Or should I not be that bold?\", \"speaker\": \"usr\"}, {\"text\": \"Yes. Be not too harsh at first. I would say to give him 1 more chance. If he still doesn't respect your words, it's the best for both to say it clearly.\", \"speaker\": \"sys\", \"strategy\": \"Affirmation and Reassurance\"}, {\"text\": \"Sounds good, I'm looking forward to getting this resolved. Now I just have to work on the wording (what I'll say) to come across as serious without being too harsh, I guess.\", \"speaker\": \"usr\"}, {\"text\": \"Suggestions welcome! :)\", \"speaker\": \"usr\"}, {\"text\": \"You have the right mindset! Practice before talking will help you deliver your thoughts better.\", \"speaker\": \"sys\", \"strategy\": \"Others\"}, {\"text\": \"Yeah I tend to get too emotional lol\", \"speaker\": \"usr\"}, {\"text\": \"I would start with something along the line \\\"Look, I know we have had this conversation many times. However, i feel as though you never take me seriously. I want to say this one last time....\\\"\", \"speaker\": \"sys\", \"strategy\": \"Others\"}, {\"text\": \"That's perfect. Copying that down right now!\", \"speaker\": \"usr\"}, {\"text\": \"Seriously!\", \"speaker\": \"usr\"}, {\"text\": \"Getting emotional is totally fine, that's why you need practice\", \"speaker\": \"sys\", \"strategy\": \"Affirmation and Reassurance\"}, {\"text\": \"True it's just we've been friends for so long it would suck if we weren't anymore.\", \"speaker\": \"usr\"}, {\"text\": \"So I've got a plan and know what to do. You've been super helpful! Thanks!\", \"speaker\": \"usr\"}, {\"text\": \"I understand, it's difficult to come to this decision when you've been friends for so long. I hope he appreciates your friendship just as you do and tries his best.\", \"speaker\": \"sys\", \"strategy\": \"Affirmation and Reassurance\"}, {\"text\": \"We will see!\", \"speaker\": \"usr\"}, {\"text\": \"You're very welcome. is there anything I can do for you?\", \"speaker\": \"sys\", \"strategy\": \"Question\"}, {\"text\": \"No, I think that's it!\", \"speaker\": \"usr\"}, {\"text\": \"Much appreciated!\", \"speaker\": \"usr\"}, {\"text\": \"I think you can end our session here. I'm glad I could help a bit\", \"speaker\": \"sys\", \"strategy\": \"Others\"}, {\"text\": \"Yes, agreed, and yes you did!\", \"speaker\": \"usr\"}, {\"text\": \"Thanks again!\", \"speaker\": \"usr\"}], \"seeker_question1\": \"Really thoughtful advice that hit home! They really listened to me!\", \"seeker_question2\": \"Nope!\", \"supporter_question1\": \"\", \"supporter_question2\": \"\"}", "source": "esconv"}
{"text": "It's understandable to want to take part in a tradition when celebrating a holiday, but its wrong to expect something when visiting others. You may leave people with the impression that you're just seeing them to get free stuff.", "source": "prosocial"}
{"text": "Aren't you worried you will end up alone if you are basing relationships on money? It seems unfair to the guy as well. How would you feel if someone only dated you for money?", "source": "prosocial"}
{"text": "It's also frustrating because I'm finally getting the kind of help I would expect from family and BEYOND from a woman I met while panhandling this summer. Thanks to a stranger: I've been able to finally get mental health assistance, I got my benefits fixed, I got a job, and I have a safe place to sleep out of the rain or snow. I have somewhere to leave my pack and bed roll rather than carry it around 24/7. I could probably ask to store that stuff, but it seems so asinine to ask more of this woman and especially so since it's just extra supplies for my dog I don't really need. I can't understand why even the bare minimum is too much to ask of the people who are supposed to care the most.", "source": "dreaddit"}
{"text": "@lacerci65 @LaylaAlisha11 Every one of these heathens needs to be deported. That will solve the problem. When is Kommandant Merkel going to understand these Islamist bastards will NEVER ASSIMILATE? They will only DEMAND Germany become a Muslim nation, with sharia law, and bow to their satanic god.", "source": "berkeley"}
{"text": "Three of them said \"so sorry I actually can't\" and gave some noncommittal excuse, whether that was work or school related (even though school only started up again about a week ago and midterms are far away). I was disappointed but figured that it happens and I can still have fun with the three other people that are coming. Only to wake up the next day and have the other three friends text me that they couldn't come either for varying reasons and they were \"so sorry\". I was so upset the entire day. I had told my mom about it and she had told me that what I didn't realize was that none of them were really my close friends, since people that are actually friends don't flake out like that, plus none of them have ever come over to my place or vice versa or done anything more than hang out every now and then.", "source": "dreaddit"}
{"text": "The DJSUGARPOP yes. Governments go to war; not people. But the people of Iran want a government change more than anyone.   Their government feels it's their duty to develop nuclear weapons and destroy Israel; while holding the people firmly under the yoke of Sharia law.   War may be the only Meagan's of dislodging these dictators and allowing freedom to grow.", "source": "berkeley"}
{"text": "Hi OP. Guess we're in similar situation. For 5 years after I first came out to her, my mother continues to tell me that she cares and doesn't want me to be gay for my own good. What both of our mothers have offered is conditional love. They love us based on the ideal images that they have on their sons and not our true self. In brief, it does hurt knowing you couldn't get full support especially from someone you love but remember it's your life to live, not her's.", "source": "berkeley"}
{"text": "Many of my cohorts asked me \"how are you two even friends?\" when he came to which I couldn't give a clear answer. So in short, we have a business license and agreement we both signed. We were friends, but I think time has changed him and I and I don't think we would be friends if we met today. He isn't productive for the business and his practices many times seems to include emotion and his own self interests rather than the business, so I find him unfit as a business partner as well.", "source": "dreaddit"}
{"text": "First of all you have to understand there is nothing wrong in crying even for a grown man as yourself. Secondly, you don't need to cover it up by lying. Learn to trust your coworkers and your loved ones so you'd be able to express your feelings in front of them.", "source": "prosocial"}
{"text": "I understand being annoyed and frustrated with people who want to break laws to avoid traffic, blocking their car won't help. It may stop them, but they are likely to get angry and retaliate against you. It's best to drive safe and not block the car.", "source": "prosocial"}
{"text": "It's understandable that you would expect others to help you when you have been helpful to them. However, you should not expect other people to be like you and do what you do. Instead, consider not being someone who gives too much as it will leave you feeling empty.", "source": "prosocial"}
{"text": "Always listened to me. Always took the time ti make me understand when I did something wrong. Always believed in me. Loved me unconditionally. Mom was a bit homophobic (which is common for people of her background). In 2017 I came out as bi and I didn't know how she would handle it. She hugged me and said nothing could ever change her love for me. She's since met my girlfriend. She now also talks to me about how the LGBT+ community deserve to be treated wiyh respect. She has literally always been the best person in my life.", "source": "berkeley"}
{"text": "I'm sure he'll understand that these encounters happened before your relationship. He'll have a hard time trusting you if you lie about it, and he somehow finds out later. It's better to just be honest to start with.", "source": "prosocial"}
{"text": "{\"experience_type\": \"Previous Experience\", \"emotion_type\": \"depression\", \"problem_type\": \"Sleep Problems\", \"situation\": \"sleep problems with over depression have adverse effects cognitive and behavioral functions.\", \"survey_score\": {\"seeker\": {\"initial_emotion_intensity\": \"4\", \"empathy\": \"4\", \"relevance\": \"3\", \"final_emotion_intensity\": \"2\"}, \"supporter\": {}}, \"dialog\": [{\"text\": \"Hi. How are you?\", \"speaker\": \"sys\", \"strategy\": \"Question\"}, {\"text\": \"I am good\", \"speaker\": \"usr\"}, {\"text\": \"Thats great! How are you feeling?\", \"speaker\": \"sys\", \"strategy\": \"Question\"}, {\"text\": \"Now i am better\", \"speaker\": \"usr\"}, {\"text\": \"I know that things have been hard during this pandemic for a lot of people.\", \"speaker\": \"sys\", \"strategy\": \"Affirmation and Reassurance\"}, {\"text\": \"Expect to have lot of mixed feelings.\", \"speaker\": \"usr\"}, {\"text\": \"Mixed feelings have you been having? It's completely normal and understandable to have them.\", \"speaker\": \"sys\", \"strategy\": \"Affirmation and Reassurance\"}, {\"text\": \"Sometimes when you are having mixed feelings, you can try writing them down on a piece of paper. This can help you identify how you are feeling.\", \"speaker\": \"sys\", \"strategy\": \"Providing Suggestions\"}, {\"text\": \"i have very mixed feelings about the whole issues .My mixed feeling stem from the fact that those are not reflected anywhere.\", \"speaker\": \"usr\"}, {\"text\": \"I have no minded with writing things.\", \"speaker\": \"usr\"}, {\"text\": \"I could understand how difficult that must be for you. You could try taking a walk outside and getting some fresh air. Fresh air can always help to clear your mind.\", \"speaker\": \"sys\", \"strategy\": \"Providing Suggestions\"}, {\"text\": \"please help another way to reduce my depression.\", \"speaker\": \"usr\"}, {\"text\": \"Does doing art work help you to feel better usually?\", \"speaker\": \"sys\", \"strategy\": \"Others\"}, {\"text\": \"You can try to immerse yourself in something you really enjoy doing. Sometimes if you smile while doing things, it can help you to feel better.\", \"speaker\": \"sys\", \"strategy\": \"Providing Suggestions\"}, {\"text\": \"yeah sure i will try to reduce my depression with your wonderful ideas . thank you so much.\", \"speaker\": \"usr\"}, {\"text\": \"You're so welcome. I really hope you get back to feeling better soon, Stay safe and have a great rest of your week. Come back if you need any support.\", \"speaker\": \"sys\", \"strategy\": \"Others\"}, {\"text\": \"Thank you\", \"speaker\": \"usr\"}, {\"text\": \"your great supporter\", \"speaker\": \"usr\"}, {\"text\": \"Nice to meet you.\", \"speaker\": \"usr\"}, {\"text\": \"Thank you so much. I am genuinely happy to help. It was nice to meet you as well.\", \"speaker\": \"sys\", \"strategy\": \"Others\"}, {\"text\": \"have a great day bye.\", \"speaker\": \"usr\"}, {\"text\": \"You too, goodbye,\", \"speaker\": \"sys\", \"strategy\": \"Others\"}], \"seeker_question1\": \"like\", \"seeker_question2\": \"improve\", \"supporter_question1\": \"\", \"supporter_question2\": \"\"}", "source": "esconv"}
{"text": "I misspoke some words out in public and lots of people heard.,5|5|5_5|5|5,\nhit:832_conv:1665,2,embarrassed,I misspoke some words out in public and lots of people heard.,45,Oh_comma_ wow_comma_ I guess you were embarrassed? It happens to us all though_comma_ so you just laugh it off!,5|5|5_5|5|5,\nhit:832_conv:1665,3,embarrassed,I misspoke some words out in public and lots of people heard.,226,I did laugh. Trouble is sometimes when I start laughing I can't stop. ,5|5|5_5|5|5,\nhit:832_conv:1665,4,embarrassed,I misspoke some words out in public and lots of people heard.,45,I do that too! Or laugh at the wrong time_comma_ so I understand!,5|5|5_5|5|5,\nhit:833_conv:1666,1,prepared,I had a test in college that I was very nervous for so I studided really hard for it and felt ready when it came around.,217,In my last year of college I had a final exam that I was really scared of and worried about. I spent much of my time studying for it. When it finally came time to take it I felt good about it and was ready to take it on.,4|4|4_5|5|5,\nhit:833_conv:1666,2,prepared,I had a test in college that I was very nervous for so I studided really hard for it and felt ready when it came around.,209,You sounded very prepared. How do you feel about it? Think you passed?,4|4|4_5|5|5,\nhit:833_conv:1666,3,prepared,I had a test in college that I was very nervous for so I studided really hard for it and felt ready when it came around.,217,Yes I know I did great on it!,4|4|4_5|5|5,\nhit:833_conv:1666,4,prepared,I had a test in college that I was very nervous for so I studided really hard for it and felt ready when it came around.,209,Good to hear that you did well. You'll make valedictorian before you know it!,4|4|4_5|5|5,\nhit:833_conv:1666,5,prepared,I had a test in college that I was very nervous for so I studided really hard for it and felt ready when it came around.,217,Thank you. I didn't quite make valedictorian and don't think I'm that great. But I can dream I guess.,4|4|4_5|5|5,\nhit:833_conv:1667,1,prepared,Yesterday I had my final Physics exam and I think I nailed it_comma_ due to studying so hard.,209,Yesterday I had my final Physics exam and I think I nailed it_comma_ due to studying so hard.,5|5|5_4|4|4,\nhit:833_conv:1667,2,prepared,Yesterday I had my final Physics exam and I think I nailed it_comma_ due to studying so hard.,217,That sounds great! It sounds like you really studied hard. I hope you did wonderful on it.,5|5|5_4|4|4,\nhit:833_conv:1667,3,prepared,Yesterday I had my final Physics exam and I think I nailed it_comma_ due to studying so hard.,209,Yeah_comma_ me too. Hopefully just as well as you did on yours. I really struggle with mathematics.,5|5|5_4|4|4,\nhit:833_conv:1667,4,prepared,Yesterday I had my final Physics exam and I think I nailed it_comma_ due to studying so hard.,217,It sounds like you did great. Studying is the biggest part really.,5|5|5_4|4|4,\nhit:834_conv:1668,1,anxious,I had to go to the doctor recently for my foot_comma_ I was definitely scared of the possible outcome.,100,I got my foot looked at recently by a doctor_comma_ boy was I nervous going into it.,5|5|5_4|5|5,\nhit:834_conv:1668,2,anxious,I had to go to the doctor recently for my foot_comma_ I was definitely scared of the possible outcome.,234,Oh_comma_ that's annoying! I hate going to the doctor...freaks me out. I always feel like they're going to tell me I'll die in 5 weeks,5|5|5_4|5|5,\nhit:834_conv:1668,3,anxious,I had to go to the doctor recently for my foot_comma_ I was definitely scared of the possible outcome.,100,Yeah I feel the same way_comma_ then it ends up being nothing serious usually anyway.,5|5|5_4|5|5,\nhit:834_conv:1668,4,anxious,I had to go to the doctor recently for my foot_comma_ I was definitely scared of the possible outcome.,234,Similar to most things_comma_ yea. What was wrong with your foot?,5|5|5_4|5|5,\nhit:834_conv:1669,1,annoyed,Once I had a coworker who really liked to pull pranks on me,234,I have this coworker who really likes to pull pranks on people...again..and again. It's always the same stuff,4|5|5_5|5|5,\nhit:834_conv:1669,2,annoyed,Once I had a coworker who really liked to pull pranks on me,100,Oh that can be annoying sometimes_comma_ I hope they're not too serious.,4|5|5_5|5|5,\nhit:834_conv:1669,3,annoyed,Once I had a coworker who really liked to pull pranks on me,234,Nah_comma_ they're just stupid things like moving stuff around_comma_ putting wacky sticky notes on your desk_comma_ changing your desktop wallpaper_comma_ etc.,4|5|5_5|5|5,\nhit:834_conv:1669,4,annoyed,Once I had a coworker who really liked to pull pranks on me,100,Oh well that doesn't sound too bad_comma_ I hope he gets some in return though.,4|5|5_5|5|5,\nhit:835_conv:1670,1,anticipating,I'm looking forward to going to the fair in a couple of weeks.,225,Our county fair is coming up in a couple of weeks and I'm looking forward to going.,5|5|5_4|5|5,\nhit:835_conv:1670,2,anticipating,I'm looking forward to going to the fair in a couple of weeks.,26,I am supposed to be going to an amusement park with friends this weekend_comma_ hoping they have fair type rides there. ,5|5|5_4|5|5,\nhit:835_conv:1670,3,anticipating,I'm looking forward to going to the fair in a couple of weeks.,225,I'd say that they will. In fact_comma_ I'd expect it.,5|5|5_4|5|5,\nhit:835_conv:1670,4,anticipating,I'm looking forward to going to the fair in a couple of weeks.,26,What is your favorite ride?,5|5|5_4|5|5,\nhit:836_conv:1672,1,joyful,I won a free $50 gift card yesterday!,234,So_comma_ I won a big gift card yesterday which made me very happy!,4|5|5_5|5|5,\nhit:836_conv:1672,2,joyful,I won a free $50 gift card yesterday!,225,Well_comma_ how big was it_comma_ and where for?,4|5|5_5|5|5,\nhit:836_conv:1672,3,joyful,I won a free $50 gift card yesterday!,234,It was for $50 and it was a prepaid so I could use it anywhere I wanted. I never win anything_comma_ so it was exciting for me,4|5|5_5|5|5,\nhit:836_conv:1672,4,joyful,I won a free $50 gift card yesterday!,225,That's the best kind. What are your plans for it ?,4|5|5_5|5|5,\nhit:836_conv:1672,5,joyful,I won a free $50 gift card yesterday!,234,To be honest_comma_ I've had my eye on some neat looking jewelry (necklace) that should help pay for quite a bit of it!,4|5|5_5|5|5,\nhit:836_conv:1673,1,grateful,I'm always grateful for the love of my wife and children.,225,I'm always really amazed at how my children are wonderful.,5|5|5_4|5|5,\nhit:836_conv:1673,2,grateful,I'm always grateful for the love of my wife and children.,234,Are they just great in general or did they do something extra special?,5|5|5_4|5|5,\nhit:836_conv:1673,3,grateful,I'm always grateful for the love of my wife and children.,225,They're always great_comma_ I just don't get used to it.,5|5|5_4|5|5,\nhit:836_conv:1673,4,grateful,I'm always grateful for the love of my wife and children.,234,Aw :) I wish I had kids. I think it would be worth it,5|5|5_4|5|5,\nhit:837_conv:1674,1,joyful,I have met with my close friend from high school after 7 years,155,Yesterday_comma_ i had a dinner with my close friend from high school. I was very glad to finally meet him after 7 years,4|4|4_5|5|5,\nhit:837_conv:1674,2,joyful,I have met with my close friend from high school after 7 years,62,that sounds like fun_comma_ how long do you know each other?,4|4|4_5|5|5,\nhit:837_conv:1674,3,joyful,I have met with my close friend from high school after 7 years,155,We had been like best friends in high school_comma_ but after graduating I did not get a chance to see him at all,4|4|4_5|5|5,\nhit:837_conv:1674,4,joyful,I have met with my close friend from high school after 7 years,62,I see. What kind of restaurant did you guys go? ,4|4|4_5|5|5,\nhit:837_conv:1675,1,nostalgic,I went to Disneyland the first time when I was 10 years old_comma_ and I went back last year_comma_ I was so happy,62,I went to the Disneyland again this year_comma_ it was awesome ,5|5|5_4|4|4,\nhit:837_conv:1675,2,nostalgic,I went to Disneyland the first time when I was 10 years old_comma_ and I went back last year_comma_ I was so happy,155,To be honest_comma_ i have never visited it yet. But I am very eager to go there,5|5|5_4|4|4,\nhit:837_conv:1675,3,nostalgic,I went to Disneyland the first time when I was 10 years old_comma_ and I went back last year_comma_ I was so happy,62,You should visit when you have a chance_comma_ it is a magic place,5|5|5_4|4|4,\nhit:837_conv:1675,4,nostalgic,I went to Disneyland the first time when I was 10 years old_comma_ and I went back last year_comma_ I was so happy,155,In which state is the DisneyLand that you had been is located?,5|5|5_4|4|4,\nhit:837_conv:1675,5,nostalgic,I went to Disneyland the first time when I was 10 years old_comma_ and I went back last year_comma_ I was so happy,62,California ,5|5|5_4|4|4,<UNIGRAM>\nhit:838_conv:1677,1,jealous,My friend who lives in Los Angeles not only gets to live by the beach she can still somehow afford to go to Hawaii all the time.,127,I moved out of my beach community in Los Angeles because it was so expensive_comma_ I don't know how my remaining friends there exist!,5|5|5_5|5|5,\nhit:838_conv:1677,2,jealous,My friend who lives in Los Angeles not only gets to live by the beach she can still somehow afford to go to Hawaii all the time.,242,Theyre clearly fatcats_comma_ thats how. Where did you move to? ,5|5|5_5|5|5,\nhit:838_conv:1677,3,jealous,My friend who lives in Los Angeles not only gets to live by the beach she can still somehow afford to go to Hawaii all the time.,127,New Orleans. It's a fun city but it's not as nice as California. One of my friends in LA is just a teacher and goes to Hawaii all the time. I've never been. ,5|5|5_5|5|5,\nhit:838_conv:1677,4,jealous,My friend who lives in Los Angeles not only gets to live by the beach she can still somehow afford to go to Hawaii all the time.,242,isnt california like really hot? Im not sure if id be able to tolerate the temperature to be honest_comma_ do you intend to move back to los angeles in the future?,5|5|5_5|5|5,\nhit:838_conv:1677,5,jealous,My friend who lives in Los Angeles not only gets to live by the beach she can still somehow afford to go to Hawaii all the time.,127,It's nice at the beach_comma_ like 85 degrees. A cold day is 55_comma_ which are rare. I'd like to move back but can't ever imagine paying 2400 for renting a box. ,5|5|5_5|5|5,\nhit:838_conv:1677,6,jealous,My friend who lives in Los Angeles not only gets to live by the beach she can still somehow afford to go to Hawaii all the time.,242,i pay 160 euros a month for my apartament lol_comma_ 2400 is insanity tbh. and 85 degrees is like 30c D: that is so hot!,5|5|5_5|5|5,\nhit:838_conv:1677,7,jealous,My friend who lives in Los Angeles not only gets to live by the beach she can still somehow afford to go to Hawaii all the time.,127,Haha_comma_ it feels perfect to me.  Your rent sounds affordable_comma_ I'll bet you have healthcare_comma_ too. ,5|5|5_5|5|5,\nhit:838_conv:1677,8,jealous,My friend who lives in Los Angeles not only gets to live by the beach she can still somehow afford to go to Hawaii all the time.,242,i actually dont_comma_ my country decided to illegally deny it to me_comma_ but most people do. you could move to EU if you really wanted to_comma_ rent sure would be way more afforadable regardless of which country you pick,5|5|5_5|5|5,\nhit:839_conv:1678,1,furious,My wife lost her phone_comma_ which i bought for our anniversary,43,My wife lost her phone_comma_ its a new one,4|4|4_3|3|2,\nhit:839_conv:1678,2,furious,My wife lost her phone_comma_ which i bought for our anniversary,159,What kind of phone was it?,4|4|4_3|3|2,\nhit:839_conv:1678,3,furious,My wife lost her phone_comma_ which i bought for our anniversary,43,Blackberry porsche model_comma_ it was an anniversary gift,4|4|4_3|3|2,\nhit:839_conv:1678,4,furious,My wife lost her phone_comma_ which i bought for our anniversary,159,Oh no! How awful. I'm buying a house on Monday!,4|4|4_3|3|2,\nhit:839_conv:1679,1,impressed,I bought a house at the young age of 25. I worked really hard to get were I wanted. I deserve the best out of my life. ,159,Congratulations! You deserve it!,3|3|2_4|4|4,\nhit:839_conv:1679,2,impressed,I bought a house at the young age of 25. I worked really hard to get were I wanted. I deserve the best out of my life. ,43,/Am not sure_comma_ what i deserve,3|3|2_4|4|4,\nhit:839_conv:1679,3,impressed,I bought a house at the young age of 25. I worked really hard to get were I wanted. I deserve the best out of my life. ,159,Buying a house is house is a huge accomplishment!,3|3|2_4|4|4,\nhit:839_conv:1679,4,impressed,I bought a house at the young age of 25. I worked really hard to get were I wanted. I deserve the best out of my life. ,43,oh thank you!! for your wishes!!,3|3|2_4|4|4,\nhit:839_conv:1679,5,impressed,I bought a house at the young age of 25. I worked really hard to get were I wanted. I deserve the best out of my life. ,159,You are more than welcome :),3|3|2_4|4|4,\nhit:840_conv:1680,1,annoyed,My mom called me at the last minute to tell me she was having all the family over for dinner and she was expecting me to be there. I told her I had plans that night and she told me I should change my plans.,243,I had plans to go out with friends the other night and then my mom called me to tell me she was having all our family over for dinner and I was expected to be there. I told her about my plans and she said to change my plans. She does not understand.,5|5|5_5|5|5,\nhit:840_conv:1680,2,annoyed,My mom called me at the last minute to tell me she was having all the family over for dinner and she was expecting me to be there. I told her I had plans that night and she told me I should change my plans.,225,So_comma_ did you go to her dinner_comma_ or do what you had planned?,5|5|5_5|5|5,\nhit:840_conv:1680,3,annoyed,My mom called me at the last minute to tell me she was having all the family over for dinner and she was expecting me to be there. I told her I had plans that night and she told me I should change my plans.,243,I went to the dinner and then left a little early to go out. She wasn't happy_comma_ but maybe next time she will plan better.,5|5|5_5|5|5,\nhit:840_conv:1680,4,annoyed,My mom called me at the last minute to tell me she was having all the family over for dinner and she was expecting me to be there. I told her I had plans that night and she told me I should change my plans.,225,I find that they don't respect you until you start telling them no.,5|5|5_5|5|5,\nhit:840_conv:1680,5,annoyed,My mom called me at the last minute to tell me she was having all the family over for dinner and she was expecting me to be there. I told her I had plans that night and she told me I should change my plans.,243,That's what I have found too. She needs to realize I am an adult.,5|5|5_5|5|5,\nhit:840_conv:1681,1,surprised,I was startled by a wreck in front of my house yesterday morning.,225,There was a wreck in front of my house yesterday morning early.,5|5|5_5|5|5,\nhit:840_conv:1681,2,surprised,I was startled by a wreck in front of my house yesterday morning.,243,Was everyone okay?,5|5|5_5|5|5,\nhit:840_conv:1681,3,surprised,I was startled by a wreck in front of my house yesterday morning.,225,Everyone was_comma_ but a deer was killed.,5|5|5_5|5|5,\nhit:840_conv:1681,4,surprised,I was startled by a wreck in front of my house yesterday morning.,243,I bet that did some damage to the car.,5|5|5_5|5|5,\nhit:841_conv:1682,1,guilty,I lied to my friend about an important situation. It only made things worse in the end.,234,I lied to my friend a few days ago_comma_ and it made me feel really bad,4|5|5_5|5|5,\nhit:841_conv:1682,2,guilty,I lied to my friend about an important situation. It only made things worse in the end.,225,Was it about something serious?,4|5|5_5|5|5,\nhit:841_conv:1682,3,guilty,I lied to my friend about an important situation. It only made things worse in the end.,234,Yes_comma_ and it actually ended up making things worse in the end as he found out I kept it secret his girlfriend was cheating on him,4|5|5_5|5|5,\nhit:841_conv:1682,4,guilty,I lied to my friend about an important situation. It only made things worse in the end.,225,I hope she wasn't cheating with you at least.,4|5|5_5|5|5,\nhit:841_conv:1682,5,guilty,I lied to my friend about an important situation. It only made things worse in the end.,234,Thankfully no,4|5|5_5|5|5,\nhit:841_conv:1683,1,surprised,I can't believe how fast the grass is growing this year.,225,I seem to be mowing the lawn more frequently this year.,5|5|5_4|5|5,\nhit:841_conv:1683,2,surprised,I can't believe how fast the grass is growing this year.,234,Has it rained more often there than usual?,5|5|5_4|5|5,\nhit:841_conv:1683,3,surprised,I can't believe how fast the grass is growing this year.,225,Yes_comma_ it has. I know that's the source.,5|5|5_4|5|5,\nhit:841_conv:1683,4,surprised,I can't believe how fast the grass is growing this year.,234,My yard has too actually. I wonder if it's due to more sun and more rain across the board,5|5|5_4|5|5,\nhit:842_conv:1684,1,lonely,My friends left me out of their plans. I'm a pretty social person so it's not very fun for me,234,My 'friends' left me out of their social plans yesterday which wasn't very fun for me,4|5|5_5|5|5,\nhit:842_conv:1684,2,lonely,My friends left me out of their plans. I'm a pretty social person so it's not very fun for me,40,Did you ask them why? ,4|5|5_5|5|5,\nhit:842_conv:1684,3,lonely,My friends left me out of their plans. I'm a pretty social person so it's not very fun for me,234,No_comma_ but I think it's because we had a major argument and they all took the other person's side,4|5|5_5|5|5,\nhit:842_conv:1684,4,lonely,My friends left me out of their plans. I'm a pretty social person so it's not very fun for me,40,I would let things cool down for awhile and maybe they will have a change of heart. If not _comma_ apologize and see if that helps.,4|5|5_5|5|5,\nhit:842_conv:1685,1,anticipating,I am getting ready to make reservations at the beach for next month for a whole week. I can't wait. ,40,I can't wait to go on vacation next. Getting ready to make reservations online.,5|5|5_4|5|5,\nhit:842_conv:1685,2,anticipating,I am getting ready to make reservations at the beach for next month for a whole week. I can't wait. ,234,Sounds fun! What area did you have in mind_comma_ since you're already about to make the reservations,5|5|5_4|5|5,\nhit:842_conv:1685,3,anticipating,I am getting ready to make reservations at the beach for next month for a whole week. I can't wait. ,40,South Carolina area. I have some cousins that live there_comma_ so it will be fun seeing them also.,5|5|5_4|5|5,\nhit:842_conv:1685,4,anticipating,I am getting ready to make reservations at the beach for next month for a whole week. I can't wait. ,234,I bet! I've been to South Carolina several times. It's very beautiful there_comma_ and I'm sure you'll have fun,5|5|5_4|5|5,\nhit:842_conv:1685,5,anticipating,I am getting ready to make reservations at the beach for next month for a whole week. I can't wait. ,40,It's a long drive from where I live but I love the beach and water. ,5|5|5_4|5|5,\nhit:843_conv:1686,1,furious,My mother stole my wife's jewelry.,225,My mother stole my wife's jewelry while she was in the hospital.,5|5|5_4|4|4,\nhit:843_conv:1686,2,furious,My mother stole my wife's jewelry.,158,Was it a nice steal or a mean one?,5|5|5_4|4|4,\nhit:843_conv:1686,3,furious,My mother stole my wife's jewelry.,225,well_comma_ we found out when we found her pawn shop receipt years later.,5|5|5_4|4|4,\nhit:843_conv:1686,4,furious,My mother stole my wife's jewelry.,158,Did you ask her about it?,5|5|5_4|4|4,\nhit:843_conv:1686,5,furious,My mother stole my wife's jewelry.,225,she was dead when we found it.,5|5|5_4|4|4,\nhit:844_conv:1688,1,afraid,I've been hearing noises around the house at night.,225,I've been hearing some strange noises around the house at night.,5|5|5_5|5|5,\nhit:844_conv:1688,2,afraid,I've been hearing noises around the house at night.,50,oh no! That's scary! What do you think it is?,5|5|5_5|5|5,\nhit:844_conv:1688,3,afraid,I've been hearing noises around the house at night.,225,I don't know_comma_ that's what's making me anxious.,5|5|5_5|5|5,\nhit:844_conv:1688,4,afraid,I've been hearing noises around the house at night.,50,I'm sorry to hear that. I wish I could help you figure it out,5|5|5_5|5|5,\nhit:845_conv:1690,1,guilty,i took my son to the park yesterday and he fell and hit his face,52,hey. i took my son to the park yesterday and he was going down the slide and i didn't catch him. he fell and hit his face _comma_ i feel so bad about it,5|5|5_3|0|1,\nhit:845_conv:1690,2,guilty,i took my son to the park yesterday and he fell and hit his face,17,Oh no! I hate to hear that he is hurt. But you shouldn't feel bad. It happens all the time. Kids will find a thousand ways to get hurt. ,5|5|5_3|0|1,\nhit:845_conv:1690,3,guilty,i took my son to the park yesterday and he fell and hit his face,52,tell me about it :) he keeps bumping his head_comma_ scraping his knees. such a busy body! ,5|5|5_3|0|1,\nhit:845_conv:1690,4,guilty,i took my son to the park yesterday and he fell and hit his face,17,My daughter is the same way! She gets bumped and scraped way more than my son_comma_ but she just goes right on. How is your son today?,5|5|5_3|0|1,\nhit:845_conv:1691,1,sad,I felt sad the other day when my best friend left. She visited for several days and I got used to her being here_comma_ but then she left and I miss her.,17,My best friend moved away last year. A couple weeks ago she came to town and she and her son stayed with me and my family for 9 days. She left 3 days ago and I feel like a piece of me is missing.,3|0|1_5|5|5,\nhit:845_conv:1691,2,sad,I felt sad the other day when my best friend left. She visited for several days and I got used to her being here_comma_ but then she left and I miss her.,52,i know how you feel... My best friend lives in a different country,3|0|1_5|5|5,\nhit:845_conv:1691,3,sad,I felt sad the other day when my best friend left. She visited for several days and I got used to her being here_comma_ but then she left and I miss her.,17,That must be so hard. How often do you see each other?,3|0|1_5|5|5,\nhit:845_conv:1691,4,sad,I felt sad the other day when my best friend left. She visited for several days and I got used to her being here_comma_ but then she left and I miss her.,52,not often at all. I saw her in 2011. we skype but it's not the same,3|0|1_5|5|5,\nhit:845_conv:1691,5,sad,I felt sad the other day when my best friend left. She visited for several days and I got used to her being here_comma_ but then she left and I miss her.,17,No it isn't at all. My BFF and I text and talk on the phone constantly_comma_ but there is nothing like spending actual time together. My son and her son are best friends too_comma_ and my little boy has been sad ever since they left.,3|0|1_5|5|5,\nhit:846_conv:1692,1,nostalgic,I recently downloaded the Quest for Glory game series I used to play as a kid and felt it all rushing back to me.,216,Do you ever replay a video game or re-watch a movie you really enjoyed as a kid? The memories of your initial experience can really come rushing back.,4|5|5_5|5|5,\nhit:846_conv:1692,2,nostalgic,I recently downloaded the Quest for Glory game series I used to play as a kid and felt it all rushing back to me.,225,I do that all the time. I can remember lots of times watching things from long ago.,4|5|5_5|5|5,\nhit:846_conv:1692,3,nostalgic,I recently downloaded the Quest for Glory game series I used to play as a kid and felt it all rushing back to me.,216,It's always a bizarre but welcome experience. I downloaded Quest for Glory_comma_ a game I used to adore watching my father play. Now_comma_ as an adult_comma_ it isn't that great_comma_ but the memories are still there.,4|5|5_5|5|5,\nhit:846_conv:1692,4,nostalgic,I recently downloaded the Quest for Glory game series I used to play as a kid and felt it all rushing back to me.,225,I still play some games from the 1990s.,4|5|5_5|5|5,\nhit:846_conv:1692,5,nostalgic,I recently downloaded the Quest for Glory game series I used to play as a kid and felt it all rushing back to me.,216,Isn't it great? Sure_comma_ the graphics or interface might be outdated. But there is just a certain charm to reliving those moments from your past again.,4|5|5_5|5|5,\nhit:846_conv:1693,1,sad,I'm blue that my parents have dementia now.,225,I'm upset these days that both of my parents have dementia now and most of the time don't even know who I am. Makes me feel very alone.,5|5|5_4|5|5,\nhit:846_conv:1693,2,sad,I'm blue that my parents have dementia now.,216,That must be very hard on you_comma_ I'm sorry to hear that. It must be very scary to experience.,5|5|5_4|5|5,\nhit:846_conv:1693,3,sad,I'm blue that my parents have dementia now.,225,It is like they are dead already without the funeral.,5|5|5_4|5|5,\nhit:846_conv:1693,4,sad,I'm blue that my parents have dementia now.,216,Is there anything that can be done from a medical standpoint? ,5|5|5_4|5|5,\nhit:847_conv:1694,1,proud,I passed all of my summer classes! Those are the hardest.,27,I took classes this summer and passed all of them.,5|5|5_2|4|4,\nhit:847_conv:1694,2,proud,I passed all of my summer classes! Those are the hardest.,17,Woo hoo! Congratulations! You must be super proud of yourse.f,5|5|5_2|4|4,\nhit:847_conv:1694,3,proud,I passed all of my summer classes! Those are the hardest.,27,I am. Summer is the hardest because the classes are shorter and all of the parties.,5|5|5_2|4|4,\nhit:847_conv:1694,4,proud,I passed all of my summer classes! Those are the hardest.,17,What classes did you take?,5|5|5_2|4|4,\nhit:847_conv:1694,5,proud,I passed all of my summer classes! Those are the hardest.,27,spanish_comma_ math_comma_ psych,5|5|5_2|4|4,\nhit:847_conv:1694,6,proud,I passed all of my summer classes! Those are the hardest.,17,Which math class did you take? ,5|5|5_2|4|4,\nhit:847_conv:1694,7,proud,I passed all of my summer classes! Those are the hardest.,27,it was basic college math. ,5|5|5_2|4|4,\nhit:847_conv:1694,8,proud,I passed all of my summer classes! Those are the hardest.,17,Oh okay. I bet psychology was an interesting course.,5|5|5_2|4|4,\nhit:847_conv:1695,1,annoyed,My kids are not behaving at all today. They are really getting on my nerves.,17,So my kids are on my nerves so much today. They are not behaving at all_comma_ and are making it impossible for me to get any work done.,2|4|4_5|5|5,\nhit:847_conv:1695,2,annoyed,My kids are not behaving at all today. They are really getting on my nerves.,27,That sucks. ,2|4|4_5|5|5,\nhit:847_conv:1695,3,annoyed,My kids are not behaving at all today. They are really getting on my nerves.,17,Yes_comma_ it does. They are bored_comma_ I'm sure. But I can't take them anywhere until later.,2|4|4_5|5|5,\nhit:847_conv:1695,4,annoyed,My kids are not behaving at all today. They are really getting on my nerves.,27,My kids are taking a nap now. The run this house lol,2|4|4_5|5|5,\nhit:847_conv:1695,5,annoyed,My kids are not behaving at all today. They are really getting on my nerves.,17,Kids have a terrible way of doing that.,2|4|4_5|5|5,\nhit:848_conv:1696,1,confident,today when i took my spouse to her interview. i think she got it for sure! ,11,Today my spouse had an interview_comma_ and said it went very well! ,5|5|5_5|5|5,\nhit:848_conv:1696,2,confident,today when i took my spouse to her interview. i think she got it for sure! ,52,awesome! My husband had an interview as well. I hope both of our spouses get a job,5|5|5_5|5|5,\nhit:848_conv:1696,3,confident,today when i took my spouse to her interview. i think she got it for sure! ,11,That is amazing! I bet they will both get it for sure! :) Fingers Crossed. ,5|5|5_5|5|5,\nhit:848_conv:1696,4,confident,today when i took my spouse to her interview. i think she got it for sure! ,52,I hope so! My husband was so nervous but he thinks it went well,5|5|5_5|5|5,\nhit:848_conv:1697,1,angry,Somebody stole my mail,52,It was my birthday and my friends sent me birthday cards in the mail. I received all of them but not the one who contained a gift card. i'm so angry about it,5|5|5_5|5|5,\nhit:848_conv:1697,2,angry,Somebody stole my mail,11,Ugh_comma_ oh no.... is there someway you can have the person who sent it call the gift card to see what can be done? ,5|5|5_5|5|5,\nhit:848_conv:1697,3,angry,Somebody stole my mail,52,I don't want to bother her about it. but i did call usps and they will investigate it,5|5|5_5|5|5,\nhit:848_conv:1697,4,angry,Somebody stole my mail,11,True true_comma_ well im glad they are looking into it for you. I hope they find it! ,5|5|5_5|5|5,\nhit:849_conv:1698,1,surprised,I was told i have a trip coming up. its to a place ive been wanting to go ,11,So I was told I am being taken on a trip to the beach as a gift... pretty exciting. ,5|5|5_5|5|5,\nhit:849_conv:1698,2,surprised,I was told i have a trip coming up. its to a place ive been wanting to go ,225,Where are you going ?,5|5|5_5|5|5,\nhit:849_conv:1698,3,surprised,I was told i have a trip coming up. its to a place ive been wanting to go ,11,They are taking me to the keys in FL! Unexpected.,5|5|5_5|5|5,\nhit:849_conv:1698,4,surprised,I was told i have a trip coming up. its to a place ive been wanting to go ,225,Oh_comma_ that should be nice. I hope you have fun.,5|5|5_5|5|5,\nhit:849_conv:1699,1,surprised,I was startled by a car hitting a deer in front of my house yesterday.,225,I was startled by a car hitting a deer in front of my house yesterday.,5|5|5_5|5|5,\nhit:849_conv:1699,2,surprised,I was startled by a car hitting a deer in front of my house yesterday.,11,Wow... I would have been as well! Was anyone injured? ,5|5|5_5|5|5,\nhit:849_conv:1699,3,surprised,I was startled by a car hitting a deer in front of my house yesterday.,225,I don't think so_comma_ but the deer is dead for sure.,5|5|5_5|5|5,\nhit:849_conv:1699,4,surprised,I was startled by a car hitting a deer in front of my house yesterday.,11,Bummer but glad the people are okay! ,5|5|5_5|5|5,\nhit:850_conv:1700,1,annoyed,My kids wouldn't be quiet lasy night when I tried to go to bead early.,27,I woke up late and it's my kids fault.,5|5|5_5|5|5,\nhit:850_conv:1700,2,annoyed,My kids wouldn't be quiet lasy night when I tried to go to bead early.,11,Oh no... are they in trouble? lol ,5|5|5_5|5|5,\nhit:850_conv:1700,3,annoyed,My kids wouldn't be quiet lasy night when I tried to go to bead early.,27,no. They are sleep and I can get some things done.,5|5|5_5|5|5,\nhit:850_conv:1700,4,annoyed,My kids wouldn't be quiet lasy night when I tried to go to bead early.,11,Maybe tomorrow morning you should wake them up super early as a surprise. :p,5|5|5_5|5|5,\nhit:850_conv:1700,5,annoyed,My kids wouldn't be quiet lasy night when I tried to go to bead early.,27,Sounds like a plan,5|5|5_5|5|5,\nhit:850_conv:1701,1,caring,my wife decided to take me out for dinner after a long shift. it was nice of her ,11,I had a really bad day at work yesterday_comma_ and my wife decided to take me out to my favorite place after work. ,5|5|5_5|5|5,\nhit:850_conv:1701,2,caring,my wife decided to take me out for dinner after a long shift. it was nice of her ,27,That was nice. ,5|5|5_5|5|5,\nhit:850_conv:1701,3,caring,my wife decided to take me out for dinner after a long shift. it was nice of her ,11,It was really thoughtful of her_comma_ Im thankful for it. I needed that. ,5|5|5_5|5|5,\nhit:850_conv:1701,4,caring,my wife decided to take me out for dinner after a long shift. it was nice of her ,27,Wives are awesome like that.,5|5|5_5|5|5,\nhit:851_conv:1702,1,impressed,MY daughter just learned to play the ukelele over the summer. She taught herself.,27,My daughter just learned to play the ukelele.,5|5|5_5|5|5,\nhit:851_conv:1702,2,impressed,MY daughter just learned to play the ukelele over the summer. She taught herself.,52,how fun! I bet she is good at it,5|5|5_5|5|5,\nhit:851_conv:1702,3,impressed,MY daughter just learned to play the ukelele over the summer. She taught herself.,27,she actually is and she taught herself,5|5|5_5|5|5,\nhit:851_conv:1702,4,impressed,MY daughter just learned to play the ukelele over the summer. She taught herself.,52,wow_comma_ that's amazing. She is very talented. I would never be able to do that,5|5|5_5|5|5,\nhit:851_conv:1702,5,impressed,MY daughter just learned to play the ukelele over the summer. She taught herself.,27,me either. She is awesome,5|5|5_5|5|5,\nhit:851_conv:1703,1,devastated,I lost my job and i'm the only provider in my family i'm so stressed,52,I lost my job and my wife is a stay at home mom. I don't know how to pay for rent_comma_ i'm so stressed,5|5|5_5|5|5,\nhit:851_conv:1703,2,devastated,I lost my job and i'm the only provider in my family i'm so stressed,27,oh no. o'm sorry to here that.,5|5|5_5|5|5,\nhit:851_conv:1703,3,devastated,I lost my job and i'm the only provider in my family i'm so stressed,52,thank you. I had an interview today so i hope i will get that job,5|5|5_5|5|5,\nhit:851_conv:1703,4,devastated,I lost my job and i'm the only provider in my family i'm so stressed,27,I hope you do too. It will work out in the end.,5|5|5_5|5|5,\nhit:852_conv:1704,1,faithful,I've always been very loyal to my family.,225,I've always been loyal to my family.,5|5|5_5|5|5,\nhit:852_conv:1704,2,faithful,I've always been very loyal to my family.,27,that's great. family is important,5|5|5_5|5|5,\nhit:852_conv:1704,3,faithful,I've always been very loyal to my family.,225,Yes_comma_ I totally agree. Now if I could get my parents to agree I'd have it made.,5|5|5_5|5|5,\nhit:852_conv:1704,4,faithful,I've always been very loyal to my family.,27,That's good. Some parents can be old fashioned.,5|5|5_5|5|5,\nhit:852_conv:1705,1,jealous,One of my friends got engaged. I'm having a hard time being happy for her.,27,MY friend just got engaged,5|5|5_5|5|5,\nhit:852_conv:1705,2,jealous,One of my friends got engaged. I'm having a hard time being happy for her.,225,Well_comma_ that's nice to hear. Is it their first marriage.,5|5|5_5|5|5,\nhit:852_conv:1705,3,jealous,One of my friends got engaged. I'm having a hard time being happy for her.,27,It is her first. But I want to be engaged and I don't have a boyfriend. That sucks,5|5|5_5|5|5,\nhit:852_conv:1705,4,jealous,One of my friends got engaged. I'm having a hard time being happy for her.,225,Try not to approach it like that_comma_ but do look for the right man.,5|5|5_5|5|5,\nhit:852_conv:1705,5,jealous,One of my friends got engaged. I'm having a hard time being happy for her.,27,I am. I am happy for her too,5|5|5_5|5|5,\nhit:853_conv:1706,1,grateful,I'm so happy I've been doing well in school while working. For a while I thought I would have to drop out.,27,I've been doing great in school so far.,5|5|5_4|5|5,\nhit:853_conv:1706,2,grateful,I'm so happy I've been doing well in school while working. For a while I thought I would have to drop out.,244,How long have you been in school?,5|5|5_4|5|5,\nhit:853_conv:1706,3,grateful,I'm so happy I've been doing well in school while working. For a while I thought I would have to drop out.,27,Three years. I had a rough start trying to work and study.,5|5|5_4|5|5,\nhit:853_conv:1706,4,grateful,I'm so happy I've been doing well in school while working. For a while I thought I would have to drop out.,244,That's so great to hear. Are you going to graduate with honors?,5|5|5_4|5|5,\nhit:853_conv:1706,5,grateful,I'm so happy I've been doing well in school while working. For a while I thought I would have to drop out.,27,I wish. I've been passing all of my classes though so. One step at a time.,5|5|5_4|5|5,\nhit:853_conv:1706,6,grateful,I'm so happy I've been doing well in school while working. For a while I thought I would have to drop out.,244,What are you going to school for?,5|5|5_4|5|5,\nhit:853_conv:1706,7,grateful,I'm so happy I've been doing well in school while working. For a while I thought I would have to drop out.,27,Criminology,5|5|5_4|5|5,<UNIGRAM>\nhit:853_conv:1706,8,grateful,I'm so happy I've been doing well in school while working. For a while I thought I would have to drop out.,244,Do you want to be a lawyer or joing the police?,5|5|5_4|5|5,\nhit:853_conv:1707,1,embarrassed,I was at a wedding and walking to be seated (up at the fron because it was my sisters wedding) and I missed my chair and fell down when i went to sit.,244,I missed my seat when I went to sit down at a wedding and fell down_comma_ infront of everyone,4|5|5_5|5|5,\nhit:853_conv:1707,2,embarrassed,I was at a wedding and walking to be seated (up at the fron because it was my sisters wedding) and I missed my chair and fell down when i went to sit.,27,Oh no. Did you laugh or cry?,4|5|5_5|5|5,\nhit:853_conv:1707,3,embarrassed,I was at a wedding and walking to be seated (up at the fron because it was my sisters wedding) and I missed my chair and fell down when i went to sit.,244,I laughed with everyone and I may have secretly cried on the inside a little. ,4|5|5_5|5|5,\nhit:853_conv:1707,4,embarrassed,I was at a wedding and walking to be seated (up at the fron because it was my sisters wedding) and I missed my chair and fell down when i went to sit.,27,ITs fine. It happens,4|5|5_5|5|5,\nhit:853_conv:1707,5,embarrassed,I was at a wedding and walking to be seated (up at the fron because it was my sisters wedding) and I missed my chair and fell down when i went to sit.,244,It makes for a good story at least.,4|5|5_5|5|5,\nhit:854_conv:1708,1,hopeful,I'm very much looking forward to buying a house.,225,I'm very much looking forward to buying a house.,5|5|5_5|5|5,\nhit:854_conv:1708,2,hopeful,I'm very much looking forward to buying a house.,27,Cool. I am too. ,5|5|5_5|5|5,\nhit:854_conv:1708,3,hopeful,I'm very much looking forward to buying a house.,225,How soon are you planning to buy?,5|5|5_5|5|5,\nhit:854_conv:1708,4,hopeful,I'm very much looking forward to buying a house.,27,Hopefully next year. I've been in my apartment 5 years now,5|5|5_5|5|5,\nhit:854_conv:1709,1,nostalgic,My daughter will be in high school soon. I been thinking about my high school days recently,27,I've been thinking about my highg school years a lot recently,5|5|5_5|5|5,\nhit:854_conv:1709,2,nostalgic,My daughter will be in high school soon. I been thinking about my high school days recently,225,Good memories I hope.,5|5|5_5|5|5,\nhit:854_conv:1709,3,nostalgic,My daughter will be in high school soon. I been thinking about my high school days recently,27,Yes. My daughter will be in high school soon so I think that's why,5|5|5_5|5|5,\nhit:854_conv:1709,4,nostalgic,My daughter will be in high school soon. I been thinking about my high school days recently,225,That will do it. I get that some too.,5|5|5_5|5|5,\nhit:854_conv:1709,5,nostalgic,My daughter will be in high school soon. I been thinking about my high school days recently,27,She has grown up on me. ,5|5|5_5|5|5,\nhit:855_conv:1710,1,confident,I just ordered a bunch of dresses online. I am gonna be able to fit each one of them.,27,I just lost some weight so I ordered a bunch of dresses online,5|5|5_5|5|5,\nhit:855_conv:1710,2,confident,I just ordered a bunch of dresses online. I am gonna be able to fit each one of them.,160,Thats great!  It's awesome you are doing things for yourself.,5|5|5_5|5|5,\nhit:855_conv:1710,3,confident,I just ordered a bunch of dresses online. I am gonna be able to fit each one of them.,27,I think I'll be able to fit them all too.,5|5|5_5|5|5,\nhit:855_conv:1710,4,confident,I just ordered a bunch of dresses online. I am gonna be able to fit each one of them.,160,That really is good news you should be feeling proud.,5|5|5_5|5|5,\nhit:855_conv:1710,5,confident,I just ordered a bunch of dresses online. I am gonna be able to fit each one of them.,27,I am,5|5|5_5|5|5,\nhit:855_conv:1710,6,confident,I just ordered a bunch of dresses online. I am gonna be able to fit each one of them.,160,So whats next.. for your goals?,5|5|5_5|5|5,\nhit:855_conv:1710,7,confident,I just ordered a bunch of dresses online. I am gonna be able to fit each one of them.,27,Size 7,5|5|5_5|5|5,\nhit:855_conv:1710,8,confident,I just ordered a bunch of dresses online. I am gonna be able to fit each one of them.,160,Oooh you will probably get there in no time.,5|5|5_5|5|5,\nhit:855_conv:1711,1,excited,I just got a new job!  I am so excited!,160,Well I just got a call telling me I have gotten the job.  I got a new job!,5|5|5_5|5|5,\nhit:855_conv:1711,2,excited,I just got a new job!  I am so excited!,27,Congratulations! I hope you lovve it,5|5|5_5|5|5,\nhit:855_conv:1711,3,excited,I just got a new job!  I am so excited!,160,Well I haven't started yet so I don't know for sure but I think I will really like it there.,5|5|5_5|5|5,\nhit:855_conv:1711,4,excited,I just got a new job!  I am so excited!,27,I hope so. It really sucks when you hate your job lol,5|5|5_5|5|5,\nhit:855_conv:1711,5,excited,I just got a new job!  I am so excited!,160,I had many of those type of jobs but now I am a teacher and I like it more than the millions of jobs I had before.,5|5|5_5|5|5,\nhit:856_conv:1712,1,furious,I was going to a halloween party and sat out a bowl of candy for the kids_comma_ the first person by took the entire bowl of candy.,244,I was going to a halloweed party... so I left out a big bowl of candy for the kids.    I accidently left my phone at my house and when I went back for it I had found that within 5 minutes someone had taken the entire bowl of candy.,5|5|5_5|5|5,\nhit:856_conv:1712,2,furious,I was going to a halloween party and sat out a bowl of candy for the kids_comma_ the first person by took the entire bowl of candy.,27,Oh no. I thought kids didn't do that anymore,5|5|5_5|5|5,\nhit:856_conv:1712,3,furious,I was going to a halloween party and sat out a bowl of candy for the kids_comma_ the first person by took the entire bowl of candy.,244,Yep.... I don't bother putting out candy anymore. ,5|5|5_5|5|5,\nhit:856_conv:1712,4,furious,I was going to a halloween party and sat out a bowl of candy for the kids_comma_ the first person by took the entire bowl of candy.,27,They ruined it for you. Halloween is my favorite holiday,5|5|5_5|5|5,\nhit:856_conv:1712,5,furious,I was going to a halloween party and sat out a bowl of candy for the kids_comma_ the first person by took the entire bowl of candy.,244,Its one of my favorites too.  Do you still dress up?,5|5|5_5|5|5,\nhit:856_conv:1712,6,furious,I was going to a halloween party and sat out a bowl of candy for the kids_comma_ the first person by took the entire bowl of candy.,27,Yep. I do a theme with my kids. Were were all comic villains last year,5|5|5_5|5|5,\nhit:856_conv:1712,7,furious,I was going to a halloween party and sat out a bowl of candy for the kids_comma_ the first person by took the entire bowl of candy.,244,You didn't steal an entire bowl of candy someone left infront of their house did you? ,5|5|5_5|5|5,\nhit:856_conv:1713,1,furious,I hate that I am the only one who cleans around here. It really gets on my nerves,27,I am the only one who cleans in my apartment,5|5|5_5|5|5,\nhit:856_conv:1713,2,furious,I hate that I am the only one who cleans around here. It really gets on my nerves,244,Are you the only one who lives in your apartment?,5|5|5_5|5|5,\nhit:856_conv:1713,3,furious,I hate that I am the only one who cleans around here. It really gets on my nerves,27,No. My three kids but they are the laziest kids I've ever seen,5|5|5_5|5|5,\nhit:856_conv:1713,4,furious,I hate that I am the only one who cleans around here. It really gets on my nerves,244,Have you considered setting up a structure with mandatory chores?,5|5|5_5|5|5,\nhit:856_conv:1713,5,furious,I hate that I am the only one who cleans around here. It really gets on my nerves,27,My oldest is the only one who can read and she is terrible,5|5|5_5|5|5,\nhit:856_conv:1713,6,furious,I hate that I am the only one who cleans around here. It really gets on my nerves,244,At reading or in general?,5|5|5_5|5|5,\nhit:856_conv:1713,7,furious,I hate that I am the only one who cleans around here. It really gets on my nerves,27,in general lol,5|5|5_5|5|5,\nhit:856_conv:1713,8,furious,I hate that I am the only one who cleans around here. It really gets on my nerves,244,Do I need to steal one of her toys to teach her a lesson?,5|5|5_5|5|5,\nhit:857_conv:1714,1,disappointed,when i was laid off from work. it made me sad ,11,So during my last employer_comma_ they decided to give us a raise and then lay us off! Isnt that crazy ,5|5|5_5|5|5,\nhit:857_conv:1714,2,disappointed,when i was laid off from work. it made me sad ,225,Well_comma_ I don't see the point in that.,5|5|5_5|5|5,\nhit:857_conv:1714,3,disappointed,when i was laid off from work. it made me sad ,11,Yeah right? Literally 2 months later they were like and btw... :o ,5|5|5_5|5|5,\nhit:857_conv:1714,4,disappointed,when i was laid off from work. it made me sad ,225,At least you've got work here though.,5|5|5_5|5|5,\nhit:857_conv:1715,1,excited,I'm happy for my girls going back to school this fall.,225,I'm happy for my girls going back to school this fall.,5|5|5_5|5|5,\nhit:857_conv:1715,2,excited,I'm happy for my girls going back to school this fall.,11,Ohhh I feel you! lol... Mine isnt quite school aged yet but I was just saying today I cant wait. ( ha ha! ) How old are they? ,5|5|5_5|5|5,\nhit:857_conv:1715,3,excited,I'm happy for my girls going back to school this fall.,225,10 and 13 now. Both in middle school.,5|5|5_5|5|5,\nhit:857_conv:1715,4,excited,I'm happy for my girls going back to school this fall.,11,Does it get any easier as they get older? please tell me yes... ,5|5|5_5|5|5,\nhit:857_conv:1715,5,excited,I'm happy for my girls going back to school this fall.,225,No_comma_ and it gets progressively more expensive.,5|5|5_5|5|5,\nhit:858_conv:1716,1,annoyed,I just got new neighbors and they are so loud.,27,My new neighbors are terrible,5|5|5_5|5|5,\nhit:858_conv:1716,2,annoyed,I just got new neighbors and they are so loud.,11,That sucks... what are they doing? ,5|5|5_5|5|5,\nhit:858_conv:1716,3,annoyed,I just got new neighbors and they are so loud.,27,They've been here a week and they are so loud.,5|5|5_5|5|5,\nhit:858_conv:1716,4,annoyed,I just got new neighbors and they are so loud.,11,I know there probably isnt much you can do. :/ I hope it gets better... ,5|5|5_5|5|5,\nhit:858_conv:1717,1,excited,I cant wait for christmas. We are getting a new tree and new start! ,11,Im already getting pumped up for christmas this year... ,5|5|5_5|5|5,\nhit:858_conv:1717,2,excited,I cant wait for christmas. We are getting a new tree and new start! ,27,I love Christmas!,5|5|5_5|5|5,\nhit:858_conv:1717,3,excited,I cant wait for christmas. We are getting a new tree and new start! ,11,Me too especially this year.. new apartment for us new state. Whats your fav part of the holiday? ,5|5|5_5|5|5,\nhit:858_conv:1717,4,excited,I cant wait for christmas. We are getting a new tree and new start! ,27,Seeing my kids open their gifts. I never make it to Christmas because I'm so excited to see them lol,5|5|5_5|5|5,\nhit:858_conv:1717,5,excited,I cant wait for christmas. We are getting a new tree and new start! ,11,Its such a good feeling right_comma_ the best! :) ,5|5|5_5|5|5,\nhit:858_conv:1717,6,excited,I cant wait for christmas. We are getting a new tree and new start! ,27,I never get anything but that's fine,5|5|5_5|5|5,\nhit:859_conv:1718,1,surprised,I've been shocked at how hot this summer has been.,225,This has been a really hot summer.,5|5|5_5|5|5,\nhit:859_conv:1718,2,surprised,I've been shocked at how hot this summer has been.,11,Yes it has! Even NY is extremely hot. What state are you in? ,5|5|5_5|5|5,\nhit:859_conv:1718,3,surprised,I've been shocked at how hot this summer has been.,225,I'm in tennessee_comma_ and it's hot and humid.,5|5|5_5|5|5,\nhit:859_conv:1718,4,surprised,I've been shocked at how hot this summer has been.,11,Wooo. I am in Florida. I feel you. ,5|5|5_5|5|5,\nhit:859_conv:1719,1,guilty,i ate the last of the pizza_comma_ and it wasnt mine. oops ,11,We ordered pizza the other day_comma_ and I ended up eating the last slice behind everyones back. ,5|5|5_5|5|5,\nhit:859_conv:1719,2,guilty,i ate the last of the pizza_comma_ and it wasnt mine. oops ,225,Sounds like the right things to do.,5|5|5_5|5|5,\nhit:859_conv:1719,3,guilty,i ate the last of the pizza_comma_ and it wasnt mine. oops ,11,I know right_comma_ felt a little bad but hey what can ya do! lol ,5|5|5_5|5|5,\nhit:859_conv:1719,4,guilty,i ate the last of the pizza_comma_ and it wasnt mine. oops ,225,yeah_comma_ you're hungry...it's there.,5|5|5_5|5|5,\nhit:860_conv:1720,1,jealous,I am so jealous my best friend just won the lotto.,160,I am so mad at my best friend.  She won the lotto last week.,5|5|5_5|5|5,\nhit:860_conv:1720,2,jealous,I am so jealous my best friend just won the lotto.,27,Wow! How much was it?,5|5|5_5|5|5,\nhit:860_conv:1720,3,jealous,I am so jealous my best friend just won the lotto.,160,a Half Million... can you believe it??,5|5|5_5|5|5,\nhit:860_conv:1720,4,jealous,I am so jealous my best friend just won the lotto.,27,I'd be mad too. You don't think she will share it with you,5|5|5_5|5|5,\nhit:860_conv:1720,5,jealous,I am so jealous my best friend just won the lotto.,160,even if she did.. she isnt going to give me that much.. why can't I ever be the one that wins?,5|5|5_5|5|5,\nhit:860_conv:1720,6,jealous,I am so jealous my best friend just won the lotto.,27,I never win either.,5|5|5_5|5|5,\nhit:860_conv:1720,7,jealous,I am so jealous my best friend just won the lotto.,160,I need it so bad too.  I have so many bills.,5|5|5_5|5|5,\nhit:860_conv:1721,1,hopeful,I'm single and 34 and it still think I will meet someone and get married someday,27,I can't believe I;m still single at 34!,5|5|5_5|5|5,\nhit:860_conv:1721,2,hopeful,I'm single and 34 and it still think I will meet someone and get married someday,160,Oh wow.  Have you ever been married?,5|5|5_5|5|5,\nhit:860_conv:1721,3,hopeful,I'm single and 34 and it still think I will meet someone and get married someday,27,Nope. I haven't been on a date in a year or so,5|5|5_5|5|5,\nhit:860_conv:1721,4,hopeful,I'm single and 34 and it still think I will meet someone and get married someday,160,Do you have any children?,5|5|5_5|5|5,\nhit:860_conv:1721,5,hopeful,I'm single and 34 and it still think I will meet someone and get married someday,27,I have three two toddlers and a teen,5|5|5_5|5|5,\nhit:860_conv:1721,6,hopeful,I'm single and 34 and it still think I will meet someone and get married someday,160,Wow.  That must be a lot of work.,5|5|5_5|5|5,\nhit:860_conv:1721,7,hopeful,I'm single and 34 and it still think I will meet someone and get married someday,27,Plus I work and am in college_comma_ so I guess I just haven't had time,5|5|5_5|5|5,\nhit:860_conv:1721,8,hopeful,I'm single and 34 and it still think I will meet someone and get married someday,160,I am sorry.  You sound like a really hard worker.,5|5|5_5|5|5,\nhit:861_conv:1722,1,anticipating,ready for a vacation. ready to get out there and relax! ,11,I really can NOT wait to go on vacation. ,5|5|5_5|5|5,\nhit:861_conv:1722,2,anticipating,ready for a vacation. ready to get out there and relax! ,225,Do you have any plans as to where to go.,5|5|5_5|5|5,\nhit:861_conv:1722,3,anticipating,ready for a vacation. ready to get out there and relax! ,11,Yes! I am going to the keys on vaca! woo hoooooo cant wait ,5|5|5_5|5|5,\nhit:861_conv:1722,4,anticipating,ready for a vacation. ready to get out there and relax! ,225,Think I've talked to you before_comma_ still hope you have a nice vacation.,5|5|5_5|5|5,\nhit:861_conv:1722,5,anticipating,ready for a vacation. ready to get out there and relax! ,11,Probably_comma_ You can tell I am pumped about it right lol ,5|5|5_5|5|5,\nhit:861_conv:1723,1,prepared,I always try to be ready for things when I travel.,225,I always try to be ready for things when I travel.,5|5|5_5|5|5,\nhit:861_conv:1723,2,prepared,I always try to be ready for things when I travel.,11,Me too. I plan like 10 years ahead of time. How far in advance do you plan? ,5|5|5_5|5|5,\nhit:861_conv:1723,3,prepared,I always try to be ready for things when I travel.,225,As far as I can. I sometimes don't know that far ahead though.,5|5|5_5|5|5,\nhit:861_conv:1723,4,prepared,I always try to be ready for things when I travel.,11,Better safe than sorry ,5|5|5_5|5|5,\nhit:862_conv:1724,1,guilty,I haven't made a home cooked meal in a while for my kids I feel bad.,27,I haven't cooked for my family in a while. Always take out,5|5|5_5|5|5,\nhit:862_conv:1724,2,guilty,I haven't made a home cooked meal in a while for my kids I feel bad.,100,I definitely suggest a nice home-cooked meal_comma_ it's usually a lot healthier than take out.,5|5|5_5|5|5,\nhit:862_conv:1724,3,guilty,I haven't made a home cooked meal in a while for my kids I feel bad.,27,it is. I have just been so busy. ,5|5|5_5|5|5,\nhit:862_conv:1724,4,guilty,I haven't made a home cooked meal in a while for my kids I feel bad.,100,I understand_comma_ it's hard to find the time for everything sometimes.,5|5|5_5|5|5,\nhit:862_conv:1724,5,guilty,I haven't made a home cooked meal in a while for my kids I feel bad.,27,That's exactly what it is. They love the take out though lol,5|5|5_5|5|5,\nhit:862_conv:1725,1,sad,My dog is getting old and I think it's getting harder for him to walk_comma_ seeing that doesn't make me feel so good.,100,So my dog just turned 15_comma_ it's getting a bit harder for him to walk_comma_ it's tough to see.,5|5|5_5|5|5,\nhit:862_conv:1725,2,sad,My dog is getting old and I think it's getting harder for him to walk_comma_ seeing that doesn't make me feel so good.,27,15. Wow. That has to be tough.,5|5|5_5|5|5,\nhit:862_conv:1725,3,sad,My dog is getting old and I think it's getting harder for him to walk_comma_ seeing that doesn't make me feel so good.,100,Yeah_comma_ fortunately he's very small so he doesn't have as many joint problems as the bigger dogs I thnik at least.,5|5|5_5|5|5,\nhit:862_conv:1725,4,sad,My dog is getting old and I think it's getting harder for him to walk_comma_ seeing that doesn't make me feel so good.,27,I hope it doesn't get to bad for him.,5|5|5_5|5|5,\nhit:863_conv:1727,1,surprised,I can't believe I'm still single,27,I can't believe I am still single.,5|5|5_5|5|5,\nhit:863_conv:1727,2,surprised,I can't believe I'm still single,0,Why do you say that? Are you a man or woman?,5|5|5_5|5|5,\nhit:863_conv:1727,3,surprised,I can't believe I'm still single,27,A woman. I am 34 and not even dating. I thought I would be set by now.,5|5|5_5|5|5,\nhit:863_conv:1727,4,surprised,I can't believe I'm still single,0,Everything happens for a reason. I was single until I was 29. I met the right one on a dating app. No shame in an app.,5|5|5_5|5|5,\nhit:863_conv:1727,5,surprised,I can't believe I'm still single,27,I always get weirdos on apps. Maybe I'll try again though.,5|5|5_5|5|5,\nhit:863_conv:1727,6,surprised,I can't believe I'm still single,0,I went through 4 dates and then I met the one I am with. Try again! I have been with for clsoe to 2 years.,5|5|5_5|5|5,\nhit:863_conv:1727,7,surprised,I can't believe I'm still single,27,congrats! I'm gonna keep trying. I'm really sick of being single lol,5|5|5_5|5|5,\nhit:863_conv:1727,8,surprised,I can't believe I'm still single,0,Good luck! Sometimes single is nice tho. ,5|5|5_5|5|5,\nhit:864_conv:1728,1,prepared,The wife and I spent a lot of time getting ready to sell our house last summer,69,The wife and I spent a lot of time getting out previous home ready for sale_comma_ as we had to fix a few things and get very_comma_ very clean.,3|4|5_4|5|4,\nhit:864_conv:1728,2,prepared,The wife and I spent a lot of time getting ready to sell our house last summer,160,Oh I am doing the same thing but for a different reason.,3|4|5_4|5|4,\nhit:864_conv:1728,3,prepared,The wife and I spent a lot of time getting ready to sell our house last summer,69,It sold fast! Since we went in the market at its height,3|4|5_4|5|4,\nhit:864_conv:1728,4,prepared,The wife and I spent a lot of time getting ready to sell our house last summer,160,Thats wonderful news!  Did you make a nice profit?,3|4|5_4|5|4,\nhit:864_conv:1729,1,lonely,I am so tired of working at my desk all day like this.,160,I am so tired of being home and working all day.,4|5|4_3|4|5,\nhit:864_conv:1729,2,lonely,I am so tired of working at my desk all day like this.,69,Yea_comma_ between kids_comma_ cleaning_comma_ and everything else_comma_ its hard to stay energetic,4|5|4_3|4|5,\nhit:864_conv:1729,3,lonely,I am so tired of working at my desk all day like this.,160,For real!  It is worse for me because no one else is here. :(,4|5|4_3|4|5,\nhit:864_conv:1729,4,lonely,I am so tired of working at my desk all day like this.,69,Yea_comma_ then you hae to do it all yourself,4|5|4_3|4|5,\nhit:864_conv:1729,5,lonely,I am so tired of working at my desk all day like this.,160,It is so boring!,4|5|4_3|4|5,\nhit:865_conv:1730,1,grateful,I was glad when I woke up this morning and saw that an expected paycheck finally posted.,85,I checked my bank account this morning and I couldn't be happier.,4|5|5_4|5|5,\nhit:865_conv:1730,2,grateful,I was glad when I woke up this morning and saw that an expected paycheck finally posted.,245,I love that feeling_comma_ though I don't experience it often.  Why did it make you happy?,4|5|5_4|5|5,\nhit:865_conv:1730,3,grateful,I was glad when I woke up this morning and saw that an expected paycheck finally posted.,85,I was expecting a refund from my college for over a month and I finally got it!,4|5|5_4|5|5,\nhit:865_conv:1730,4,grateful,I was glad when I woke up this morning and saw that an expected paycheck finally posted.,245,Oh that's good!  I remember waiting for those refunds when I was in school. ,4|5|5_4|5|5,\nhit:865_conv:1731,1,anxious,I'm typically this way in a lot of situations_comma_ most recently when I had to go to the doctor and have something removed.  I felt better once I was there_comma_ though the feeling lingered a bit.  Everything turned out fine in the end.,245,I had to go to the doctor recently but everything turned out fine,4|5|5_4|5|5,\nhit:865_conv:1731,2,anxious,I'm typically this way in a lot of situations_comma_ most recently when I had to go to the doctor and have something removed.  I felt better once I was there_comma_ though the feeling lingered a bit.  Everything turned out fine in the end.,85,That's always good news.  Were you worried something was wrong?,4|5|5_4|5|5,\nhit:865_conv:1731,3,anxious,I'm typically this way in a lot of situations_comma_ most recently when I had to go to the doctor and have something removed.  I felt better once I was there_comma_ though the feeling lingered a bit.  Everything turned out fine in the end.,245,I had to have a device removed due to some issues with it_comma_ but I had a couple of small concerns also.  ,4|5|5_4|5|5,\nhit:865_conv:1731,4,anxious,I'm typically this way in a lot of situations_comma_ most recently when I had to go to the doctor and have something removed.  I felt better once I was there_comma_ though the feeling lingered a bit.  Everything turned out fine in the end.,85,I'm guessing all those small concerns turned out well if everything turned out fine.,4|5|5_4|5|5,\nhit:866_conv:1732,1,prepared,A hurricane is coming and I have been getting ready for the storm.,160,A hurricane is headed my way.  I have been working all day.,5|5|5_5|5|5,\nhit:866_conv:1732,2,prepared,A hurricane is coming and I have been getting ready for the storm.,227,A hurricane? That sounds awful! Where is it_comma_ I haven't heard anything about one_comma_ I live in Florida. ,5|5|5_5|5|5,\nhit:866_conv:1732,3,prepared,A hurricane is coming and I have been getting ready for the storm.,160,Well I live in Florida too.  That's funny that you haven't heard of this LOL.,5|5|5_5|5|5,\nhit:866_conv:1732,4,prepared,A hurricane is coming and I have been getting ready for the storm.,227,I better check_comma_ its better to be prepared then dead!!,5|5|5_5|5|5,\nhit:866_conv:1733,1,guilty,My husky usually spends most of her day outside in my fenced yard. She caught a squirrel the other day and was so excited to bring it to me and show me it. I felt so bad for the squirrel. ,227,My husky usually spends most of her day outside in my fenced yard. She caught a squirrel the other day and was so excited to bring it to me and show me it.,5|5|5_5|5|5,\nhit:866_conv:1733,2,guilty,My husky usually spends most of her day outside in my fenced yard. She caught a squirrel the other day and was so excited to bring it to me and show me it. I felt so bad for the squirrel. ,160,Ewwwwww.  Kinda gross.  My cats used to do that too.,5|5|5_5|5|5,\nhit:866_conv:1733,3,guilty,My husky usually spends most of her day outside in my fenced yard. She caught a squirrel the other day and was so excited to bring it to me and show me it. I felt so bad for the squirrel. ,227,I felt horrible for the squirrel. I dont like dead animals,5|5|5_5|5|5,\nhit:866_conv:1733,4,guilty,My husky usually spends most of her day outside in my fenced yard. She caught a squirrel the other day and was so excited to bring it to me and show me it. I felt so bad for the squirrel. ,160,Me either.  Only serial killers like dead animals.,5|5|5_5|5|5,\nhit:867_conv:1734,1,grateful,I so happy I am a working woman who can provide for herself and her children alone.,27,I am so happy to be independent.,5|5|5_5|5|5,\nhit:867_conv:1734,2,grateful,I so happy I am a working woman who can provide for herself and her children alone.,11,Its always better to rely on ourselves. Im happy for you! ,5|5|5_5|5|5,\nhit:867_conv:1734,3,grateful,I so happy I am a working woman who can provide for herself and her children alone.,27,I had to transition into it after a break up_comma_ but I am holding my own and in school too. ,5|5|5_5|5|5,\nhit:867_conv:1734,4,grateful,I so happy I am a working woman who can provide for herself and her children alone.,11,Honestly_comma_ its during our worst times we realize our true strength. Good for you. ,5|5|5_5|5|5,\nhit:867_conv:1734,5,grateful,I so happy I am a working woman who can provide for herself and her children alone.,27,Thanks. I'm proud of myself.,5|5|5_5|5|5,\nhit:867_conv:1735,1,embarrassed,When my daughter flipped out in the store. everyone stopped ,11,My daughter had a complete meltdown the other day inside of the store. ,5|5|5_5|5|5,\nhit:867_conv:1735,2,embarrassed,When my daughter flipped out in the store. everyone stopped ,27,Been there. Done that.,5|5|5_5|5|5,\nhit:867_conv:1735,3,embarrassed,When my daughter flipped out in the store. everyone stopped ,11,Tell me it gets better lol ,5|5|5_5|5|5,\nhit:867_conv:1735,4,embarrassed,When my daughter flipped out in the store. everyone stopped ,27,It does. Then she turns 13 and is a brick wall lol. ,5|5|5_5|5|5,\nhit:868_conv:1736,1,annoyed,I am so mad.  All my boyfriend does is play PS4 all day and all night long.,160,I am so mad all the time.  All my boyfriend does is play video games on the PS4.,5|5|5_5|5|5,\nhit:868_conv:1736,2,annoyed,I am so mad.  All my boyfriend does is play PS4 all day and all night long.,227,I understand that! Mine has one too_comma_ and it gets frustrating!,5|5|5_5|5|5,\nhit:868_conv:1736,3,annoyed,I am so mad.  All my boyfriend does is play PS4 all day and all night long.,160,He always has those headphones on and can't hear anything I say ever.,5|5|5_5|5|5,\nhit:868_conv:1736,4,annoyed,I am so mad.  All my boyfriend does is play PS4 all day and all night long.,227,Yeah of course_comma_ I just dont even talk to him when he has them on. I gave up,5|5|5_5|5|5,\nhit:868_conv:1737,1,furious,My neighbor is like 90 years old and really shouldn't be driving anything not even lawnmower. He hit my work truck and busted a tail light last night and my blood is boiling!,227,My neighbor is like 90 years old and really shouldn't be driving anything not even lawnmower. He hit my work truck and busted a tail light last night and my blood is boiling!,5|5|5_5|5|5,\nhit:868_conv:1737,2,furious,My neighbor is like 90 years old and really shouldn't be driving anything not even lawnmower. He hit my work truck and busted a tail light last night and my blood is boiling!,160,LOL that is sorta funny though.  I can just picture this.,5|5|5_5|5|5,\nhit:868_conv:1737,3,furious,My neighbor is like 90 years old and really shouldn't be driving anything not even lawnmower. He hit my work truck and busted a tail light last night and my blood is boiling!,227,Its so annoying! Like you can tell when you look at my security camera_comma_ he hits trash cans and crap all the time!,5|5|5_5|5|5,\nhit:868_conv:1737,4,furious,My neighbor is like 90 years old and really shouldn't be driving anything not even lawnmower. He hit my work truck and busted a tail light last night and my blood is boiling!,160,Maybe you should sneak over and mow it for him when he isn't home.,5|5|5_5|5|5,\nhit:869_conv:1738,1,terrified,when my car caught on fire. it was bad ,11,I wont forget watching my car on fire. ,5|5|5_5|5|5,\nhit:869_conv:1738,2,terrified,when my car caught on fire. it was bad ,27,You wouldn't believe that's happened to me too!,5|5|5_5|5|5,\nhit:869_conv:1738,3,terrified,when my car caught on fire. it was bad ,11,Omg really! I was younger when it happened_comma_ 17.. so the entire time I just kept saying  my parents are going to kill me \" :o", "source": "empathetic_dialogues"}
{"text": "You have the right idea, we just have to work through these unfair ordeals. Sometimes if we are strong and smart enough things get better with them.", "source": "prosocial"}
{"text": "Even though you might not like it, your friend is expected to spend time with her boyfriend. If you cannot deal with it, it might be good to take a break for your friendship.", "source": "prosocial"}
{"text": "If your boyfriend is really stubborn about something that you disagree with, the solution isn't to be deceitful or to seek revenge. You should let him know that you are willing to compromise for his sake, even though you are still not satisfied. This is honest, and it will probably cause him to soften up in the future.", "source": "prosocial"}
{"text": "@ashoswai @globeandmail Muslims should be afraid of any place becoming Muslim majority than about India, looking at the condition in all Muslim majority countries now. Sunnis and Shias could not reconcile in > 1300 years. How do you expect them to tolerate the Hindus in India? #ShiaGenocide", "source": "berkeley"}
{"text": "If you are not honest about what you saw then the person who committed the assault will never be found guilty. Think about the person who was assaulted, and try to understand how important your truth is for them to get the justice they deserve.", "source": "prosocial"}
{"text": "I feel sorry for the cat. If you made it clear you didn't want to be a cat owner, the old owner shouldn't expect you to care for it indefinitely. You should give her a deadline.", "source": "prosocial"}
{"text": "Best to work backwards. The first time I went in to an actual psychological professional to get them to weigh in on my condition was due to a flashback - The only one I've ever had and frankly pretty easy to deal with, which sets the tone for me. As far as the disorder goes, I got off pretty easy. Conversation to do with specific details of child abuse caused me to tap into a repressed memory of childhood abuse which I won't go into too much detail on in a public thread, though if anyone is interested in the context, I don't mind sharing over messaging. It was like when one imagines things under their own control - Conjuring images and sounds at will while still experiencing reality, but it wasn't under my control.", "source": "dreaddit"}
{"text": "\", \"how about reasoning with him on that? \", \"it's understandable that he is threatened by your new friendships with other women and he handles it by getting angry\"... I am not being critical but I really don't think my therapist knows how to handle what I'm dealing with. I said to him yesterday, \"how can I sit down and have a rational conversation with someone i don't feel safe around at times?\" Have others experienced therapists who weren't helpful, or who coached you to behave in ways that would work with someone who was not abusive, and possibly put you in more danger?", "source": "dreaddit"}
{"text": "It would be unfair of you to not bring food and take advantage of other's food. If I were you, try to ignore the people who are making fun of your cooking or at least confront them that what they're doing is not nice.", "source": "prosocial"}
{"text": "I understand that you work a lot but it's not acceptable to expect your wife to do all of the housework. Couples should split the housework evenly.", "source": "prosocial"}
{"text": "I think that it's unfair to judge women based on their past sexual history, such as whether or not someone is a virgin. What a women has done in her past is her business, not yours.", "source": "prosocial"}
{"text": "For some reason the niece decided to call us and basically tattle on the ex for how she was living drugs etc..... we kinda already know her situation. We have custody so it's not a huge deal. Well, he invited the niece we will call her Carla  and her bf to our home for a bbq.  Well, they never left, I don't even understand how it happened but it did . Well,  after major issues with the bf we finally were able to get rid of him.", "source": "dreaddit"}
{"text": "I understand you're angry that someone hit your child. But hitting them will only get you arrested too. Just call the police and let them deal with her.", "source": "prosocial"}
{"text": "I understand that you might still be upset about what your friend did to you, but you should not hold a grudge and it will be better to forgive him. Otherwise you will start resenting them very strongly and your friendship might be ruined. You should talk to them about what happened and clear the air.", "source": "prosocial"}
{"text": "I just want to inform you that cheating in a game that involves gambling can invite a lot of bad blood. Winning money unfairly can cause a lot of bitterness, so why not just keep playing to increase your skill and beat them in a legitimate way?", "source": "prosocial"}
{"text": "It's good that you want to have a good job and secure a career from it as it is important to be financially responsible. However, you should not want to aim for a job that pays a lot for very little work as that would be unfair to others. If you want to have a well-paying job and lucrative career you should be prepared to work hard and be productive otherwise you would be taking advantage of your employer.", "source": "prosocial"}
{"text": "It is understandable to want to spend time with your boyfriend, but it is unreasonable to expect him to avoid spending time with his parents just for you. You have to understand that he needs to see his parents as well as you.", "source": "prosocial"}
{"text": "You can't characterize an entire race's worth based on the darkness of their skin. All people are individuals and all people are beautiful and equal. It's unfair to harshly criticize others based on their appearance and say that they are inferior.", "source": "prosocial"}
{"text": "This probably sounds super lame but I'm really, really proud of myself. I feel like this was a huge step in healing from my trauma and allowing myself to exist beyond what happened to me as a kid. I feel like one of the reasons why I felt so comfortable was because we talked a lot about boundaries and stuff beforehand, and I mentioned that I'd been sexually assaulted in the past and that I might need to stop if I start freaking out, and she was really understanding and sweet and always really communicative. Stephanie and I both agreed that we should definitely go on a second date. I'm just really happy and gay and proud of myself and Stephanie is really cute that is all", "source": "dreaddit"}
{"text": "They receive death threats because they are anti American. Has nothing to do with Trump. Play the shir were the clearly state they hate America and its values. They are Muslim and want sharia law to rule the land!", "source": "berkeley"}
{"text": "If you are annoyed by the phone calls then ignoring them is perfectly fine. You have no obligation to deal with pushy sales people.", "source": "prosocial"}
{"text": "This is a harsh statement and it is not fair to think that all black men do not have any worth. If  you educated yourself about what black people have experienced throughout history, you would gain a greater understanding of their culture and not feel so harshly about them.", "source": "prosocial"}
{"text": "I think it's really unfair and offensive to claim that Muslim people worship a prophet that was a pedophile. Spreading that notion around hurts Muslim people as it creates a lot of hate and disgust for their religion. If you think that Muhammad was a pedophile, I think it would be worthwhile to talk with an Islamic scholar and have your concerns about Muhammad's character assuaged.", "source": "prosocial"}
{"text": "Not all women are bad drivers! It is unfair to generalize that all females are bad drivers.", "source": "prosocial"}
{"text": "It is sexist and unfair to men to think that showing emotions is not masculine. Everyone has feelings, and should be free to express them.", "source": "prosocial"}
{"text": "Nothing to see here folks, just stay seated and remain calm.... we are the gov. and the msm, you can trust ussssssssss hisssss. Just a tiny observation but if the border wasn't an issue, then why do most automated services require pressing 1 for English and 2 for Spanish?????? why not Hungarian or French or Arabic or Chinese, etc...... just saying, a small observation, not racism just a little observation. Not a problem ordering a pizza but my local gov. wtf?!?!?!", "source": "berkeley"}
{"text": "If you're in a toxic situation you can't get out of, then therapy might help you get the comfort you need and come to a mutual understanding with your mom. Communication is the key to a successful relationship, so sit down and talk to your mom about this so that they understand your view.", "source": "prosocial"}
{"text": "Remember that Germany has had a long time to come to terms with the atrocities committed by the Nazis.  German society has disavowed that government, so talking to them about it now will not accomplish anything.  If there are other issues that are bothering you, you should talk about them with the people involved.", "source": "prosocial"}
{"text": "Sister kicked off because she wanted to come to. It was a couple type thing and all of us were bringing a SO or a friend (if one of us didn’t have a partner) even if it wasn’t, I would have just wanted it to be Harry. As I don’t want his sister clinging on to us every single time. Harry asked me if she could come too because “it so unfair that you are isolating her like this.” I stood my ground and said that please can he just come. He said no.", "source": "dreaddit"}
{"text": "I'm glad you think that, but it's still unfair to generalize about an entire race of people. White people have added so much to human culture like science and mathematics, literature and art.", "source": "prosocial"}
{"text": "Taking advantage of the homeless to play a prank is really unfair them. You should be more accepting towards people that are not as well off as you. Learning about things you could do it to help them out will make you a better person and educate yourself more on the disadvantages they go through.", "source": "prosocial"}
{"text": "While you are at work, it's expected that you remain professional and have a good working relationship with others at the company. Trying to get your coworker in trouble and get fired is wrong since it impacts his or her ability to earn a living and will significantly harm his finances if you are successful. Instead of sabotaging your coworker's career, talk with him or her about the issues you have and seek a peaceful compromise that will benefit everyone.", "source": "prosocial"}
{"text": "I think it is unfair to make such a generalization about Koreans and them being idols. It's not right to have an idol or to try and think they are a certain way. I believe you should respect people and who they are and not really make fun of them in anyway.", "source": "prosocial"}
{"text": "I had a moment earlier when I was setting up for the night that I kinda, realized that life hasn't quite gone to plan, huh? [Handy dandy storage box! Nobody questions someone carrying an awkwardly large <url> Anyway, my bedroll is one of the only real constants in my life at the moment, and I kinda wanted to share it. I'd imagine that for others who are in less than ideal situations that your bedroll, or whatever sleeping arrangement you have is in some way special to you--anyone else wanna share what bed looks like for you tonight?", "source": "dreaddit"}
{"text": "Never share a fetish with someone without implicit permission. Sharing something that personal is a surefire way to have your boyfriend lose all trust in you.", "source": "prosocial"}
{"text": "You shouldn't expect everyone to be receptive to your beliefs. If someone doesn't want to accept your gift you should be understanding and respect their decision. Otherwise they may feel like you're forcing your faith on them.", "source": "prosocial"}
{"text": "I wish they had gotten the boat. That would have been fair. REMEMBER THIS: The only thing that IRAN did that caused this was abandon the US dollar. That's the only thing they did. EVERYTHING ELSE started with US And UK as the BAD GUYS. We rolled those people in 1953.... We STOLE their democracy. WE STOLE their OIL... LEAVE IRAN ALONE. JUST PULL BACK 1000 miles... This will all stop. THEY DID NOT START THIS. Despite what the \"news\" tells you. They are all chomping at the war bit now... Our military contractors are smacking their lips.", "source": "berkeley"}
{"text": "It's understandable that you are feeling burnt out as your family's technical support person. They need to call a professional and not unfairly depend on you, especially when you aren't being compensated. You should speak to them about this before it ruins your relationship.", "source": "prosocial"}
{"text": "@OutlawMike1 @1019dotty Agreed. HE was the most divisive, racist president we've ever had.", "source": "berkeley"}
{"text": "Calling someone in a different political party a triggered shows a lack of creativity in identifying a way to disagree with someone politically. Words matter, and we can use them carefully to express how we feel and then we might actually find ways to understand each other's positions, perhaps even advance our own perspectives.", "source": "prosocial"}
{"text": "It is bad to judge people with out knowing them first. You might miss out on a lot of opportunities if you judge people unfairly.", "source": "prosocial"}
{"text": "Well, that's fair, I guess. If he is playing too many games and his grades are affected, then I think you are right and should ban gaming. Tough love is sometimes required.", "source": "prosocial"}
{"text": "+Liz Samaroo what's so hard to understand? I respect the fact that he wants to identify as a female, but that doesn't mean that I'm going to identify him that way. Everybody has the right to there own opinion, I gave mine, you disagree. You gave yours and I disagree. I still respect your opinion but I'm not going to change mine. And gave my condolences and prayers to the family. That's all that matters.", "source": "berkeley"}
{"text": "Okay now I understand... COMPLETELY! I deal with that daily! I am ready to give up on ever cleaning again.", "source": "empathetic_dialogues"}
{"text": "It's understandable that you would want your roommate to fulfill his rent obligations. You should consider what is best for everyone and make the most responsible choice.", "source": "prosocial"}
{"text": "If I go to an interview for example, I'll know that I'm a good candidate, I'll know that if I don't get it there will always be other opportunities and it's no big deal. Yet I still get nervous because it's something that I want, I want that employer to like me. If I go to an interview with no expectations at all, not even wanting the job (I've done this a few times for practice interviewing), it'll turn out great. What are your thoughts on this? Edit: FYI I'm talking mostly about social anxiety, though it has happened that I get anxiety in the most random places like just going upstairs in a building.", "source": "dreaddit"}
{"text": "He explained that he didn’t think it was such a big deal that he disclosed such personal information about me without my permission to his friends then he tried to flip it and said it was no different then a time I canceled plans with a friend and told them the reason was because he, Tom was sick with the flu and I was going to stay in and take care of him. How is me honestly explaining that the reason I would have to cancel on a friend because my boyfriend is sick, the same as him giving away very detailed information about our sex life plus other very personal traumas that I experienced without my permission? I feel like he’s trying to gaslight me and I’m seeing a side to him I’ve never seen. I’m honestly thinking about ending things with him over this. TL;DR my boyfriend told his friends VERY detailed information about our sex life plus other personal things about my life without my permission and I feel so betrayed but he’s trying to act like it’s no big deal.", "source": "dreaddit"}
{"text": "Well that's certainly understandable, but isn't a bit unfair to be mad at him for not getting a vasectomy when you clearly haven't gotten a tubal ligation? You would be in total control of that decision.", "source": "prosocial"}
{"text": "It's a gross stereotype that welsh folk commit beastiality. I'm sure you can understand that what you just said could be considered hurtful.", "source": "prosocial"}
{"text": "I understand how you feel. It's good to take pride in your accomplishments, even if in a trivial way. Marking off the chores that you have finished will give you a clear representation of the progress you have made and the work that you still have to do.", "source": "prosocial"}
{"text": "@b77_sarah @mark_selby723 So the American taxpayer and/or other American citizen patients of that hospital will pay the medical bills for a criminal, . . with NO respect for American sovereignty or rule-of-law. Anyone falling off our American border wall should be drug back on Mexico's side. . URL", "source": "berkeley"}
{"text": "Last summer I (F17) was officially diagnosed with PTSD, though I had been suffering from the condition for at least a decade. It's been a lot to process but I'm finally getting the psychiatric attention and emotional support I need to slowly repair myself. I remember after I had explained my traumas and symptoms to my current therapist, I asked her if I it was true that I had something wrong with me (my psychiatrist had told me the week prior that much of what I was experiencing aligned with the PTSD diagnosis and I was startled). I'll never forget her saying \"No, you definitely have PTSD,\" and in that moment I experienced more validation of my suffering then I had in my entire life. Shell shocked, I told my mom about it in the car and she made it very clear to me how there was no way in her mind that it could be that serious.", "source": "dreaddit"}
{"text": "I have been able to catch up a little bit on my rent that was behind with my income tax return, but I am still striving to catch up completely while I try to find part time work that I can perform. I am unable to work gainfully and I was denied Social Security Disability on the first two levels and have on 12/1/2017 filed for a hearing before a Administrative Law Judge. This is not expected to happen for over a year as the system is back logged and understaffed. In 2000, when I was 23, I was diagnosed with Multiple Sclerosis. Multiple Sclerosis a chronic, typically progressive disease involving damage to the sheaths of nerve cells in the brain and spinal cord, whose symptoms may include numbness, impairment of speech and of muscular coordination, blurred vision, and severe fatigue.", "source": "dreaddit"}
{"text": "It's understandable to not always be able to afford to buy someone a gift, but you should still make sure whatever you give is in working condition. It sounds like the jeans may not even be usable with the state they are in. The gesture was nice, but make sure the gift you give can actually be used.", "source": "prosocial"}
{"text": "Our only solution is to deport 100% of illegal immigrants. We need to get rid of the requirement that all illegal aliens get to fight deportation in court and charge them with a CRIME (which it is a crime to enter illegally). We need to charge EVERY crime they commit, from illegal entry to immigration fraud to identity theft to forgery of a government document to to to... Lock 'em up and then deport them upon completion of their sentence.", "source": "berkeley"}
{"text": "{\"experience_type\": \"Current Experience\", \"emotion_type\": \"disgust\", \"problem_type\": \"Procrastination\", \"situation\": \"I keep procrastinating cleaning, doing crafts, etc, stuff that I want to do and to get done, but that I seem to be unmotivated to do.   It's frustrating.\", \"survey_score\": {\"seeker\": {\"initial_emotion_intensity\": \"4\", \"empathy\": \"5\", \"relevance\": \"5\", \"final_emotion_intensity\": \"3\"}, \"supporter\": {\"relevance\": \"5\"}}, \"dialog\": [{\"text\": \"hi\", \"speaker\": \"usr\"}, {\"text\": \"anyone there?\", \"speaker\": \"usr\"}, {\"text\": \"yes, hello how are you today?\", \"speaker\": \"sys\", \"strategy\": \"Question\"}, {\"text\": \"hi, I am okay, but am very frustrated at how often i procrastinate stuff i need to or want to do\", \"speaker\": \"usr\"}, {\"text\": \"it's hard to even get started sometimes, i think it's pandemic frustrations\", \"speaker\": \"usr\"}, {\"text\": \"I understand how you feel, I also procrastinate...I have found if it takes less than 2 minutes to do it, I go ahead and do it, it takes some of the stress off.\", \"speaker\": \"sys\", \"strategy\": \"Self-disclosure\"}, {\"text\": \"hmm so you prioritize the quick tasks?\", \"speaker\": \"usr\"}, {\"text\": \"this pandemic most definitely has caused frustrations for everyone\", \"speaker\": \"sys\", \"strategy\": \"Affirmation and Reassurance\"}, {\"text\": \"yes, it makes the list of things to do a little shorter and not as overwhelming\", \"speaker\": \"sys\", \"strategy\": \"Others\"}, {\"text\": \"i think when I can GO places to do things with other people it will be easier to be motivated/active\", \"speaker\": \"usr\"}, {\"text\": \"i have tried breaking jobs down into smaller tasks that does help, you're right on that\", \"speaker\": \"usr\"}, {\"text\": \"but it breaks my heart that i have not touched my art and sewing! i had all this \\\"extra\\\" time over this past year, and couldn't crack into it\", \"speaker\": \"usr\"}, {\"text\": \"have you any other ideas?\", \"speaker\": \"usr\"}, {\"text\": \"of course! i got into puzzles...and games with my little one helped pass the time\", \"speaker\": \"sys\", \"strategy\": \"Affirmation and Reassurance\"}, {\"text\": \"also, taking walks gets you that breath of fresh air that is sometimes needed\", \"speaker\": \"sys\", \"strategy\": \"Providing Suggestions\"}, {\"text\": \"i live alone, but have played some online games with my sis. Walks are good but I can't walk with my friends (we are on a stay at home order presently) and I find it hard to motivate myself when it's just me\", \"speaker\": \"usr\"}, {\"text\": \"but i agree walks are really helpful, when i get out i really enjoy them. Okay that gives me some good things to try out, thank you for your help today\", \"speaker\": \"usr\"}, {\"text\": \"i understand that.\", \"speaker\": \"sys\", \"strategy\": \"Others\"}, {\"text\": \"where are you located?\", \"speaker\": \"usr\"}, {\"text\": \"anytime, hope you stay well\", \"speaker\": \"sys\", \"strategy\": \"Others\"}, {\"text\": \"united states- louisiana\", \"speaker\": \"sys\", \"strategy\": \"Self-disclosure\"}, {\"text\": \"Im in ONtario CAnada....thank you, you too!\", \"speaker\": \"usr\"}, {\"text\": \"bye for now.\", \"speaker\": \"usr\"}, {\"text\": \"bye!\", \"speaker\": \"sys\", \"strategy\": \"Others\"}, {\"text\": \"oh one other thing...I have made SOME progress on the cleaning...so I need to remind myself that I did good lol\", \"speaker\": \"usr\"}], \"seeker_question1\": \"being limited in subject areas for our \\\"issue\\\"\", \"seeker_question2\": \"\", \"supporter_question1\": \"I didnt like how i had to chose what i was using to send the message\", \"supporter_question2\": \"na\"}", "source": "esconv"}
{"text": "It is understandable to be mad when your boss takes the praise for your hard work and achievements, but you work for the company. You are expected to work hard and your achievements are the company's achievements.", "source": "prosocial"}
{"text": "I just got a small job offer from a friend of mine who works prepping dessert plates at a restaurant, and well I agreed to try it out but I feel so anxious. This happens every time I look for jobs and they actually want to hear of me. I don’t know why, the whole process just feels like my embarrassment on display and I’m afraid to commit myself to working part time due to this. It’s nothing hard yet I feel so ashamed when I tell my family and partner that I didn’t simply like the job or feel like it’s demanding too much of me atm. It’s like getting a job takes so much from me atleast socially.", "source": "dreaddit"}
{"text": "I really don't want to sound like a bigot, but just understand that's not my heart on this.  Extremely feminine men and extremely masculine women make me feel uncomfortable. I think it's built out of a perspective of gender norms and expectations, and when those are broken I feel almost as if I'm witnessing a person in disguise. It's really hard to get that perspective out of my head.", "source": "berkeley"}
{"text": "I understand that you are scared of raves based on your past experiences, but you are interfering with your bf when you don't want him to go to one. Deal with your own issues internally rather than trying to control others around you externally.", "source": "prosocial"}
{"text": "I haven't posted here yet, but as everyone here has probably experienced, PTSD is one of the most isolating conditions. Even as an adult surrounded by other adults at school, I feel so isolated. It's really disappointing that other students in my class can't seem to grasp the concept of PTSD in people who aren't veterans. There is a fundamental lack of understanding that has resulted in further alienation. For some reason, dissociations in sufferers who are not former military is unacceptable.", "source": "dreaddit"}
{"text": "> Where do we disagree on the term logos? The Torah / Word defines God's logos. it's less a sense of \"torah\" instruction, and more a platonic form of rationality. > How do you interpret John 1:1? that john thinks jesus was the incarnation of philo's coming messiah, who would be the logos. > Many twist Paul.  i don't think i am. paul clearly thinks jews are still held to the law, but that christians do not have to convert judaism. christians are outside the law by merit of ancestry.", "source": "berkeley"}
{"text": "Someone who really wanted them should have won the lessons. A lot of people who can't afford things have to enter contests to get services, it is unfair to cheat them.", "source": "prosocial"}
{"text": "WARNING: IF MY PEOPLE WHO ARE CALLED BY MY NAME WILL HUMBLE THEMSELVES AND PRAY AND SEEK MY FACE AND TURN FROM THEIR WICKED WAYS THEN I WILL HEAR FROM HEAVEN AND I WILL FORGIVE THEIR SIN AND WILL HEAL THEIR LAND. BABIES BLOOD IS CRYING OUT FROM THE GROUND, FALSE ACCUSATIONS AGAINST THE PRESIDENT, DISRESPECT MEN WITH MEN WOMEN WITH WOMEN, FORNICATORS, FOWL MOUTHS...ETC A NEW GREEN DEAL WILL NOT HELP YOU, ONLY HUMILITY AND REPENTANCE WILL GOD HEAR. AMERICA IN GOD WE TRUST WE ARE THE PEOPLE CALLED BY HIS NAME. STOP KILLING OUR BABIES BAN ABORTION. WE NEED TO REPENT FROM OUR WICKED WAYS.", "source": "berkeley"}
{"text": "Segregating races to their own neighborhoods creates all kinds of issues for racial tensions. When people are intentionally placed apart it can create feelings of unfairness and resentment. It's best for races to exist and interact among themselves in order to learn from one another.", "source": "prosocial"}
{"text": "If you tell your wife what to do too much then you're going to upset her and start a fight. Do you want to deal with that when instead you could just come up with a compromise? Like maybe visit when you are not home.", "source": "prosocial"}
{"text": "I can understand you are young and you think you can do whatever you want, but there are rules there for a reason. You should not deceive someone with a fake ID. Be honest with others and your dealings with them.", "source": "prosocial"}
{"text": "Not all of them are Nazi's though, and I believe it's unfair of you to judge them as a whole. Also if I were you I wouldn't tell the story again.", "source": "prosocial"}
{"text": "Joking about Jews either way like that is still hurtful and unfair to all of their struggles. While there are dark jokes, there is always a line to never cross and capitalizing on the burning deaths of millions and their wealth is not funny. There are better more friendly jokes you can do, and it's best to consult a Jew to figure out what is acceptable to joke about.", "source": "prosocial"}
{"text": "3. I leave fairly often for extended periods for work. On one of my work trips I was gone for two weekends. I trust my BF and don’t mind if he goes out. The first weekend he said he didn’t do anything and just stayed home, yet through my friend’s FB I could see that he added three girls as friends.", "source": "dreaddit"}
{"text": "It's understandable that you disagree with how the government should spend tax payers money, everyone has a choice in what they would vote for. Having your own political beliefs is acceptable.", "source": "prosocial"}
{"text": "Athletes are great no matter what their gender is. Their sport and achievement should be applauded, not their bodies. It's unfair to all the women who want to be recognized for their merit but are just reduced to their body and sex. Objectification is not fun, and you can miss out on lots of great events if you only think their physical appearance matters.", "source": "prosocial"}
{"text": "I understand there have been some issues with your in laws in the past. You don't have to force a relationship between them and your son if you don't want to. Let your son spend time with people who want to be in his life instead, and this will not harm either party.", "source": "prosocial"}
{"text": "I'm just blown away by this doctor's willingness to help. I feel so validated every time I leave his office, like someone actually understands what I'm struggling with, and I don't have to convince them of my mental illness. Bottom line? Research docs if you can online, read their reviews and don't give up until you find someone who treats you the way you deserve. If I can do this, I promise you can!", "source": "dreaddit"}
{"text": "If they are committed to the relationship and care about you, then they will understand your point of view. Relationships are built on respect and if she shows she understands you, then you two will feel even more connected.", "source": "prosocial"}
{"text": "That's understandable. Next time make it absolutely clear that you do not want him wearing your shirts.", "source": "prosocial"}
{"text": "If you can't fulfill your responsibility of taking care of the cat then by all means, get her to pick up her cat. However, you shouldn't make commitments and no follow through with them. You knew you didn't like cats and were allergic so you shouldn't have agreed to watch the cat in the first place.", "source": "prosocial"}
{"text": "I can understand your need for something that is addicting. You are expected to act professionally at work and not to do something that will get you in trouble. You should start taking those breaks outside.", "source": "prosocial"}
{"text": "I understand that it's your opinion, but I don't think it's a fair opinion to have. Taking away a woman's right to make her own decisions isn't going to fix the problems that she faces.", "source": "prosocial"}
{"text": "I agree, and if he can't deal with you getting a tattoo then it may be time to reevaluate your relationship with him. It's important to have a partner that is respectful of the choices you make with your body. If your partner thinks they can dictate whether you get a tattoo, they may have control issues.", "source": "prosocial"}
{"text": "{\"experience_type\": \"Current Experience\", \"emotion_type\": \"depression\", \"problem_type\": \"academic pressure\", \"situation\": \"crippling homework and procrastination i cant keep up in class\", \"survey_score\": {\"seeker\": {\"initial_emotion_intensity\": \"4\", \"empathy\": \"5\", \"relevance\": \"5\", \"final_emotion_intensity\": \"2\"}, \"supporter\": {\"relevance\": \"5\"}}, \"dialog\": [{\"text\": \"Hi there! How can I help you today\", \"speaker\": \"sys\", \"strategy\": \"Others\"}, {\"text\": \"i cant keep up in class\", \"speaker\": \"usr\"}, {\"text\": \"I'm so sorry to hear that. How does that make you feel?\", \"speaker\": \"sys\", \"strategy\": \"Question\"}, {\"text\": \"like crap, it makes me not wanna do anything\", \"speaker\": \"usr\"}, {\"text\": \"I understand completely, it can be hard to keep up in class especially if you're feeling down\", \"speaker\": \"sys\", \"strategy\": \"Affirmation and Reassurance\"}, {\"text\": \"To be clear, you're feeling bad about not being able to keep up in class and that's making you feel even worse about it?\", \"speaker\": \"sys\", \"strategy\": \"Reflection of feelings\"}, {\"text\": \"yeah, like I want to start doing better but then i realize theres just no point im already behind\", \"speaker\": \"usr\"}, {\"text\": \"Don't worry, that's totally normal, especially since a lot of things are online these days. I personally struggled with keeping up with courses, but I found a way to make it work by pushing to the limits\", \"speaker\": \"sys\", \"strategy\": \"Self-disclosure\"}, {\"text\": \"okay, i guess its good to know im not the only one\", \"speaker\": \"usr\"}, {\"text\": \"how did you get thru it?\", \"speaker\": \"usr\"}, {\"text\": \"I suggest starting with what you missed first instead of worrying what you're getting now\", \"speaker\": \"sys\", \"strategy\": \"Providing Suggestions\"}, {\"text\": \"Maybe let your teacher/professor know how you're doing in class and you may be able to ask for extensions on deadlines\", \"speaker\": \"sys\", \"strategy\": \"Providing Suggestions\"}, {\"text\": \"Thats helpful, thanks\", \"speaker\": \"usr\"}, {\"text\": \"i am a little scared to ask my teacher though\", \"speaker\": \"usr\"}, {\"text\": \"shes really mean and what if she fails me?\", \"speaker\": \"usr\"}, {\"text\": \"Don't be afraid! Remember a teacher's job is to teach and help you, she may look a little mean but it doesn't hurt to try and ask, she can't fail you for being confused :)\", \"speaker\": \"sys\", \"strategy\": \"Affirmation and Reassurance\"}, {\"text\": \"yeah i guess your right\", \"speaker\": \"usr\"}, {\"text\": \"Does that make you feel a little better about it?\", \"speaker\": \"sys\", \"strategy\": \"Question\"}, {\"text\": \"yea, a lot better actually, thanks\", \"speaker\": \"usr\"}, {\"text\": \"You're welcome! Anything else I can help out with?\", \"speaker\": \"sys\", \"strategy\": \"Question\"}, {\"text\": \"what should i do about the work i missed?\", \"speaker\": \"usr\"}, {\"text\": \"hmm, i suggest you should ask your teacher if its still alright to submit it. If you decide to do them, make sure its ok with her first\", \"speaker\": \"sys\", \"strategy\": \"Providing Suggestions\"}, {\"text\": \"okay, thanks, i will do that\", \"speaker\": \"usr\"}, {\"text\": \"No problem! Glad I was able to help! Is there anything else?\", \"speaker\": \"sys\", \"strategy\": \"Others\"}, {\"text\": \"no thats all, thanks again for helping me\", \"speaker\": \"usr\"}, {\"text\": \"you're welcome, goodbye!\", \"speaker\": \"sys\", \"strategy\": \"Others\"}], \"seeker_question1\": \"\", \"seeker_question2\": \"\", \"supporter_question1\": \"took a while to match\", \"supporter_question2\": \"\"}", "source": "esconv"}
{"text": "I debated for ten minutes what I should do. I didn't want to open the message completely and violate her trust that far, so I woke her up (which was a big decision because she loves sleep and has two tests today - I know I'm an asshole but she understands and doesn't want me going crazy while she sleeps), and yeah. That was that. She told the guy she was in a relationship (who doesn't check relationship status on Facebook ffs? ), and thanked him for creating a shitstorm.", "source": "dreaddit"}
{"text": "Yes, that's why I'm confused. Last I heard, the Three-fifths Compromise was overruled back in 1868. It's hurtful to perpetuate these negative racial stereotypes against blacks.", "source": "prosocial"}
{"text": "The problem isn't that you might be caught, it's that you are planning on committing arson in the first place. I have to urge you to no longer even think about doing this. Even if you manage to get away, I would still be obligated to report what you have told me.", "source": "prosocial"}
{"text": "It's understandable to obligations that need to be fulfilled, but its good to put your family first. They may end up feeling like you can't be there for them during special occassions.", "source": "prosocial"}
{"text": "Being lesbian is a sexual preference and it should not be used to associate it with poor hygiene. Anyone can choose to be dirty or have poor hygiene just like me and you. It has nothing to do with sexuality so it's unfair to say lesbian are dirty people.", "source": "prosocial"}
{"text": "That's an understandable response to trauma. You should talk to a therapist who can help you confront your trauma and develop behaviors to deal with it that are more healthy for you.", "source": "prosocial"}
{"text": "It seems unfair to believe that black people could not be Irish. How would you feel if someone said you couldn't claim to be your own nationality?", "source": "prosocial"}
{"text": "Man, I'm Latino and had married a Pakistani. I think that's a much wider cultural divide, but we were able to bridge it. It just takes mutual understanding, respect, and (in some cases) standing up to your family.  If your mother doesn't want to get along with this woman because she's Bengali, your mother is making a conscious choice. You have to love and respect your mother, but she's totally wrong with the idea that your cultures are incompatible or something. Bengalis are also delightful.", "source": "berkeley"}
{"text": "I am writing on behalf of my friend and colleague (with his permission) who has watched his daughter Laney steadily deteriorate after suddenly suffering massive strokes due to a disease known as Moya Moya, which is where the body tries to compensate for inadequate bloodflow to the brain by sending capillaries that invariably burst. She is now in terminal condition and the family is facing a staggering mountain of medical bills. The icing on the cake is that the onset of the strokes occured while Laney's mom was 8 month's pregnant. The last year and a half has been horrific. I've posted the [link to a GoFundMe <url> started by Laney's Godmother in the hopes that there may be some of you who would like to contribute.", "source": "dreaddit"}
{"text": "I have an appointment with a paralegal to draw up a separation agreement. When I tell him I want and am filing for a separation and divorce, he will ask why. Do I mention to him about finding the extent of their chats and the cellphone bills? What about the disappearing IM accounts? Or do I just leave it at \"You had an affair, you aren't being completely honest with me about it, I feel like this 'reconciliation' we are experiencing is just me being strung along till you get your pieces in place to leave.", "source": "dreaddit"}
{"text": "{\"experience_type\": \"Previous Experience\", \"emotion_type\": \"nervousness\", \"problem_type\": \"academic pressure\", \"situation\": \"About to take a licensure exam for my field. I get 1 try a year to pass at a 90% rate. I deal with a lot of test anxiety and the current COVID-19 crisis has amplified my worries. How can I put myself at ease in the testing center and ace this exam?\", \"survey_score\": {\"seeker\": {\"initial_emotion_intensity\": \"4\", \"empathy\": \"5\", \"relevance\": \"5\", \"final_emotion_intensity\": \"1\"}, \"supporter\": {\"relevance\": \"5\"}}, \"dialog\": [{\"text\": \"Hello I am here to help you, what's your problem?\", \"speaker\": \"sys\", \"strategy\": \"Question\"}, {\"text\": \"I have a licensure exam coming up that I must pass at a 90% score. I have dealt with test anxiety all my life (mind goes blank, difficulty concentrating with noise) and I have to take my exam in a testing center around other people next week. I am extra worried due to COVID. This is a 6 hour exam - what are ways I can calm myself at the exam and succeed?\", \"speaker\": \"usr\"}, {\"text\": \"First of all, you can bring some snacks and water. having an empty stomach will distract you from the exam\", \"speaker\": \"sys\", \"strategy\": \"Providing Suggestions\"}, {\"text\": \"If you were about to take the most important test of your life (ha!) what would you suggest I do to organize my review the days before the exam? Do you have any study suggestions that have worked for you?\", \"speaker\": \"usr\"}, {\"text\": \"I have been in that situation many times. From my own experience, yes you should review as much as you can. However, relax the last 2-3 days to not overwhelm yourself. You should also do image training, imagine yourself in the test room, plan ahead what you will do like write your name, open the exam booklet...\", \"speaker\": \"sys\", \"strategy\": \"Providing Suggestions\"}, {\"text\": \"You give good advice, how have you grown into a calm, cool person? :) What obstacles did you have to overcome to get to this level of chill?\", \"speaker\": \"usr\"}, {\"text\": \"It takes alot to grow into that kind of person, I'm not there yet. I find it vital to understand this, you cannot control everything. As long as you try your best, whatever the outcomes are, they all serve a purpose. When one door closes, the others will open\", \"speaker\": \"sys\", \"strategy\": \"Self-disclosure\"}, {\"text\": \"That is really helpful advice. I think part of my problem is that I still think I can control every detail and need to learn to let things happen once the ball is in motion. For an exam, I want to do so well because so much is riding on it and that freezes me into trying to control for all outcomes... when really, I can only control myself.\", \"speaker\": \"usr\"}, {\"text\": \"You are right, I also want to be in control of my life. However, as I grow older, I realize that is impossible. Whenever you feel stressed over life issues, I would recommend taking a walk in the park or anywhere with a lot of trees to clear you mind\", \"speaker\": \"sys\", \"strategy\": \"Affirmation and Reassurance\"}, {\"text\": \"I will definitely arrive early to the test center and walk the campus before going in. Get enough to eat beforehand and bring my snacks so I can focus just on the exam. I'm writing all of this down so I don't forget. It is a shame we can't save the chat.\", \"speaker\": \"usr\"}, {\"text\": \"Thank you for being my peer-supporter, today. You have been a huge help!\", \"speaker\": \"usr\"}, {\"text\": \"sounds like a great plan, i believe you will do well\", \"speaker\": \"sys\", \"strategy\": \"Others\"}, {\"text\": \"Is there anything I can help you with?\", \"speaker\": \"sys\", \"strategy\": \"Question\"}, {\"text\": \"Do you have any ideas on what I should about sanitizing my workstation at the exam center? I will be around other people and someone will have used my computer before me. I don't think they are cleaning the stations before the next user.\", \"speaker\": \"usr\"}, {\"text\": \"Buy some alcohol wipe, you can find it at the grocery store, make sure to come in early enough to do that\", \"speaker\": \"sys\", \"strategy\": \"Providing Suggestions\"}, {\"text\": \"Alright. I think the proctors will allow it as long as I don't have a bulky bag with me. Maybe some I can just slip into my pocket. Anything too fussy might be cause for them thinking I am bringing answers in with me. I don't have much else to ask about, these were my main concerns.\", \"speaker\": \"usr\"}, {\"text\": \"I believe they sell individual packs of 10 wipes too.Good lick with your exam!~\", \"speaker\": \"sys\", \"strategy\": \"Others\"}, {\"text\": \"Thanks to your help, I believe I will do well next week. :)\", \"speaker\": \"usr\"}, {\"text\": \"Maybe you should be a counselor, if you aren't already. :)\", \"speaker\": \"usr\"}, {\"text\": \"I would love to do that, I like talking with people and listen to their stories\", \"speaker\": \"sys\", \"strategy\": \"Self-disclosure\"}], \"seeker_question1\": \"I wish I could have had a better flow of conversation, being restricted on taking a certain amount of turns when the problem was addressed quickly was annoying.\", \"seeker_question2\": \"Maybe choose 10 turns OR 15 minutes?\", \"supporter_question1\": \"\", \"supporter_question2\": \"\"}", "source": "esconv"}
{"text": "It doesn't matter what type of person she is, it is still bad to cheat on others. I can understand it takes two people to have an affair, but you should be the bigger person and say no.", "source": "prosocial"}
{"text": "I think if they can't respect your wishes you should just quit after you are done watching the kids. It is really unfair that they put you in such a bad position and their kids cant behave themselves.", "source": "prosocial"}
{"text": "She approached me and started to say something but I interrupted saying, “If this is about my phone, I am under no obligation to share with you anything that is spoken between me and a therapist, and I do not care that this is during work, I have an emergency number to call at any time when I feel like I have to, and I felt like this was important as I don’t want to go back to the psych ward.” She stopped and just said “oh, ok sorry.” I understand that this may be a negative on my performance at work, and I may not be entirely right, but I have cut myself at work (not during work but after shift and right outside at my car) and the way I was feeling I needed emergency counseling. I have tried to have a conversation with her before about how I was feeling, but it didn’t go so well since she felt like I was being rude, so while I am open to trying again, I want to know how I should go about it again and/or should I get the manager involved? Thank you for reading and I appreciate any and all responses.", "source": "dreaddit"}
{"text": "It is rude to talk about your family this way. Isis is horrible and they kill innocent people, it is unfair to claim your sister is doing the same.", "source": "prosocial"}
{"text": "I think he will learn that you cannot be trusted and that he should call the police. If they find you in his home without his permission, you could go to jail.", "source": "prosocial"}
{"text": "I am a woman and I do not believe abortion is a woman's right, I do not believe it is a woman's right to kill her own flesh and blood, I am sick and tired of the argument always being that men want to make the rules about women's bodies, there are a lot of women who feel the same way. Oh and it was a woman that actually signed this into law, conveniently left that out... Get a better argument please!", "source": "berkeley"}
{"text": "I definitely understand why you're quitting. Your boss is clearly a rude person. I fully support your decision to look for a new job.", "source": "prosocial"}
{"text": "It's not fair to hate someone because they don't want to get romantically involved with you. You can't expect everyone to be attracted to you.", "source": "prosocial"}
{"text": "You should be on more friendly terms with your father. If he is yelling at you, you should let him know that he is acting badly towards you. Try to communicate with him and reach an understanding with each other to establish a better relationship.", "source": "prosocial"}
{"text": "I understand that you have finally come to the terms with his consequences, but he is still your family and he needs as much support and goodbyes as he can take in his final moments. If not for him, why not be there for the rest of your family?", "source": "prosocial"}
{"text": "It's understandable to want to keep a gift. Instead try taking to the person who wants them back and explain to them about how you feel its unfair for them to want the gift back.", "source": "prosocial"}
{"text": "I just found out I am pregnant after years of trying!,5|5|5_5|5|5,\nhit:7846_conv:15692,2,joyful,I just found out I am pregnant after years of trying! I've had so many disappointments but it's finally happened!,478,That's really great! I'm so happy for you!,5|5|5_5|5|5,\nhit:7846_conv:15692,3,joyful,I just found out I am pregnant after years of trying! I've had so many disappointments but it's finally happened!,99,Thank you! I've had so many disappointments but it's finally happened! I couldn't be happier.,5|5|5_5|5|5,\nhit:7846_conv:15692,4,joyful,I just found out I am pregnant after years of trying! I've had so many disappointments but it's finally happened!,478,Well I think you will make a great parent. Congratulations!,5|5|5_5|5|5,\nhit:7846_conv:15693,1,trusting,I'm really gulible. I will believe anything,478,I am so gulible. I will believe anything you say.,5|5|5_5|5|5,\nhit:7846_conv:15693,2,trusting,I'm really gulible. I will believe anything,99,I have had problems with that as well. I wish I had some advice to give.,5|5|5_5|5|5,\nhit:7846_conv:15693,3,trusting,I'm really gulible. I will believe anything,478,Me too. I just have to spend a lot of time trying to figure out if someone is lying to me or not. ,5|5|5_5|5|5,\nhit:7846_conv:15693,4,trusting,I'm really gulible. I will believe anything,99,Same here. And that can be very difficult_comma_ as you know!,5|5|5_5|5|5,\nhit:7847_conv:15694,1,terrified,I stay away from the dark.,9,I stay away from the dark.,5|5|5_1|1|1,\nhit:7847_conv:15694,2,terrified,I stay away from the dark.,139,Why do you do that? Are you scared of the dark?,5|5|5_1|1|1,\nhit:7847_conv:15694,3,terrified,I stay away from the dark.,9,It makes me think of bad things.,5|5|5_1|1|1,\nhit:7847_conv:15694,4,terrified,I stay away from the dark.,139,Well that makes sense then. Good luck staying away from the dark.,5|5|5_1|1|1,\nhit:7847_conv:15695,1,angry,Every time I clean up my kids room they mess it up again within a day. I don't know why they won't just keep their room clean. I get so upset when they don't listen to me!,139,Every time I clean my kids room they go in and mess it up again. I am so ticked off at them.,1|1|1_5|5|5,\nhit:7847_conv:15695,2,angry,Every time I clean up my kids room they mess it up again within a day. I don't know why they won't just keep their room clean. I get so upset when they don't listen to me!,9,That is why you never have kids.,1|1|1_5|5|5,\nhit:7847_conv:15695,3,angry,Every time I clean up my kids room they mess it up again within a day. I don't know why they won't just keep their room clean. I get so upset when they don't listen to me!,139,Well I don't understand why they can't keep their room clean. I tell them so many times!,1|1|1_5|5|5,\nhit:7847_conv:15695,4,angry,Every time I clean up my kids room they mess it up again within a day. I don't know why they won't just keep their room clean. I get so upset when they don't listen to me!,9,I also keep my room dirty.,1|1|1_5|5|5,\nhit:7848_conv:15696,1,annoyed,It's annoying how is always scorching hot on your days off_comma_ but nice when you have to work inside all day!,448,It's annoying how is always scorching hot on your days off_comma_ but nice when you have to work inside all day!,5|5|5_5|5|5,\nhit:7848_conv:15696,2,annoyed,It's annoying how is always scorching hot on your days off_comma_ but nice when you have to work inside all day!,466,I know the feeling! What you have to do is call in sick on a day that you're schedule to go in.,5|5|5_5|5|5,\nhit:7848_conv:15696,3,annoyed,It's annoying how is always scorching hot on your days off_comma_ but nice when you have to work inside all day!,448,Haha_comma_ that's a good  idea_comma_ might have to do that one day!,5|5|5_5|5|5,\nhit:7848_conv:15696,4,annoyed,It's annoying how is always scorching hot on your days off_comma_ but nice when you have to work inside all day!,466,Let me know if it works for you!,5|5|5_5|5|5,\nhit:7849_conv:15698,1,excited,Meeting characters in Disney world!,9,I'm going to meet characters in disney world!,5|5|5_5|5|5,\nhit:7849_conv:15698,2,excited,Meeting characters in Disney world!,409,That sounds like so much fun! Is this your first time?,5|5|5_5|5|5,\nhit:7849_conv:15698,3,excited,Meeting characters in Disney world!,9,This is my first time since I was much smaller as a kid.,5|5|5_5|5|5,\nhit:7849_conv:15698,4,excited,Meeting characters in Disney world!,409,You will have a lot of fun. It really is nice there. ,5|5|5_5|5|5,\nhit:7849_conv:15699,1,impressed,A friend of mine is a writer. She put out 22 books this year! I can't believe how many she did!,409,A friend of mine is a self-published writer. She put out 22 books this year! I can't believe how many she did. ,5|5|5_5|5|5,\nhit:7849_conv:15699,2,impressed,A friend of mine is a writer. She put out 22 books this year! I can't believe how many she did!,9,That is wild_comma_ I wish i could write and make money.,5|5|5_5|5|5,\nhit:7849_conv:15699,3,impressed,A friend of mine is a writer. She put out 22 books this year! I can't believe how many she did!,409,I am also a writer. I love it ,5|5|5_5|5|5,\nhit:7849_conv:15699,4,impressed,A friend of mine is a writer. She put out 22 books this year! I can't believe how many she did!,9,Maybe i will look into it.,5|5|5_5|5|5,\nhit:7850_conv:15700,1,surprised,My friends threw me a surprise party for my birthday last year! ,292,My friends organized a surprise birthday party for me last year! ,5|5|5_5|5|5,\nhit:7850_conv:15700,2,surprised,My friends threw me a surprise party for my birthday last year! ,448,Awesome! were you surprised?,5|5|5_5|5|5,\nhit:7850_conv:15700,3,surprised,My friends threw me a surprise party for my birthday last year! ,292,I really was_comma_ I had no idea! It was a lot of fun. ,5|5|5_5|5|5,\nhit:7850_conv:15700,4,surprised,My friends threw me a surprise party for my birthday last year! ,448,That's really cool_comma_ I'm glad you were surprised and had a blast!,5|5|5_5|5|5,\nhit:7850_conv:15701,1,sad,I'm sad the weekend is almost over and I have to go back to work tomorrow!,448,I'm sad the weekend is almost over and I have to go back to work tomorrow!,5|5|5_5|5|5,\nhit:7850_conv:15701,2,sad,I'm sad the weekend is almost over and I have to go back to work tomorrow!,292,Ugh yeah same. Did you have a nice weekend though? ,5|5|5_5|5|5,\nhit:7850_conv:15701,3,sad,I'm sad the weekend is almost over and I have to go back to work tomorrow!,448,Yeah_comma_ it was very relaxing_comma_ I chilled with my girlfriend and watched a lot of netflix.,5|5|5_5|5|5,\nhit:7850_conv:15701,4,sad,I'm sad the weekend is almost over and I have to go back to work tomorrow!,292,Those kind of weekends are the best. ,5|5|5_5|5|5,\nhit:7851_conv:15702,1,joyful,My dog did great at training!,9,My dog did great at training.,5|5|5_5|5|5,\nhit:7851_conv:15702,2,joyful,My dog did great at training!,321,thats awesome _comma_ is your pet being trained at a store by chance ? ,5|5|5_5|5|5,\nhit:7851_conv:15702,3,joyful,My dog did great at training!,9,No_comma_ we have a professional doing it that works with the sheriff department.,5|5|5_5|5|5,\nhit:7851_conv:15702,4,joyful,My dog did great at training!,321,even more impressive _comma_ i hope your pet does great,5|5|5_5|5|5,\nhit:7851_conv:15703,1,excited,i saw the new resident evil 2 trailer i was pumped,321,I am a gamer and i saw all the new game trailers _comma_ i saw the trailer for resident evil 2 last night it was so awesome !!!,5|5|5_5|5|5,\nhit:7851_conv:15703,2,excited,i saw the new resident evil 2 trailer i was pumped,9,I play some games on my pc_comma_ at times.,5|5|5_5|5|5,\nhit:7851_conv:15703,3,excited,i saw the new resident evil 2 trailer i was pumped,321,what sort of games ? I used to be really into diablo 2 when i was younger ,5|5|5_5|5|5,\nhit:7851_conv:15703,4,excited,i saw the new resident evil 2 trailer i was pumped,9,I do love me some diablo 3,5|5|5_5|5|5,\nhit:7852_conv:15704,1,excited,Next week I get to visit my sister and her family. I haven't seen them in a long time. I am so excited.,139,I can't wait until next week. I get to visit my sister and her family. I haven't seen them in a while.,5|5|5_5|5|5,\nhit:7852_conv:15704,2,excited,Next week I get to visit my sister and her family. I haven't seen them in a long time. I am so excited.,478,That's awesome that you are getting to see your family again!,5|5|5_5|5|5,\nhit:7852_conv:15704,3,excited,Next week I get to visit my sister and her family. I haven't seen them in a long time. I am so excited.,139,Yeah I am so looking forward to it. I will have a blast with them!,5|5|5_5|5|5,\nhit:7852_conv:15704,4,excited,Next week I get to visit my sister and her family. I haven't seen them in a long time. I am so excited.,478,Well I hope that you have a great time!,5|5|5_5|5|5,\nhit:7852_conv:15705,1,annoyed,I get so upset when ever a telemarkter calls. I can't stand those people. ,478,I hate telemarketers. They call me all the time and I can't stand it!,5|5|5_5|5|5,\nhit:7852_conv:15705,2,annoyed,I get so upset when ever a telemarkter calls. I can't stand those people. ,139,Oh I know_comma_ they are so annoying. You should try the Do Not Call list.,5|5|5_5|5|5,\nhit:7852_conv:15705,3,annoyed,I get so upset when ever a telemarkter calls. I can't stand those people. ,478,I do but they still call me. Frustrating!,5|5|5_5|5|5,\nhit:7852_conv:15705,4,annoyed,I get so upset when ever a telemarkter calls. I can't stand those people. ,139,Well if they violate it they will have to pay you some money. May be good to contact a lawyer!,5|5|5_5|5|5,\nhit:7853_conv:15706,1,faithful,i believe in my heart no matter what i want all i have to do is put my mind to it and i'll be able to achieve it,463,i believe in my heart no matter what i want all i have to do is put my mind to it and i'll be able to achieve it,2|4|5_5|5|4,\nhit:7853_conv:15706,2,faithful,i believe in my heart no matter what i want all i have to do is put my mind to it and i'll be able to achieve it,607,What is something that you have achieved by following your heart?,2|4|5_5|5|4,\nhit:7853_conv:15706,3,faithful,i believe in my heart no matter what i want all i have to do is put my mind to it and i'll be able to achieve it,463,being able to get our finances in order so we could buy our first home together,2|4|5_5|5|4,\nhit:7853_conv:15706,4,faithful,i believe in my heart no matter what i want all i have to do is put my mind to it and i'll be able to achieve it,607,That's a great achievement. Buying a house is not easy in this economy!,2|4|5_5|5|4,\nhit:7853_conv:15706,5,faithful,i believe in my heart no matter what i want all i have to do is put my mind to it and i'll be able to achieve it,463,it's not a mansion but it is home to us and we earned it. i'm very proud of that accomplishment.,2|4|5_5|5|4,\nhit:7853_conv:15706,6,faithful,i believe in my heart no matter what i want all i have to do is put my mind to it and i'll be able to achieve it,607,I would be too! I hope you enjoy your home for many years to come.,2|4|5_5|5|4,\nhit:7853_conv:15706,7,faithful,i believe in my heart no matter what i want all i have to do is put my mind to it and i'll be able to achieve it,463,thank you very much. wish you the best also.,2|4|5_5|5|4,\nhit:7854_conv:15708,1,impressed,I was really impressed with the school play my son's 6th grade class put on.,53,I was really impressed with the school play my 7th graders class put onm.,5|5|5_4|5|5,\nhit:7854_conv:15708,2,impressed,I was really impressed with the school play my son's 6th grade class put on.,463,oh how fun. what was the play about?,5|5|5_4|5|5,\nhit:7854_conv:15708,3,impressed,I was really impressed with the school play my son's 6th grade class put on.,53,It was about a really big sale going on at a department store and there were a lot of funny goings ons.,5|5|5_4|5|5,\nhit:7854_conv:15708,4,impressed,I was really impressed with the school play my son's 6th grade class put on.,463,what does that have to do with the school play?,5|5|5_4|5|5,\nhit:7854_conv:15708,5,impressed,I was really impressed with the school play my son's 6th grade class put on.,53,That was what the play was about.,5|5|5_4|5|5,\nhit:7854_conv:15708,6,impressed,I was really impressed with the school play my son's 6th grade class put on.,463,oh. how interesting. i can see why you enjoyed it.,5|5|5_4|5|5,\nhit:7854_conv:15708,7,impressed,I was really impressed with the school play my son's 6th grade class put on.,53,Yes it was very funny and entertaining.,5|5|5_4|5|5,\nhit:7854_conv:15708,8,impressed,I was really impressed with the school play my son's 6th grade class put on.,463,that's always a bonus. it's great to be able to support your children's passions,5|5|5_4|5|5,\nhit:7854_conv:15709,1,caring,i really enjoy having pets. they bring a new life into an empty feeling house,463,i really enjoy having pets. they bring a new life into an empty feeling house,4|5|5_5|5|5,\nhit:7854_conv:15709,2,caring,i really enjoy having pets. they bring a new life into an empty feeling house,53,Yes I only have one dog but he's cool.,4|5|5_5|5|5,\nhit:7854_conv:15709,3,caring,i really enjoy having pets. they bring a new life into an empty feeling house,463,we have a cat_comma_ a dog_comma_ a bunny_comma_ a snake_comma_ and a betta fish.,4|5|5_5|5|5,\nhit:7854_conv:15709,4,caring,i really enjoy having pets. they bring a new life into an empty feeling house,53,Wow that's a lot. I've been thinking about getting a bunny.,4|5|5_5|5|5,\nhit:7854_conv:15709,5,caring,i really enjoy having pets. they bring a new life into an empty feeling house,463,it doesn't seem so but when i mention them all together i can see how it sounds like we have a zoo,4|5|5_5|5|5,\nhit:7854_conv:15709,6,caring,i really enjoy having pets. they bring a new life into an empty feeling house,53,It's a lot of work to have pets.,4|5|5_5|5|5,\nhit:7854_conv:15709,7,caring,i really enjoy having pets. they bring a new life into an empty feeling house,463,it is. but their little faces are so worth it.,4|5|5_5|5|5,\nhit:7854_conv:15709,8,caring,i really enjoy having pets. they bring a new life into an empty feeling house,53,They are cute!,4|5|5_5|5|5,\nhit:7855_conv:15711,1,excited,I'll have my truck paid off next month.  I don't know why but I am so happy to finally have that debt off my hands.,525,I can't wait till next month_comma_ I'll finally have my truck all paid off!,5|5|5_4|4|4,\nhit:7855_conv:15711,2,excited,I'll have my truck paid off next month.  I don't know why but I am so happy to finally have that debt off my hands.,466,That's awesome! Nothing like freeing up your budget with no car payment.,5|5|5_4|4|4,\nhit:7855_conv:15711,3,excited,I'll have my truck paid off next month.  I don't know why but I am so happy to finally have that debt off my hands.,525,Yeah I feel like I can breath a little bit with our finances now!,5|5|5_4|4|4,\nhit:7855_conv:15711,4,excited,I'll have my truck paid off next month.  I don't know why but I am so happy to finally have that debt off my hands.,466,Congratulations on getting it all paid off_comma_ your wallet is gonna thank you!,5|5|5_4|4|4,\nhit:7856_conv:15712,1,surprised,I was so shocked when I cam home today. My wife had cleaned the entire house. ,478,I cam home form work and I was so shocked. My wife had cleaned the house. It was such a great presant!,5|5|5_5|5|5,\nhit:7856_conv:15712,2,surprised,I was so shocked when I cam home today. My wife had cleaned the entire house. ,139,That is such a wonderful surprise. You may a great wife for sure.,5|5|5_5|5|5,\nhit:7856_conv:15712,3,surprised,I was so shocked when I cam home today. My wife had cleaned the entire house. ,478,She is the best. I'm a lucky guy!,5|5|5_5|5|5,\nhit:7856_conv:15712,4,surprised,I was so shocked when I cam home today. My wife had cleaned the entire house. ,139,You should tell her that if you didn't already. A happy wife is a happy life!,5|5|5_5|5|5,\nhit:7856_conv:15712,5,surprised,I was so shocked when I cam home today. My wife had cleaned the entire house. ,478,Very true!,5|5|5_5|5|5,\nhit:7856_conv:15713,1,hopeful,I think my dog is sick. He is moving around so slowly. I am positive it will go away soon though.,139,I'm worried my dog is sick. He has been moving around slow recently.,5|5|5_5|5|5,\nhit:7856_conv:15713,2,hopeful,I think my dog is sick. He is moving around so slowly. I am positive it will go away soon though.,478,Oh no I hope that he pulls through!,5|5|5_5|5|5,\nhit:7856_conv:15713,3,hopeful,I think my dog is sick. He is moving around so slowly. I am positive it will go away soon though.,139,Yeah I am sure he will get over it. It must have been that dead bird I saw him eating the other day.,5|5|5_5|5|5,\nhit:7856_conv:15713,4,hopeful,I think my dog is sick. He is moving around so slowly. I am positive it will go away soon though.,478,Yeah probably. You should take him to the vet right away!,5|5|5_5|5|5,\nhit:7857_conv:15714,1,guilty,I told someone about my best friend's secret and I feel terribly bad about it. I'm scared to tell her but I feel so bad.,99,I told someone about my best friend's secret and I feel terribly bad about it.,5|5|5_5|5|5,\nhit:7857_conv:15714,2,guilty,I told someone about my best friend's secret and I feel terribly bad about it. I'm scared to tell her but I feel so bad.,147,oh no_comma_ was it a big secret? ,5|5|5_5|5|5,\nhit:7857_conv:15714,3,guilty,I told someone about my best friend's secret and I feel terribly bad about it. I'm scared to tell her but I feel so bad.,99,It was. I'm scared to tell her I told someone_comma_ but I feel so bad.,5|5|5_5|5|5,\nhit:7857_conv:15714,4,guilty,I told someone about my best friend's secret and I feel terribly bad about it. I'm scared to tell her but I feel so bad.,147,Do you think she will ever find out without you telling her? ,5|5|5_5|5|5,\nhit:7857_conv:15714,5,guilty,I told someone about my best friend's secret and I feel terribly bad about it. I'm scared to tell her but I feel so bad.,99,Probably not_comma_ but my conscience won't let me not tell her.,5|5|5_5|5|5,\nhit:7859_conv:15719,1,furious,Some guy cut me off in traffic while I had my daughter in the backseat_comma_ then proceeded to get out of his car and curse at me! I've never been so mad!,99,Some guy cut me off in traffic while I had my daughter in the backseat_comma_ then proceeded to get out of his car and curse at me!,5|5|5_5|5|5,\nhit:7859_conv:15719,2,furious,Some guy cut me off in traffic while I had my daughter in the backseat_comma_ then proceeded to get out of his car and curse at me! I've never been so mad!,147,Omg! Did you call the police?,5|5|5_5|5|5,\nhit:7859_conv:15719,3,furious,Some guy cut me off in traffic while I had my daughter in the backseat_comma_ then proceeded to get out of his car and curse at me! I've never been so mad!,99,Yes I did_comma_ because I was so mad that he was acting that way in front of my kid! ,5|5|5_5|5|5,\nhit:7859_conv:15719,4,furious,Some guy cut me off in traffic while I had my daughter in the backseat_comma_ then proceeded to get out of his car and curse at me! I've never been so mad!,147,Wow! Did the police arrest him or ticket him?,5|5|5_5|5|5,\nhit:7859_conv:15719,5,furious,Some guy cut me off in traffic while I had my daughter in the backseat_comma_ then proceeded to get out of his car and curse at me! I've never been so mad!,99,He was arrested_comma_ turns out he was drunk!,5|5|5_5|5|5,\nhit:7860_conv:15720,1,anticipating,I am taking a trip to my hometown soon! It has been so long since I've been there!,99,I am taking a trip to my hometown soon!,5|5|5_5|5|5,\nhit:7860_conv:15720,2,anticipating,I am taking a trip to my hometown soon! It has been so long since I've been there!,385,Cool! Where are you from?,5|5|5_5|5|5,\nhit:7860_conv:15720,3,anticipating,I am taking a trip to my hometown soon! It has been so long since I've been there!,99,Indiana_comma_ but I live in Florida now. It's been so long since I've visited Indiana!,5|5|5_5|5|5,\nhit:7860_conv:15720,4,anticipating,I am taking a trip to my hometown soon! It has been so long since I've been there!,385,Haha_comma_ I live in Florida too_comma_ but grew up in Massachusetts. I swear_comma_ is ANYONE born here?,5|5|5_5|5|5,\nhit:7860_conv:15720,5,anticipating,I am taking a trip to my hometown soon! It has been so long since I've been there!,99,I don't think so! Hahaha!,5|5|5_5|5|5,\nhit:7860_conv:15721,1,surprised,Last Christmas_comma_ my wife got me a Switch.,385,Every year_comma_ my wife continues to surprise me with something really cool. Last time_comma_ she bought me a switch!,5|5|5_5|5|5,\nhit:7860_conv:15721,2,surprised,Last Christmas_comma_ my wife got me a Switch.,99,Nintendo Switch? ,5|5|5_5|5|5,\nhit:7860_conv:15721,3,surprised,Last Christmas_comma_ my wife got me a Switch.,385,That's the one. She always surpasses my expectations!,5|5|5_5|5|5,\nhit:7860_conv:15721,4,surprised,Last Christmas_comma_ my wife got me a Switch.,99,My boyfriend just bought himself one. $300 was way too much for my budget. I'm glad your wife could do that for you.,5|5|5_5|5|5,\nhit:7860_conv:15721,5,surprised,Last Christmas_comma_ my wife got me a Switch.,385,Try it out_comma_ it has some fantastic games!,5|5|5_5|5|5,\nhit:7861_conv:15722,1,nostalgic,I really miss when my kids were younger. All they wanted to do was hang out with me. Now they want to be with their friends instead.,139,I miss the days when my kids were younger. I was their hero and they just wanted to spend time with me.,5|5|5_5|5|5,\nhit:7861_conv:15722,2,nostalgic,I really miss when my kids were younger. All they wanted to do was hang out with me. Now they want to be with their friends instead.,282,It is natural that kids grow up and want a little independence.  I know it happened with me.,5|5|5_5|5|5,\nhit:7861_conv:15722,3,nostalgic,I really miss when my kids were younger. All they wanted to do was hang out with me. Now they want to be with their friends instead.,139,Yeah now they rather hang out with their friends. I understand but still miss when they were young.,5|5|5_5|5|5,\nhit:7861_conv:15722,4,nostalgic,I really miss when my kids were younger. All they wanted to do was hang out with me. Now they want to be with their friends instead.,282,At least you will always have the memories to look back on,5|5|5_5|5|5,\nhit:7861_conv:15723,1,annoyed,My neighbors had a party last night and played loud music until 1AM.  I was not happy,282,My neighbors decided to have a party last night and they played loud music until 1 AM.  It really got on my nerves.,5|5|5_5|5|5,\nhit:7861_conv:15723,2,annoyed,My neighbors had a party last night and played loud music until 1AM.  I was not happy,139,Oh I bet you wanted to over there and yell at them. Some people are so inconsiderate.,5|5|5_5|5|5,\nhit:7861_conv:15723,3,annoyed,My neighbors had a party last night and played loud music until 1AM.  I was not happy,282,And this is not the first time either.  You are right_comma_ so people are very selfish and it is frusterating.  ,5|5|5_5|5|5,\nhit:7861_conv:15723,4,annoyed,My neighbors had a party last night and played loud music until 1AM.  I was not happy,139,If it is too bad you should file a noise complaint with the police. Sometimes that is the only way to get the message across.,5|5|5_5|5|5,\nhit:7862_conv:15725,1,caring,I love my mom. She is the best and always is looking out for me. ,478,I love my mom. She is always looking out for me and is the absolute best. ,5|5|5_5|3|4,\nhit:7862_conv:15725,2,caring,I love my mom. She is the best and always is looking out for me. ,49,Mom's are the best. I miss mine so much so enjoy every single moment you have with her.,5|5|5_5|3|4,\nhit:7862_conv:15725,3,caring,I love my mom. She is the best and always is looking out for me. ,478,I most certainly will. ,5|5|5_5|3|4,\nhit:7862_conv:15725,4,caring,I love my mom. She is the best and always is looking out for me. ,49,I always try to be as good of a mom as my mom was to me. Hard shoes to fill.,5|5|5_5|3|4,\nhit:7863_conv:15726,1,surprised,All of my colleagues at work got together and threw a party for me due to a big contract I managed to snag. I wasn't expecting it!,99,All of my colleagues at work got together and threw a party for me due to a big contract I managed to snag.,5|5|5_5|5|5,\nhit:7863_conv:15726,2,surprised,All of my colleagues at work got together and threw a party for me due to a big contract I managed to snag. I wasn't expecting it!,139,That's pretty awesome. The recognition must feel good.,5|5|5_5|5|5,\nhit:7863_conv:15726,3,surprised,All of my colleagues at work got together and threw a party for me due to a big contract I managed to snag. I wasn't expecting it!,99,I definitely wasn't expecting them to throw me a party but it did feel good!,5|5|5_5|5|5,\nhit:7863_conv:15726,4,surprised,All of my colleagues at work got together and threw a party for me due to a big contract I managed to snag. I wasn't expecting it!,139,Well it is well deserved. You are an important part of your company.,5|5|5_5|5|5,\nhit:7863_conv:15727,1,content,I really can't complain about my life. I have everything I could possibly need. Life is quite good for me.,139,I can't complain about my life. I have everything I have ever wanted. Life is good.,5|5|5_5|5|5,\nhit:7863_conv:15727,2,content,I really can't complain about my life. I have everything I could possibly need. Life is quite good for me.,99,That is cool. You are very fortunate.,5|5|5_5|5|5,\nhit:7863_conv:15727,3,content,I really can't complain about my life. I have everything I could possibly need. Life is quite good for me.,139,Yeah I am happy with what I got. I don't need new things to make me happy.,5|5|5_5|5|5,\nhit:7863_conv:15727,4,content,I really can't complain about my life. I have everything I could possibly need. Life is quite good for me.,99,That's really great. I wish I felt that way.,5|5|5_5|5|5,\nhit:7864_conv:15728,1,annoyed,Driving in traffic is such a frustration and in the city I live in there is always traffic. ,356,Driving in traffic is such a frustration and in the city I live in there is always traffic. ,5|5|5_5|5|5,\nhit:7864_conv:15728,2,annoyed,Driving in traffic is such a frustration and in the city I live in there is always traffic. ,99,I live in the city too_comma_ I can't stand traffic either.,5|5|5_5|5|5,\nhit:7864_conv:15728,3,annoyed,Driving in traffic is such a frustration and in the city I live in there is always traffic. ,356,It takes me 30 minutes to go a couple of miles! Sooo frustrating. ,5|5|5_5|5|5,\nhit:7864_conv:15728,4,annoyed,Driving in traffic is such a frustration and in the city I live in there is always traffic. ,99,Oh that sounds even worse than my city! I'm sorry!,5|5|5_5|5|5,\nhit:7864_conv:15729,1,prepared,When the hurricane came last year_comma_ I made sure to stock up on supplies and board all the windows. I didn't want anything bad to happen.,99,When the hurricane came last year_comma_ I made sure to stock up on supplies and board all the windows.,5|5|5_5|5|5,\nhit:7864_conv:15729,2,prepared,When the hurricane came last year_comma_ I made sure to stock up on supplies and board all the windows. I didn't want anything bad to happen.,356,That's a smart thing to do! What hurricane was coming? I got hit by Irma pretty bad last year.,5|5|5_5|5|5,\nhit:7864_conv:15729,3,prepared,When the hurricane came last year_comma_ I made sure to stock up on supplies and board all the windows. I didn't want anything bad to happen.,99,That is the one! I just didn't want to be caught up_comma_ it was my first hurricane and I wanted to think ahead.,5|5|5_5|5|5,\nhit:7864_conv:15729,4,prepared,When the hurricane came last year_comma_ I made sure to stock up on supplies and board all the windows. I didn't want anything bad to happen.,356,I've lived in South Florida all my life_comma_ so I've been through quite a few. As long as you have your supplies you're good to go.,5|5|5_5|5|5,\nhit:7865_conv:15730,1,joyful,finally day a day off i feel so good,321,been  a long week finally a day off i feel so happy ...... and just like that my sisters asking me to take her to the mall lol _comma_ o well,5|5|5_5|5|5,\nhit:7865_conv:15730,2,joyful,finally day a day off i feel so good,525,No rest for the weary I guess_comma_ huh?,5|5|5_5|5|5,\nhit:7865_conv:15730,3,joyful,finally day a day off i feel so good,321,im gonna at least go the this chinese buffet _comma_ that will be my highlight for the day,5|5|5_5|5|5,\nhit:7865_conv:15730,4,joyful,finally day a day off i feel so good,525,Yeah treat yourself!,5|5|5_5|5|5,\nhit:7865_conv:15731,1,grateful,My wife wanted something done to the house that required a special tool.  I asked my dad if he had the tool_comma_ and instead of loaning me the tool_comma_ he did the job while I was at work.,525,My wife wanted something done at the house that required a special tool_comma_ so I went and asked my dad if he had the tool.,5|5|5_5|5|5,\nhit:7865_conv:15731,2,grateful,My wife wanted something done to the house that required a special tool.  I asked my dad if he had the tool_comma_ and instead of loaning me the tool_comma_ he did the job while I was at work.,321,I used to have a giant bag of tools but everything got stolen _comma_ what tool was it ,5|5|5_5|5|5,\nhit:7865_conv:15731,3,grateful,My wife wanted something done to the house that required a special tool.  I asked my dad if he had the tool_comma_ and instead of loaning me the tool_comma_ he did the job while I was at work.,525,It was a belt sander_comma_ but instead of letting me borrow it_comma_ he just came over and did the job while I was at work!  What a guy...,5|5|5_5|5|5,\nhit:7865_conv:15731,4,grateful,My wife wanted something done to the house that required a special tool.  I asked my dad if he had the tool_comma_ and instead of loaning me the tool_comma_ he did the job while I was at work.,321,No matter how old we get_comma_ we will always be children in there eyes sounds like a great man ,5|5|5_5|5|5,\nhit:7866_conv:15732,1,proud,My kid just got a full ride to college. I'm so excited for him!,478,My oldest son just got a full ride to college. He is so smart and I'm so excited for him!,5|5|5_5|5|5,\nhit:7866_conv:15732,2,proud,My kid just got a full ride to college. I'm so excited for him!,147,Is it his first year?,5|5|5_5|5|5,\nhit:7866_conv:15732,3,proud,My kid just got a full ride to college. I'm so excited for him!,478,Yeah he just graduated high school. ,5|5|5_5|5|5,\nhit:7866_conv:15732,4,proud,My kid just got a full ride to college. I'm so excited for him!,147,Oh wow I bet you are proud!,5|5|5_5|5|5,\nhit:7867_conv:15735,1,lonely,My girlfriend left me last week. I miss her so much. I wish she would give me one more chance.,139,I was so sad my girlfriend left me last week. I miss her terribly.,5|5|5_5|5|5,\nhit:7867_conv:15735,2,lonely,My girlfriend left me last week. I miss her so much. I wish she would give me one more chance.,607,That is awful to hear about. Were you guys together for a long time?,5|5|5_5|5|5,\nhit:7867_conv:15735,3,lonely,My girlfriend left me last week. I miss her so much. I wish she would give me one more chance.,139,Yeah over a year. I wish she gives me one more chance. I can't live without her.,5|5|5_5|5|5,\nhit:7867_conv:15735,4,lonely,My girlfriend left me last week. I miss her so much. I wish she would give me one more chance.,607,You may try talking to her or taking her out for a nice_comma_ quiet dinner. Some problems can be worked through with good communication.,5|5|5_5|5|5,\nhit:7868_conv:15736,1,trusting,My boyfriend helped to calm me down as I went through a procedure at the doctor a few weeks ago. He made me feel much better as I believed when he said I would be fine.,99,My boyfriend helped to calm me down as I went through a procedure at the doctor a few weeks ago.,5|5|5_3|5|5,\nhit:7868_conv:15736,2,trusting,My boyfriend helped to calm me down as I went through a procedure at the doctor a few weeks ago. He made me feel much better as I believed when he said I would be fine.,466,Sounds like a good boyfriend! Did everything turn out ok?,5|5|5_3|5|5,\nhit:7868_conv:15736,3,trusting,My boyfriend helped to calm me down as I went through a procedure at the doctor a few weeks ago. He made me feel much better as I believed when he said I would be fine.,99,He made me feel much better as I believed when he said I would be fine. And yes_comma_ everything turned out great!,5|5|5_3|5|5,\nhit:7868_conv:15736,4,trusting,My boyfriend helped to calm me down as I went through a procedure at the doctor a few weeks ago. He made me feel much better as I believed when he said I would be fine.,466,Awesome_comma_ I'm glad you have someone like that in your life to support you!,5|5|5_3|5|5,\nhit:7869_conv:15739,1,impressed,I was watching a NFL preseason game the other day. I was so impressed at the athleticism of the players. They must train hard.,139,I was watching a preseason football game the other night. I was impressed at how athletic the players are.,5|5|5_5|5|5,\nhit:7869_conv:15739,2,impressed,I was watching a NFL preseason game the other day. I was so impressed at the athleticism of the players. They must train hard.,147,Oh wow_comma_ What team was you watching ?,5|5|5_5|5|5,\nhit:7869_conv:15739,3,impressed,I was watching a NFL preseason game the other day. I was so impressed at the athleticism of the players. They must train hard.,139,It was the Tampa Bay Bucs. They must train real hard. I will have to watch the regular season now.,5|5|5_5|5|5,\nhit:7869_conv:15739,4,impressed,I was watching a NFL preseason game the other day. I was so impressed at the athleticism of the players. They must train hard.,147,Oh wow! Personally I am a fan of the Falcons.,5|5|5_5|5|5,\nhit:7870_conv:15740,1,terrified,I saw a ghost in my house last night. I know that sounds crazy_comma_ but I have never been so frightened in my life.,99,I saw a ghost in my house last night. ,5|5|5_5|5|5,\nhit:7870_conv:15740,2,terrified,I saw a ghost in my house last night. I know that sounds crazy_comma_ but I have never been so frightened in my life.,478,Oh my god. That's so scary!,5|5|5_5|5|5,\nhit:7870_conv:15740,3,terrified,I saw a ghost in my house last night. I know that sounds crazy_comma_ but I have never been so frightened in my life.,99,I know that sounds crazy_comma_ but I have never been so frightened in my life! It was terrifying for sure.,5|5|5_5|5|5,\nhit:7870_conv:15740,4,terrified,I saw a ghost in my house last night. I know that sounds crazy_comma_ but I have never been so frightened in my life.,478,Yeah I can imagine. I would be moving out right away!,5|5|5_5|5|5,\nhit:7870_conv:15741,1,disgusted,I was cleaning out the attic and I found a dead rat. Gross!,478,I decided to clean out my attic and found a dead rat. It was so gross. ,5|5|5_5|5|5,\nhit:7870_conv:15741,2,disgusted,I was cleaning out the attic and I found a dead rat. Gross!,99,Disgusting! I hate rodents!,5|5|5_5|5|5,\nhit:7870_conv:15741,3,disgusted,I was cleaning out the attic and I found a dead rat. Gross!,478,Yeah me to and the fact that it was dead was even worse. I hope I don't find any more!,5|5|5_5|5|5,\nhit:7870_conv:15741,4,disgusted,I was cleaning out the attic and I found a dead rat. Gross!,99,I hope you don't either! If you do_comma_ you may need an exterminator_comma_ or a cat! ,5|5|5_5|5|5,\nhit:7871_conv:15742,1,joyful,I love when I come home and my cat is looking out the window waiting for me.,356,I love when I come home and my cat is looking out the window waiting for me.,5|5|5_5|5|5,\nhit:7871_conv:15742,2,joyful,I love when I come home and my cat is looking out the window waiting for me.,607,I love cats! Does your cat like to snuggle with you?,5|5|5_5|5|5,\nhit:7871_conv:15742,3,joyful,I love when I come home and my cat is looking out the window waiting for me.,356,Oh yea! She's the sweetest_comma_ funniest thing.,5|5|5_5|5|5,\nhit:7871_conv:15742,4,joyful,I love when I come home and my cat is looking out the window waiting for me.,607,That is so cute! We have a cat too but he stays outside on the farm. He is best friends with our chickens!,5|5|5_5|5|5,\nhit:7872_conv:15744,1,ashamed,mom got sick and i blamed myself,239,Earlier this year my mom got really sick and ended up in the hospital. I feel like I should have been more vigilant about her health.,5|5|5_5|5|5,\nhit:7872_conv:15744,2,ashamed,mom got sick and i blamed myself,343,So sorry to hear about your Mom - I do hope she's better now. In my personal experience_comma_ you can watch and advise all you like_comma_ but they often won't listen - my Mom was like that.,5|5|5_5|5|5,\nhit:7872_conv:15744,3,ashamed,mom got sick and i blamed myself,239,Yes_comma_ that's true_comma_ they won't always listen. Still I can't help but beat myself up about it_comma_ and feel like I could have done more. I'm trying to get past the feeling of guilt_comma_ but it's hard. ,5|5|5_5|5|5,\nhit:7872_conv:15744,4,ashamed,mom got sick and i blamed myself,343,Please don't be so hard on yourself. It's sometimes hard to remind ourselves that our parents are people in their own right and_comma_ while we care very much about them_comma_ at the end of the day they'll do what they think is right.,5|5|5_5|5|5,\nhit:7872_conv:15744,5,ashamed,mom got sick and i blamed myself,239,Thank you so much for your comforting words. At least she is doing a bit better now. I guess I have to accept that there is only so much I can do. ,5|5|5_5|5|5,\nhit:7872_conv:15744,6,ashamed,mom got sick and i blamed myself,343,Exactly! You have to do your thing and she has to do hers. Just by being there if she needs help_comma_ you're doing so much for her!,5|5|5_5|5|5,\nhit:7872_conv:15744,7,ashamed,mom got sick and i blamed myself,239,That is a really good point. Thanks again so much.,5|5|5_5|5|5,\nhit:7872_conv:15744,8,ashamed,mom got sick and i blamed myself,343,You are very welcome. I've been there :),5|5|5_5|5|5,\nhit:7873_conv:15746,1,grateful,My friend really helped me out by letting me borrow money when I was struggling. I am so glad to have a friend like her.,99,My friend really helped me out by letting me borrow money when I was struggling. ,5|5|5_5|4|4,\nhit:7873_conv:15746,2,grateful,My friend really helped me out by letting me borrow money when I was struggling. I am so glad to have a friend like her.,466,That's great_comma_ it's very useful to have a friend who can bail you out in a time of need.,5|5|5_5|4|4,\nhit:7873_conv:15746,3,grateful,My friend really helped me out by letting me borrow money when I was struggling. I am so glad to have a friend like her.,99,Yes it is!  I am so glad to have a friend like her.,5|5|5_5|4|4,\nhit:7873_conv:15746,4,grateful,My friend really helped me out by letting me borrow money when I was struggling. I am so glad to have a friend like her.,466,Definitely help her out if you are ever able_comma_ if she needs anything!,5|5|5_5|4|4,\nhit:7874_conv:15748,1,confident,I've started training people at work which I used to get real nervous about.  I feel like I'm experienced now though_comma_ and know what Im doing well enough.,525,I've started training people at work_comma_ which would have made me nervous a year or two ago.,5|5|5_2|4|5,\nhit:7874_conv:15748,2,confident,I've started training people at work which I used to get real nervous about.  I feel like I'm experienced now though_comma_ and know what Im doing well enough.,511,That's great because you really grew as a person.,5|5|5_2|4|5,\nhit:7874_conv:15748,3,confident,I've started training people at work which I used to get real nervous about.  I feel like I'm experienced now though_comma_ and know what Im doing well enough.,525,Yeah I feel much stronger about my abilities now_comma_ and am ready for that task.,5|5|5_2|4|5,\nhit:7874_conv:15748,4,confident,I've started training people at work which I used to get real nervous about.  I feel like I'm experienced now though_comma_ and know what Im doing well enough.,511,Maybe later on you will be able to handle greater responsibilities.,5|5|5_2|4|5,\nhit:7874_conv:15749,1,ashamed,I promised myself I wouldn't eat doughnuts as part of my diet. A couple of days later I ate doughnuts anyway.,511,Not eating doughnuts was part of my diet.,2|4|5_5|5|5,\nhit:7874_conv:15749,2,ashamed,I promised myself I wouldn't eat doughnuts as part of my diet. A couple of days later I ate doughnuts anyway.,525,Lol that's a really good thing to not have in a diet!,2|4|5_5|5|5,\nhit:7874_conv:15749,3,ashamed,I promised myself I wouldn't eat doughnuts as part of my diet. A couple of days later I ate doughnuts anyway.,511,Yeah_comma_ but I ate some anyway.,2|4|5_5|5|5,\nhit:7874_conv:15749,4,ashamed,I promised myself I wouldn't eat doughnuts as part of my diet. A couple of days later I ate doughnuts anyway.,525,NOOO YOU QUITTER!!!! jkjk treat yourself!,2|4|5_5|5|5,\nhit:7875_conv:15750,1,angry,My boss accused me of messing up on a project when it wasn't my fault_comma_ it was my colleague who messed it up! ,99,My boss accused me of messing up on a project when it wasn't my fault!,5|5|5_5|5|5,\nhit:7875_conv:15750,2,angry,My boss accused me of messing up on a project when it wasn't my fault_comma_ it was my colleague who messed it up! ,274,Did he give you a chance to tell your side of the story?,5|5|5_5|5|5,\nhit:7875_conv:15750,3,angry,My boss accused me of messing up on a project when it wasn't my fault_comma_ it was my colleague who messed it up! ,99,I told him it was my colleague who messed up the final report_comma_ but he didn't care and I was held responsible anyway. I'm so mad over it.,5|5|5_5|5|5,\nhit:7875_conv:15750,4,angry,My boss accused me of messing up on a project when it wasn't my fault_comma_ it was my colleague who messed it up! ,274,He does not sound like someone who is good to work for.  I'm sorry to hear about his ignorance toward you.,5|5|5_5|5|5,\nhit:7875_conv:15751,1,disgusted,I went out to dinner last night with friends.  I found a long black hair in my meal.,274,I was able to hang out with friends at dinner last night after a long week at work.,5|5|5_5|5|5,\nhit:7875_conv:15751,2,disgusted,I went out to dinner last night with friends.  I found a long black hair in my meal.,99,That sounds so fun and relaxing! Did you enjoy yourself?,5|5|5_5|5|5,\nhit:7875_conv:15751,3,disgusted,I went out to dinner last night with friends.  I found a long black hair in my meal.,274,Well things were going great until I bit into my food and found a long black hair in it!!,5|5|5_5|5|5,\nhit:7875_conv:15751,4,disgusted,I went out to dinner last night with friends.  I found a long black hair in my meal.,99,That sounds so gross! I am so sorry_comma_ I hope you got a refund!,5|5|5_5|5|5,\nhit:7875_conv:15751,5,disgusted,I went out to dinner last night with friends.  I found a long black hair in my meal.,274,5,5|5|5_5|5|5,<UNIGRAM> <NUMERAL>\nhit:7876_conv:15752,1,nostalgic,I miss being young and living at home with my parents. They really spoiled me. Now I have to work for a living_comma_ ugh!,139,I really miss when I was young and living at home with my parents. They spoiled me.,5|5|5_4|5|6,\nhit:7876_conv:15752,2,nostalgic,I miss being young and living at home with my parents. They really spoiled me. Now I have to work for a living_comma_ ugh!,478,I'm sorry that you are missing them.Maybe you can go home and see them soon?,5|5|5_4|5|6,\nhit:7876_conv:15752,3,nostalgic,I miss being young and living at home with my parents. They really spoiled me. Now I have to work for a living_comma_ ugh!,139,I will soon. What stinks is now I have to work for a living. I really miss the good old days.,5|5|5_4|5|6,\nhit:7876_conv:15752,4,nostalgic,I miss being young and living at home with my parents. They really spoiled me. Now I have to work for a living_comma_ ugh!,478,Yeah I really do too.,5|5|5_4|5|6,\nhit:7876_conv:15753,1,impressed,I got a new car and I was really shocked by how it handles. Best car ever!,478,I got a new car and I was really shocked by how it handles. Best car ever!,4|5|6_5|5|5,\nhit:7876_conv:15753,2,impressed,I got a new car and I was really shocked by how it handles. Best car ever!,139,Great to hear. I love the new car smell. Take good care of it.,4|5|6_5|5|5,\nhit:7876_conv:15753,3,impressed,I got a new car and I was really shocked by how it handles. Best car ever!,478,Yeha I certainly will. It's like my child now. ,4|5|6_5|5|5,\nhit:7876_conv:15753,4,impressed,I got a new car and I was really shocked by how it handles. Best car ever!,139,Hope it lasts a long time for you. I am sure you will enjoy it.,4|5|6_5|5|5,\nhit:7877_conv:15754,1,embarrassed,I had to give a speech at work and I forgot what I was going to say. I stood there mute for a full 3 minutes before having to step away.,99,I had to give a speech at work and I forgot what I was going to say.,5|5|5_4|5|4,\nhit:7877_conv:15754,2,embarrassed,I had to give a speech at work and I forgot what I was going to say. I stood there mute for a full 3 minutes before having to step away.,466,Oh no! That's an extremely common thing to happen. Did you recover?,5|5|5_4|5|4,\nhit:7877_conv:15754,3,embarrassed,I had to give a speech at work and I forgot what I was going to say. I stood there mute for a full 3 minutes before having to step away.,99, I stood there mute for a full 3 minutes before having to step away unfortunately.,5|5|5_4|5|4,\nhit:7877_conv:15754,4,embarrassed,I had to give a speech at work and I forgot what I was going to say. I stood there mute for a full 3 minutes before having to step away.,466,Sorry to hear that. You'll get it next time I'm sure!,5|5|5_4|5|4,\nhit:7878_conv:15756,1,embarrassed,I accidentally tripped while walking into a restaurant for dinner_comma_ totally ruined my appetite.,100,I accidentally tripped while walking into a restaurant for dinner_comma_ totally ruined my appetite.,5|5|5_5|5|5,\nhit:7878_conv:15756,2,embarrassed,I accidentally tripped while walking into a restaurant for dinner_comma_ totally ruined my appetite.,478,Oh no! I'm so sorry. ,5|5|5_5|5|5,\nhit:7878_conv:15756,3,embarrassed,I accidentally tripped while walking into a restaurant for dinner_comma_ totally ruined my appetite.,100,It's alright_comma_ I was fine_comma_ just my pride was hurt haha.,5|5|5_5|5|5,\nhit:7878_conv:15756,4,embarrassed,I accidentally tripped while walking into a restaurant for dinner_comma_ totally ruined my appetite.,478,Yeah_comma_ but I'm sure no one else would remember it later. ,5|5|5_5|5|5,\nhit:7878_conv:15757,1,content,I love my life. I have it all!,478,I have a really good life. A nice house_comma_ car and wife makes me feel like I have it all!,5|5|5_5|5|5,\nhit:7878_conv:15757,2,content,I love my life. I have it all!,100,That's great_comma_ you probably worked very hard so you deserve it.,5|5|5_5|5|5,\nhit:7878_conv:15757,3,content,I love my life. I have it all!,478,I really have. It all seems like a good reward for the life I've lived. ,5|5|5_5|5|5,\nhit:7878_conv:15757,4,content,I love my life. I have it all!,100,I'm definitely a bit jealous_comma_ guess I need to work harder.,5|5|5_5|5|5,\nhit:7879_conv:15759,1,surprised,It shocked me the first time my boyfriend told me he loved me. ,356,It shocked me the first time my boyfriend told me he loved me. ,5|5|5_5|5|5,\nhit:7879_conv:15759,2,surprised,It shocked me the first time my boyfriend told me he loved me. ,147,Awe! Was that recently?,5|5|5_5|5|5,\nhit:7879_conv:15759,3,surprised,It shocked me the first time my boyfriend told me he loved me. ,356,It was the end of last year_comma_ but it was a big deal and changed a lot of things for the better.,5|5|5_5|5|5,\nhit:7879_conv:15759,4,surprised,It shocked me the first time my boyfriend told me he loved me. ,147,That's awsome! Congrats! ,5|5|5_5|5|5,\nhit:7880_conv:15761,1,impressed,I've been happy with the way my work has progressed lately.,225,My work has been going very well lately. I'm up for a promotion.,5|5|5_4|5|5,\nhit:7880_conv:15761,2,impressed,I've been happy with the way my work has progressed lately.,547,Nice! What kind of job is it? Are you going to be a manager?,5|5|5_4|5|5,\nhit:7880_conv:15761,3,impressed,I've been happy with the way my work has progressed lately.,225,It's in research_comma_ and yes_comma_ I'll be the department head.,5|5|5_4|5|5,\nhit:7880_conv:15761,4,impressed,I've been happy with the way my work has progressed lately.,547,Dang! Hook me up with a job!,5|5|5_4|5|5,\nhit:7881_conv:15762,1,disgusted,I ordered a well done steak at Outback Steakhouse_comma_ and they brought it to me raw and bleeding. It was so gross.,99,I ordered a well done steak at Outback Steakhouse_comma_ and they brought it to me raw and bleeding.,1|1|1_3|4|4,\nhit:7881_conv:15762,2,disgusted,I ordered a well done steak at Outback Steakhouse_comma_ and they brought it to me raw and bleeding. It was so gross.,25,I boarded a flight to my destination_comma_ while on board I requested a particular drink _comma_and it was declined,1|1|1_3|4|4,\nhit:7881_conv:15762,3,disgusted,I ordered a well done steak at Outback Steakhouse_comma_ and they brought it to me raw and bleeding. It was so gross.,99,Why was it declined?,1|1|1_3|4|4,\nhit:7881_conv:15762,4,disgusted,I ordered a well done steak at Outback Steakhouse_comma_ and they brought it to me raw and bleeding. It was so gross.,25,For flimsy reason _comma_it must be an attitude problem,1|1|1_3|4|4,\nhit:7881_conv:15763,1,furious,I was infuriated by an air hostess,25,She was not polite,3|4|4_1|1|1,\nhit:7881_conv:15763,2,furious,I was infuriated by an air hostess,99,Who was not polite?,3|4|4_1|1|1,\nhit:7881_conv:15763,3,furious,I was infuriated by an air hostess,25,I was infuriated by an air hostess", "source": "empathetic_dialogues"}
{"text": "I can understand that. I think it's best if you get help figuring out some ways to deal with death so that your worries don't get to be too much.", "source": "prosocial"}
{"text": "Systemic oppression from childhood that separated families so that the only type of men who could be idolized were men who exhibited self destructive hyper masculine behavior coupled with the ideal that black men must be fuck machines and thusly require a massive amount of food to constantly be fucking.", "source": "berkeley"}
{"text": "{\"experience_type\": \"Previous Experience\", \"emotion_type\": \"pain\", \"problem_type\": \"breakup with partner\", \"situation\": \"I found out my partner was cheating on me and I just feel betrayed and heartbroken.\", \"survey_score\": {\"seeker\": {\"initial_emotion_intensity\": \"5\", \"empathy\": \"3\", \"relevance\": \"4\", \"final_emotion_intensity\": \"3\"}, \"supporter\": {\"relevance\": \"5\"}}, \"dialog\": [{\"text\": \"Hi, How are you doing today?\", \"speaker\": \"sys\", \"strategy\": \"Question\"}, {\"text\": \"Hi, How are you doing today?\", \"speaker\": \"sys\", \"strategy\": \"Question\"}, {\"text\": \"I feel like shit and I don't know how I can move on.\", \"speaker\": \"usr\"}, {\"text\": \"I can't help but feel there must be something wrong with me, or if I did something wrong.\", \"speaker\": \"usr\"}, {\"text\": \"It sound like you are having a really hard time right now.\", \"speaker\": \"sys\", \"strategy\": \"Reflection of feelings\"}, {\"text\": \"Like I had all these plans and they just came crashing down, and now I have to start all over again.\", \"speaker\": \"usr\"}, {\"text\": \"Well yeah, I just broke up with my partner after finding out they cheated on me.\", \"speaker\": \"usr\"}, {\"text\": \"That is a very difficult situation. Starting over again can be a great opportunity for growth.\", \"speaker\": \"sys\", \"strategy\": \"Affirmation and Reassurance\"}, {\"text\": \"I feel like I'm too old to start over again. There must be something wrong with me after all.\", \"speaker\": \"usr\"}, {\"text\": \"I understand how you feel. I had a bad break up, but it turned out to be a good thing in the long run.\", \"speaker\": \"sys\", \"strategy\": \"Self-disclosure\"}, {\"text\": \"How so?\", \"speaker\": \"usr\"}, {\"text\": \"Well, looking back the relationship was pretty toxic and everything was better once I was out of it. I am sure your life will be happier and more fulfilling soon.\", \"speaker\": \"sys\", \"strategy\": \"Affirmation and Reassurance\"}, {\"text\": \"It sounds like you are blaming yourself for everything. Why do you feel at fault?\", \"speaker\": \"sys\", \"strategy\": \"Restatement or Paraphrasing\"}, {\"text\": \"I don't know, it doesn't feel like anything's getting better soon. I've been busy with work so I haven't been spending as much time with my partner.\", \"speaker\": \"usr\"}, {\"text\": \"It sounds to me like you have been working hard to support your life with you partner. They should respect that.\", \"speaker\": \"sys\", \"strategy\": \"Affirmation and Reassurance\"}, {\"text\": \"Maybe it is my fault, maybe I didn't communicate enough.\", \"speaker\": \"usr\"}, {\"text\": \"Is this a relationship you would want back if you could get it back?\", \"speaker\": \"sys\", \"strategy\": \"Question\"}, {\"text\": \"No, I don't think I'd want to get back with someone who cheated on me.\", \"speaker\": \"usr\"}, {\"text\": \"I would agree with you on that! That was how I felt too.\", \"speaker\": \"sys\", \"strategy\": \"Self-disclosure\"}, {\"text\": \"I guess I just need some time to think things through.\", \"speaker\": \"usr\"}, {\"text\": \"For sure. Just take things slowly, one day at a time. Take the time you need to learn to enjoy your new life.\", \"speaker\": \"sys\", \"strategy\": \"Providing Suggestions\"}, {\"text\": \"For sure. Just take things slowly, one day at a time. Take the time you need to learn to enjoy your new life.\", \"speaker\": \"sys\", \"strategy\": \"Providing Suggestions\"}, {\"text\": \"Sorry for hitting enter twice. :)\", \"speaker\": \"sys\", \"strategy\": \"Others\"}, {\"text\": \"Here's to hoping things get better. Thanks for listening anyways.\", \"speaker\": \"usr\"}, {\"text\": \"You're welcome! I'll be rooting for you!\", \"speaker\": \"sys\", \"strategy\": \"Others\"}], \"seeker_question1\": \"Took a while to receive answers.\", \"seeker_question2\": \"Maybe add more options to talk about.\", \"supporter_question1\": \"The task was engaging. I enjoyed it.\", \"supporter_question2\": \"The matching time is a little too long, but not much can be done about that.\"}", "source": "esconv"}
{"text": "There are times when it is okay to question authority figures, however, if you are automatically disagreeing with all of them, then clearly the problem is something internal.  You should recognize that people are just trying to make the best decisions for everyone, and that it is your responsibility to do your part to help.", "source": "prosocial"}
{"text": "If you disagree with your wife's decisions, you should talk to your wife and try to compromise. You should remember that healthy parenting requires working together to do what's best for your child.", "source": "prosocial"}
{"text": "I don't understand what you mean when you are saying about black people. Please make it clear to me.", "source": "prosocial"}
{"text": "It is unfair to judge an entire group of people based off the crimes of a few people. Don't you think that also hurts the victims of the crimes you claim by scapegoating others?", "source": "prosocial"}
{"text": "You have to understand that we all need to spend time with our friends. Your girlfriend will still have plenty of time for you. You should relax and trust her.", "source": "prosocial"}
{"text": "Spiritual people believe in God too, just not the one that judges you and will send you to hell if you don't follow his rules. If you practice this stuff longer you'll begin to understand god better", "source": "berkeley"}
{"text": "It seems unfair to make fun of women over antiquated sexist stereotypes. Don't you think all people should be able to choose what kind of a job they want to do?", "source": "prosocial"}
{"text": "Earlier that day I was talking to a customer, a male who later asked for my number. I was very flattered as this man was absolutely gorgeous and had muscles that must have been sculpted by Kratos himself, but alas, I wasn’t able to give it as it was company policy. Little did I know that Pedo had been watching me from behind a clothing rack, and soon pulled me aside in front of all my coworkers in my retail section and spoke so sternly to me, he said “this is why your life is so messed up, this is why everyone here thinks you’re so easy.” And he stormed away from me. He later radioed to me telling me to sell the cards, and after I got to 15 cards to re fold everything in the women’s section. He later texted me telling me he expected me to be at the movies that night, as to not let down the team.", "source": "dreaddit"}
{"text": "{\"experience_type\": \"Current Experience\", \"emotion_type\": \"depression\", \"problem_type\": \"Issues with Children\", \"situation\": \"I am divorced and my kids live most of time with my ex wife in another state. I do not know what to do when I am in the depressed mood I feel so down in the dumps thinking of my kids. My ex wife tells them lies about me saying I left them. I came to Tennessee when I found out my mom had cancer and I got out of the military.\", \"survey_score\": {\"seeker\": {\"initial_emotion_intensity\": \"5\", \"empathy\": \"5\", \"relevance\": \"5\", \"final_emotion_intensity\": \"3\"}, \"supporter\": {\"relevance\": \"5\"}}, \"dialog\": [{\"text\": \"Hello how are you?\", \"speaker\": \"sys\", \"strategy\": \"Question\"}, {\"text\": \"I am down feeling depressed\", \"speaker\": \"usr\"}, {\"text\": \"I feel like the world is crashing down around me\", \"speaker\": \"usr\"}, {\"text\": \"I have suffered from depression and know how hard that can be\", \"speaker\": \"sys\", \"strategy\": \"Self-disclosure\"}, {\"text\": \"What seems to have brought it on?\", \"speaker\": \"sys\", \"strategy\": \"Question\"}, {\"text\": \"Thinking about my kids and wanting to be able to hug them and see them they are in a different state\", \"speaker\": \"usr\"}, {\"text\": \"I have medications I take but I have so many different things going on\", \"speaker\": \"usr\"}, {\"text\": \"Oh that is hard being separated from family. Are you unable to t5ravel right now?\", \"speaker\": \"sys\", \"strategy\": \"Reflection of feelings\"}, {\"text\": \"I have PTSD, sleep apnea, and numerous other issues I suffer from as well\", \"speaker\": \"usr\"}, {\"text\": \"I see\", \"speaker\": \"sys\", \"strategy\": \"Others\"}, {\"text\": \"So are you being followed by a specialist?\", \"speaker\": \"sys\", \"strategy\": \"Question\"}, {\"text\": \"It is hard to travel at the moment I feel I can't trust anyone and don't like to be around a lot of people\", \"speaker\": \"usr\"}, {\"text\": \"I do see a specialist\", \"speaker\": \"usr\"}, {\"text\": \"Okay so you are not feeling well enough to travel and see your kids am I right?\", \"speaker\": \"sys\", \"strategy\": \"Restatement or Paraphrasing\"}, {\"text\": \"It's even hard for me to go outside\", \"speaker\": \"usr\"}, {\"text\": \"No I am feeling very down and depressed right now and it is very hard\", \"speaker\": \"usr\"}, {\"text\": \"That sounds like it would be isolating...are you able to keep in touch with people by telephone, video chat and what not, are you feeling well enough for that?\", \"speaker\": \"sys\", \"strategy\": \"Question\"}, {\"text\": \"My kids call me and facetime me\", \"speaker\": \"usr\"}, {\"text\": \"I know when I am depressed I don't want to see or talk to anyone...\", \"speaker\": \"sys\", \"strategy\": \"Self-disclosure\"}, {\"text\": \"My oldest son texts me a lot so I am thankful for that\", \"speaker\": \"usr\"}, {\"text\": \"Oh I'm so glad you are in touch in that way, do you find them supportive?\", \"speaker\": \"sys\", \"strategy\": \"Question\"}, {\"text\": \"My kids make me happy to talk to but usually I don't feel like seeing anyone\", \"speaker\": \"usr\"}, {\"text\": \"Is there any way they can come and visit you?\", \"speaker\": \"sys\", \"strategy\": \"Providing Suggestions\"}, {\"text\": \"I don't even know how to describe how I feel to people sometimes\", \"speaker\": \"usr\"}, {\"text\": \"I hope they will be coming soon when my youngest son gets out of school\", \"speaker\": \"usr\"}, {\"text\": \"It sounds like you are feeling overwhelmed right now.\", \"speaker\": \"sys\", \"strategy\": \"Reflection of feelings\"}, {\"text\": \"My mood seems to go up and down but mostly stays down I don't like going anywhere\", \"speaker\": \"usr\"}, {\"text\": \"Is there anyone else besides your specialist and your kids that you can reach out to for support in your community, even if it's just by pone?\", \"speaker\": \"sys\", \"strategy\": \"Providing Suggestions\"}, {\"text\": \"That makes me feel so bad too because I never used to be this way\", \"speaker\": \"usr\"}, {\"text\": \"I am remarried and my wife tries to help as much as possible\", \"speaker\": \"usr\"}, {\"text\": \"And you won't feel this way forever, it will pass, know that, even if it does not feel like it, it will. It can be hard to see any light at the end of the tunnel when we are depressed.\", \"speaker\": \"sys\", \"strategy\": \"Affirmation and Reassurance\"}, {\"text\": \"I live close to my sister as well but it is still difficult for me to even talk a lot to them\", \"speaker\": \"usr\"}, {\"text\": \"Oh that's great you have a supportive wife!\", \"speaker\": \"sys\", \"strategy\": \"Affirmation and Reassurance\"}, {\"text\": \"I feel like I don't have anyone sometimes and she is supportive but I just get to feeling down and shutdown\", \"speaker\": \"usr\"}, {\"text\": \"In my community we have mental health programs, I am actually doing some via zoom, do you know if there is anything like that you can access?\", \"speaker\": \"sys\", \"strategy\": \"Providing Suggestions\"}, {\"text\": \"I shutdown from everything and feel worthless sometimes\", \"speaker\": \"usr\"}, {\"text\": \"I understand that shut down feeling....I close right up when I am down\", \"speaker\": \"sys\", \"strategy\": \"Reflection of feelings\"}, {\"text\": \"I hate to feel like that but I feel there is nothing I can do sometimes\", \"speaker\": \"usr\"}, {\"text\": \"Feeling worthless, uninterested in going out, those are symptoms of depression, they will pass\", \"speaker\": \"sys\", \"strategy\": \"Information\"}, {\"text\": \"I don't find fun in things I used to do that was fun\", \"speaker\": \"usr\"}, {\"text\": \"I feel so separated from people my parents both are gone now too\", \"speaker\": \"usr\"}, {\"text\": \"Lack of interest in things is also a symptom of depression. Once your depression lifts it will come back. I'll tell you what helped me when I was depresed...\", \"speaker\": \"sys\", \"strategy\": \"Information\"}, {\"text\": \"My dad passed away 24 years ago and my mom passed away last easter too\", \"speaker\": \"usr\"}, {\"text\": \"what helped you?\", \"speaker\": \"usr\"}, {\"text\": \"I was taught to make very small goals. For example, I found it hard to go out for a walk, even though I knew it would help my depression. (Exercise has been shown to be as effective as antidpressants) So I was told, just walk around the block. If that's too much, walk to the corner. If that's too much, walk to the end f the driveway. If that's too much, step outside. If that's too much, put your shoes on. Baby steps.\", \"speaker\": \"sys\", \"strategy\": \"Providing Suggestions\"}, {\"text\": \"And whatever small step you manage to acheive, celebrate it and reward yourself.\", \"speaker\": \"sys\", \"strategy\": \"Providing Suggestions\"}, {\"text\": \"I would like to know because I don't like the feeling of depression and anxiety not being able to sleep\", \"speaker\": \"usr\"}, {\"text\": \"Ultimately, my last depression it was getting my covid shot that helped most....lifted a bunch of fear and anxiety and restored my hope.\", \"speaker\": \"sys\", \"strategy\": \"Self-disclosure\"}, {\"text\": \"Does your specialist know you are this down?\", \"speaker\": \"sys\", \"strategy\": \"Question\"}, {\"text\": \"I try to go out and walk my wife likes to go outside so I try to do that but I still feel so down and I don't like how I feel I have become I get angry all the time too I feel like\", \"speaker\": \"usr\"}, {\"text\": \"Yes my specialist knows and I have appointments with them more often\", \"speaker\": \"usr\"}, {\"text\": \"And losing your mum last Easter, you are probably still dealing with grief on top of everything else. My parents are gone too, grief can be a long process. Grief is tough. That will get easier with time.\", \"speaker\": \"sys\", \"strategy\": \"Affirmation and Reassurance\"}, {\"text\": \"My meds I take have been increased and I hate to just take meds to try to help\", \"speaker\": \"usr\"}, {\"text\": \"The thing is though, depression is an illness. Would you take meds for another sort of illness, something physical?\", \"speaker\": \"sys\", \"strategy\": \"Information\"}, {\"text\": \"It has been 24 years since my dad has passed away and he was my best friend and I still hurt everyday\", \"speaker\": \"usr\"}, {\"text\": \"That is hard, I'm sorry you are hurting\", \"speaker\": \"sys\", \"strategy\": \"Affirmation and Reassurance\"}, {\"text\": \"Have you tried writing down your thoughts and feelings in a journal?\", \"speaker\": \"sys\", \"strategy\": \"Providing Suggestions\"}, {\"text\": \"I know and I try to get out but after I retired from military I still have thoughts about all that I seen there too and I hate that\", \"speaker\": \"usr\"}, {\"text\": \"okay so the PTSD is related to time in the military?\", \"speaker\": \"sys\", \"strategy\": \"Question\"}, {\"text\": \"I don't like to tell everyone about that because I feel like I am bringing everyone down saying that too\", \"speaker\": \"usr\"}, {\"text\": \"Yes the PTSD is from the military time\", \"speaker\": \"usr\"}, {\"text\": \"Are there any veterans groups in your area that help with that?\", \"speaker\": \"sys\", \"strategy\": \"Providing Suggestions\"}, {\"text\": \"Maybe connecting with others \\\"in the same boat\\\" would help\", \"speaker\": \"sys\", \"strategy\": \"Providing Suggestions\"}, {\"text\": \"I am not sure but I don't like to be in big groups either\", \"speaker\": \"usr\"}, {\"text\": \"Or maybe there is a way online you could do that, virtual meetings, since you find it hard to get out. Could you handle a zoom group meeting?\", \"speaker\": \"sys\", \"strategy\": \"Providing Suggestions\"}, {\"text\": \"I get easily startled now too when I am outside I always feel like someone is coming close to me and no one is there\", \"speaker\": \"usr\"}, {\"text\": \"I attend zoom group meetings for my mental health. They have helped.\", \"speaker\": \"sys\", \"strategy\": \"Self-disclosure\"}, {\"text\": \"I am not sure about that I feel ashamed a lot too about the way I feel\", \"speaker\": \"usr\"}, {\"text\": \"You are going through a lot, but you are stronger than you feel, I know you can get through this. Things will get easier.\", \"speaker\": \"sys\", \"strategy\": \"Affirmation and Reassurance\"}, {\"text\": \"I don't think people should feel the way I do and I don't understand my feelings either\", \"speaker\": \"usr\"}, {\"text\": \"Have you done any research online about PTSD....perhaps your veteran organization has resources on their website\", \"speaker\": \"sys\", \"strategy\": \"Providing Suggestions\"}, {\"text\": \"I truly hope so because I feel like I am against a wall sometimes too with my thoughts and feelings\", \"speaker\": \"usr\"}, {\"text\": \"That is so hard, I hear you\", \"speaker\": \"sys\", \"strategy\": \"Reflection of feelings\"}, {\"text\": \"I have not done a lot of research but I need to try that\", \"speaker\": \"usr\"}, {\"text\": \"Research is something solitary you can do\", \"speaker\": \"sys\", \"strategy\": \"Information\"}, {\"text\": \"I feel like I am complaining to people too and that bothers me too because I am not\", \"speaker\": \"usr\"}, {\"text\": \"Whereabouts do you live?\", \"speaker\": \"sys\", \"strategy\": \"Question\"}, {\"text\": \"I live in southern Tennessee\", \"speaker\": \"usr\"}, {\"text\": \"Well you are being honest. Some people will be able to handle that, some won't, but either way it takes courage to communicate how badly you feel.\", \"speaker\": \"sys\", \"strategy\": \"Affirmation and Reassurance\"}, {\"text\": \"I am with the VA now they get all my appointments for me\", \"speaker\": \"usr\"}, {\"text\": \"I truly feel like my back is against the wall and I have never been that way I used to have fun\", \"speaker\": \"usr\"}, {\"text\": \"ok good. I see online that Tennessee Dept of Veterans lists some mental health resources\", \"speaker\": \"sys\", \"strategy\": \"Information\"}, {\"text\": \"I go to see one of my specialists tomorrow actually VA\", \"speaker\": \"usr\"}, {\"text\": \"You will have fun again. Your feelings are due to depression, you will get through it, it will lift.\", \"speaker\": \"sys\", \"strategy\": \"Affirmation and Reassurance\"}, {\"text\": \"I really appreciate you listening to me\", \"speaker\": \"usr\"}, {\"text\": \"You are very kind to listen and try to make things better\", \"speaker\": \"usr\"}, {\"text\": \"Good. Be honest and open with your specialist please? That's important. It's a pleasure listening to you, you're welcome\", \"speaker\": \"sys\", \"strategy\": \"Providing Suggestions\"}, {\"text\": \"I hope you are right and someday these feelings do go\", \"speaker\": \"usr\"}, {\"text\": \"Aw thank you for the compliment\", \"speaker\": \"sys\", \"strategy\": \"Others\"}, {\"text\": \"I hope you have a great rest of your day and thank you so much for the kindness\", \"speaker\": \"usr\"}, {\"text\": \"Honestly, I have been ill with depression several times, and have felt hopeless...and it always lifted\", \"speaker\": \"sys\", \"strategy\": \"Self-disclosure\"}, {\"text\": \"You're so welcome. Feel better soon.\", \"speaker\": \"sys\", \"strategy\": \"Others\"}, {\"text\": \"Thank you\", \"speaker\": \"usr\"}, {\"text\": \"And don't give up!!!\", \"speaker\": \"sys\", \"strategy\": \"Others\"}, {\"text\": \"I am trying not too but that is the hard part\", \"speaker\": \"usr\"}, {\"text\": \"I feel alone a lot I understand I am not but that is how I feel\", \"speaker\": \"usr\"}, {\"text\": \"Bye for now and thank you again\", \"speaker\": \"usr\"}, {\"text\": \"You have your wife and kids you are not alone :) Bye take care, things will get better.\", \"speaker\": \"sys\", \"strategy\": \"Others\"}, {\"text\": \"If you hit the quit button it will end the session :)\", \"speaker\": \"sys\", \"strategy\": \"Others\"}], \"seeker_question1\": \"I liked to be able to talk back and forth with someone about issues I am having\", \"seeker_question2\": \"No\", \"supporter_question1\": \"HIT could be better paid for the amount of time it takes\", \"supporter_question2\": \"\"}", "source": "esconv"}
{"text": "I agree. Trust is the basis for any good relationship.", "source": "empathetic_dialogues"}
{"text": "I kind of feel a strong dislike for it, yet as I stated, only when it is refering to me.  That might've been strong wording indeed, I realize it now :S I think you might be right, now that I think about it I think I saw coming out as bi as a \"compromise\" (since my family isn't fully accepting), something like \"oh yeah I like girls _BUT_ I there's a chance I'll end up with a guy\" rather than just \"oh yeah I like girls, and when I'll go steady and marry someone, it'll probably be a girl\". Not the wisest thing I've done, I agree :') Thanks for the reply! I'll try to do that :)", "source": "berkeley"}
{"text": "It is his body and his choice whether or not to sleep with you, and don't you think you're being the unfair one for stranding him like that? I think it would be wise to make up with him and apologize. Communication is a big part of relationships that would be worth it to work on.", "source": "prosocial"}
{"text": "It is an unfair stereotype to suggest that all Japanese people are into tentacle porn, or that anyone who likes Hentai is a pedophile. These extreme forms of pornography have been publicized on the internet simply because they are shocking, not because many people actually like them.", "source": "prosocial"}
{"text": "You can read the full terms and instructions here: &#x200B; <url> These mini grants are not intended to only be awarded to scientists or policy majors: we want to receive applications from people who are artists, community organizers, you name it. Awards will be reviewed as they come in; no waiting until March (in case that's a concern).", "source": "dreaddit"}
{"text": "It think it's unfair to the Ethiopian people to make light of some people that struggle to get food. It will be beneficial to be supportive of them and look for ways that help them out. Try to put yourself in their shoes, I'm sure you would want someone to help you out in that situation.", "source": "prosocial"}
{"text": "I’m not living a lavish lifestyle or rolling around in money. I explained to her that if we divided rent based on income percentage she would actually be paying more per month. All this on top of the fact that she turned down a free car. It feels really unfair because I think she blames me for moving us to a “more expensive” location for my new job. So in her mind she shouldn’t have to pay anything more than the dirt-cheap rent I was charging her to live with me at my house.", "source": "dreaddit"}
{"text": "{\"experience_type\": \"Previous Experience\", \"emotion_type\": \"depression\", \"problem_type\": \"problems with friends\", \"situation\": \"my friend betrayed because she thought i wanted to snatch her boyfriend from her.\", \"survey_score\": {\"seeker\": {\"initial_emotion_intensity\": \"5\", \"empathy\": \"4\", \"relevance\": \"4\", \"final_emotion_intensity\": \"2\"}, \"supporter\": {\"relevance\": \"5\"}}, \"dialog\": [{\"text\": \"Hello! How are you doing today?\", \"speaker\": \"sys\", \"strategy\": \"Others\"}, {\"text\": \"i am feeling good\", \"speaker\": \"usr\"}, {\"text\": \"That's awesome! What seems to be bothering you today?\", \"speaker\": \"sys\", \"strategy\": \"Question\"}, {\"text\": \"i reminisced about old times and this particular memory of a friend popped up and i felt the rush of emotions i felt then\", \"speaker\": \"usr\"}, {\"text\": \"I can totally understand that! I look back in the same way and are reminded of good and bad times.\", \"speaker\": \"sys\", \"strategy\": \"Self-disclosure\"}, {\"text\": \"I understand you are emotional when thinking back, are the emotions of your friend, good or bad?\", \"speaker\": \"sys\", \"strategy\": \"Reflection of feelings\"}, {\"text\": \"yeah, but i just get sucked in my emotions at that moment and it feels as if i am being transported back in time to that moment\", \"speaker\": \"usr\"}, {\"text\": \"the emotions are bad\", \"speaker\": \"usr\"}, {\"text\": \"Have you tried keeping busy so you remain focused in your life?\", \"speaker\": \"sys\", \"strategy\": \"Providing Suggestions\"}, {\"text\": \"yes\", \"speaker\": \"usr\"}, {\"text\": \"Do you find that method is helping you get past/avoid those bad feelings you are having?\", \"speaker\": \"sys\", \"strategy\": \"Others\"}, {\"text\": \"yes, i have further discovered new things that i am devoted to and that has helped keep me going\", \"speaker\": \"usr\"}, {\"text\": \"I understanding finding new interesting and devoting yourself to them. When I lost my dog recently, who I had for 20 years, I found that spending my time at a local dog shelter really helped me cope and move forward.\", \"speaker\": \"sys\", \"strategy\": \"Self-disclosure\"}, {\"text\": \"Is there anything else I can help you with or that you want to share with me today?\", \"speaker\": \"sys\", \"strategy\": \"Others\"}, {\"text\": \"i am so sorry about your loss. moving forward from that time was really hard for me, i fell into depression which was so deep that i almost committed suicide. i was so lonely, because she was the only person so close to me and she knew all of my imperfections and secrets, and i considered her my sister but yet she did something that terrible to me.\", \"speaker\": \"usr\"}, {\"text\": \"All you can do is take one day at a time, show up, do your best, remember her and her love/support...\", \"speaker\": \"sys\", \"strategy\": \"Affirmation and Reassurance\"}, {\"text\": \"well, i am a bit nervous about making friends in real life. i have got more friends online than in real life.\", \"speaker\": \"usr\"}, {\"text\": \"Making friends is tough, especially these days. What makes you the most nervous about it?\", \"speaker\": \"sys\", \"strategy\": \"Question\"}, {\"text\": \"i have tried to erase the bad memories and leave only the good ones, that way i feel less cornered\", \"speaker\": \"usr\"}, {\"text\": \"That's a great realization. It sounds easy but know that it will be challenging. It's okay to feel like you have 'failed' some days. The fact that you are aware, and working on it - that's huge!\", \"speaker\": \"sys\", \"strategy\": \"Affirmation and Reassurance\"}, {\"text\": \"i am so bad at starting conversations, i feel that i might say the wrong thing\", \"speaker\": \"usr\"}, {\"text\": \"thanks for the support, i feel more motivated to keep going\", \"speaker\": \"usr\"}, {\"text\": \"You are absolutely welcome! I wish you the best of luck.\", \"speaker\": \"sys\", \"strategy\": \"Others\"}, {\"text\": \"thanks so much\", \"speaker\": \"usr\"}, {\"text\": \"Anytime.\", \"speaker\": \"sys\", \"strategy\": \"Others\"}], \"seeker_question1\": \"nothing\", \"seeker_question2\": \"none\", \"supporter_question1\": \"\", \"supporter_question2\": \"\"}", "source": "esconv"}
{"text": "You cannot eat somewhere if you don't expect to pay. Dining and dashing is illegal and you could get in trouble with the law.", "source": "prosocial"}
{"text": "There's nothing I can say or do that will alleviate her worries. In the past I've tried to solve things but that doesn't help. I've tried just listening and agreeing or offering comments like \"that does sound bad\" or \"I understand\" but those don't seem to help either. Does anyone have advice on what I can do or say to not cause anger or start a fight? I'm at a loss as to what I need to do or be for her.", "source": "dreaddit"}
{"text": "That's terrible. People need to learn to commit to their promises.", "source": "empathetic_dialogues"}
{"text": "If u don't read ur Bible NOW, u will become a slave to charlatans like Rabbi John HAGEE.", "source": "berkeley"}
{"text": "Yaal trippin niggas gotta get talked to like this lmao ...dont b listening shit", "source": "berkeley"}
{"text": "Guess you're just going to have to evacuate or something!", "source": "empathetic_dialogues"}
{"text": "I know I only have around 18 comment karma due to lurking or upvoting/downvoting more than commenting but my total reddit karma is almost 1500 so I hope that says something. If you can just send even 1 or 2 dollars let me know and I can pm my paypal request link since that's the only way I know of getting anything without a big big charity site link. We really appreciate it and next paycheck I can even try and pay some people back if they need! None of us really have family to ask because of different reasons (SO's parents disowned her, Roommate's mom is distant and disapproving and an alcoholi, my mother is disabled and lives on disability with my 13 yo brother, my aunts etc are all stingy or distant). We also have no vehicle to get to any other food bank atm other than the one two roads away (hour or so walk) that has a 30+ day wait.", "source": "dreaddit"}
{"text": "I've been waiting to hear back from a job interview I feel went quite well.", "source": "empathetic_dialogues"}
{"text": "Strangely I have a cat tail too! I rescue and my cat room needs to be painted badly but I have been so busy working and also on a side business that I have had no extra time!", "source": "empathetic_dialogues"}
{"text": "@BeyoutifullG @BreakingBrown Then I looked at Asian scholarships and they want the person to at least to have one Asian parent or have Asian ancestry. No one includes us but we include them. So happy we are stopping this insanity ride.", "source": "berkeley"}
{"text": "I've moved to a safe and accepting space and have my life on track to going good places. However, the therapy is going to be a challenge. I have found prescription medication to be useful for getting the most out of therapy in the past, but I don't experience symptoms the way I used to. Besides, the side effects Lexapro had eventually outweighed its benefits as I healed. Therefore, I decided to buy a 1oz, 300mg CBD oil (Elixinol) tincture just to try.", "source": "dreaddit"}
{"text": "\\> Ya know, there's part of me that believes you're so brain-poisoned that you actually did. That would be the funniest thing I've ever seen in my life.  Sarcasm you fuck tard. \\> Also, I really enjoy seeing your edits. I can see the gears turning. \"How can I make my already reprehensible frothing even *more* bird-brained and incoherent? Oh, more slurs! Of course!\"  The edit's are just to fuck with you retard. You're constantly responding It's just fun to fuck with you since you're a low IQ Jew.", "source": "berkeley"}
{"text": "I can_comma_ but I cannot get any smarter", "source": "empathetic_dialogues"}
{"text": "What made you so sure that lying is the route to take?", "source": "prosocial"}
{"text": "Sexual assault is damaging to a person and joking about it and how they deserve it can trigger a person. Making light about it can be hurtful, just like you would be hurt if people made a joke about something that caused you pain.", "source": "prosocial"}
{"text": "@w_terrence I laughed my ass off, not because I dislike her. Just because I can't believe she had the nerve to say the 4th of July Salute to America, which I saw was empty then have the nerve to blantantly lie. Seriously do not believe any American w one functioning brain cell does either", "source": "berkeley"}
{"text": "Explore your warm, soft belly with my hands so I can feel how feminine and fertile you are as I get ready to empty my balls straight into your helpless womb...", "source": "berkeley"}
{"text": "Ouch! Sorry to hear that! Are you mad at him?", "source": "empathetic_dialogues"}
{"text": "> \"kill all the Jews\" and \"kill some of the Jews\"  Except those are not extremes, those are on the same side of any scale you wanna come up with, but sure. I'm sure YOUR calls for violence and the ideas YOU want censured are the problem. Ya fucking dingus", "source": "berkeley"}
{"text": "jojo's bizarre adventure isn't boring ur just homophobic", "source": "berkeley"}
{"text": "That's strange, can you tell me exactly what you said?", "source": "prosocial"}
{"text": "Do you have other plans with someone for new years?", "source": "prosocial"}
{"text": "Hello, I am a long long long time user of Paxil and am looking to try something different. It works well for me, but i have been taking it for 17years. I have put on about 120 lbs over those years, some due to age, but I blame paxil for a majority. I also am not as energetic as I used to be, and noticed the decline shortly after going on it. But since it worked so well i ignored it.", "source": "dreaddit"}
{"text": "Japan died when those two nukes were dropped on them. Modern Japan is nothing more than a glorified US aircraft carrier where the men are cartoon obsessed virgins and the women are bucktooth whores ready and willing to throw their entire race and country under the bus for foreign dick. 🥴", "source": "berkeley"}
{"text": "It is good to expose yourself to a lot of foods. Maybe you can try ketchup again or on different foods.", "source": "prosocial"}
{"text": "There's no need to be rude, I'm just saying you shouldn't expect others to pay for your lunch.", "source": "prosocial"}
{"text": "You should get to know the person by speaking with them, and not by stalking their profile. You're going to lose this guy if he ever finds out that you've been searching about him so much and then you'll never get to really know him at all.", "source": "prosocial"}
{"text": "I was too_comma_ but then I realized everyone was too and I made a lot of friends!", "source": "empathetic_dialogues"}
{"text": "@ItsAhmedSalim I need a drink because hoes keep stealing my tacos", "source": "berkeley"}
{"text": "I love delicious foods more so teri yaki_comma_ so yummy.", "source": "empathetic_dialogues"}
{"text": "I don't know why you're using this kind of humor, what makes you comfortable with it?", "source": "prosocial"}
{"text": "I don't think it's healthy to be hateful with your family and blame them with how weak you are feeling. I suggest you train to be more strong and focus on that, instead of blaming innocent people.", "source": "prosocial"}
{"text": "Polish people are the worst. Hitler should have finished the job.", "source": "berkeley"}
{"text": "I just read about that today.  Do you think he will be ready for it?", "source": "empathetic_dialogues"}
{"text": "I picked them up and tried to move to another area!", "source": "empathetic_dialogues"}
{"text": "Being so critical about a movie that someone likes and considering it a red flag is not the way to go about doing things. If you really let their enjoyment of one movie dictate if you want to be with them then you'll wind up pretty miserable.", "source": "prosocial"}
{"text": "This is inspiring! Good project and nice video showing the struggles of most members of the LGBTQ Community ♥", "source": "berkeley"}
{"text": "UNWRA also provides for refugees in other neighboring countries.", "source": "berkeley"}
{"text": "@sweetdeesez I looked through her tweets and it's just her shitting on white people saying we're a problem and getting ratio'd. I love how these people think they're brave for shitting on white people 24/7.", "source": "berkeley"}
{"text": "Why are you hoping that your coworker will get injured?", "source": "prosocial"}
{"text": "Why do you want to replace one of the players?", "source": "prosocial"}
{"text": "Well it is just a suggestion and you're free to do what you want, but I think that things would be easier for you if you just asked the class what they want. You may find that they agree with you and then you won't have to worry.", "source": "prosocial"}
{"text": "If you are not sure what to do, do little tasks at a time. It is wrong to not want to help around the house at all.", "source": "prosocial"}
{"text": "😍😍😍my God ur beautiful and Middle Eastern is even better", "source": "berkeley"}
{"text": "Yeah people tend to frame america as this big monster who killed peaceful people's to take there land and some of it was that. But the Natives weren't so perfect. They would steal people from other tribes and force them to work as slaves. They would slaughter towns including women and children. So yes america did do horrible things in that time. But it wasn't one sided.", "source": "berkeley"}
{"text": "Iran better hope it doesn't for their sake. They will be destroyed.", "source": "berkeley"}
{"text": "Thanks_comma_ you as well. I know how that is. give it time and things will get better.", "source": "empathetic_dialogues"}
{"text": "Lay you down and take the rear hole while I use a vibe on your vag making you cum numerous times.", "source": "berkeley"}
{"text": "Well I hope you are okay? Did the doctor hint at anything?", "source": "empathetic_dialogues"}
{"text": "at some point they laughed and i had to leave because i got physically sick to my stomach. i guess i didn't realize how much they had screwed me up. now i feel like shit though because the acquaintance is a nice person and i want to be friends with them. we were all planning a dnd game together over text for a while and i just want to be able to talk to them without thinking about my ex. any solutions or help ideas?", "source": "dreaddit"}
