{"text": "I see that your comparing your birthday to your friend's birthdays. However, you should be thankful for what your parents were able to do for you. You should consider that some kids aren't even allowed to celebrate their birthdays for religious reasons.", "source": "prosocial"}
{"text": "{\"experience_type\": \"Current Experience\", \"emotion_type\": \"anxiety\", \"problem_type\": \"ongoing depression\", \"situation\": \"Worried about my daughter abd her academic struggles. She has a genetic condition and some learning differences. Struggling to cope to work and do day to day things and give her as much support as she needs.\", \"survey_score\": {\"seeker\": {\"initial_emotion_intensity\": \"4\", \"empathy\": \"5\", \"relevance\": \"5\", \"final_emotion_intensity\": \"3\"}, \"supporter\": {\"relevance\": \"5\"}}, \"dialog\": [{\"text\": \"Hello. How are you doing today?\", \"speaker\": \"sys\", \"strategy\": \"Others\"}, {\"text\": \"Hi, I'm struggling today.\", \"speaker\": \"usr\"}, {\"text\": \"I'm sorry to hear that. Anything in particular that is bothering you?\", \"speaker\": \"sys\", \"strategy\": \"Question\"}, {\"text\": \"I just feel worn out with everything I have to do.\", \"speaker\": \"usr\"}, {\"text\": \"I don't know what else I can d to help my daughter.\", \"speaker\": \"usr\"}, {\"text\": \"I understand that you are feeling worn out and don't know what else you can do to help your child. Is there something specific going on or is it just life in general?\", \"speaker\": \"sys\", \"strategy\": \"Restatement or Paraphrasing\"}, {\"text\": \"My daughter struggles with school work and memory. She learns differently and needs lots of support. I have contacted the school a number of times over the years but never really had any support or acknowledgement from them. I guess it's just an accumulation of things.\", \"speaker\": \"usr\"}, {\"text\": \"You have tried hard to help her and that is admirable. Don't beat yourself up and be proud of the things you have done for her.\", \"speaker\": \"sys\", \"strategy\": \"Affirmation and Reassurance\"}, {\"text\": \"But what do I now. She's 17 and it's so difficult to give her the time and then encourage her to tell me when she needs help and for her to be willing to accept it.\", \"speaker\": \"usr\"}, {\"text\": \"While I do not have kids, from what I have seen my friends and family do in this situation is try to find something that your daughter is interested in and attempt to build off of that. So instead of her learning to just learn, she is learning something that is relevant to her. Maybe that might spark something in her to come up with her way of learning since traditional methods aren't working.\", \"speaker\": \"sys\", \"strategy\": \"Self-disclosure\"}, {\"text\": \"That is great advice. She does climb and hasn't been able to climb or see her friends with everything closed. I think as she will be able to again soon may be that will help her to relax and get back into it. She does learn through repetition but has lacked enthusiasm especially in the last few months.\", \"speaker\": \"usr\"}, {\"text\": \"Having her go climbing more sounds like a good plan. Hopefully things are opening up around you now that the vaccine is becoming more common.\", \"speaker\": \"sys\", \"strategy\": \"Restatement or Paraphrasing\"}, {\"text\": \"Repetition is tough. I know I used a lot of flash cards as a way of learning through high-school and college. It's an old method but it can work.\", \"speaker\": \"sys\", \"strategy\": \"Self-disclosure\"}, {\"text\": \"She had heart surgery as a baby so has actually had the vaccine herself as she's in the vulnerable category. I think she ends up spending so long making aide memoires that she then leaves herself so little time to actually study.\", \"speaker\": \"usr\"}, {\"text\": \"I can imagine after having heart surgery as a baby she wants to live life to it's fullest extent and prioritizes making memories over school. Does she ever talk about what her plans are for after high-school? At some point she will have to connect the dots of having to get a job to be able to go out and have fun, and unfortunately doing OK in school comes with that. That or a vocational school to learn a trade (what I personally did).\", \"speaker\": \"sys\", \"strategy\": \"Restatement or Paraphrasing\"}, {\"text\": \"What did you do? Her interests are music and photography. Recently she has started a gardening club with the horticulture department at school. She does enjoy her social life well when she has been able to have it. She has had social ups and downs but apart from the epidemic she has been happier than in her earlier years at school. You are right she is becoming an adult and will find her place. At 17 I guess she doesn't have to decide just yet.\", \"speaker\": \"usr\"}, {\"text\": \"You have certainly made me feel a bit more positive.\", \"speaker\": \"usr\"}, {\"text\": \"Sorry for the delay. I am glad you are feeling more positive. I was into cars so I went to vocational school to become an auto mechanic. After a couple years of that I realized I wasn't cut out for physical labor and went to college. But the knowledge from working on cars helped me understand things better at college since I had real world applications I could use it on.\", \"speaker\": \"sys\", \"strategy\": \"Others\"}, {\"text\": \"Gardening and Horticulture is a great hobby! That definitely could cross over into some of her science classes to make things more interesting and relevant to her.\", \"speaker\": \"sys\", \"strategy\": \"Restatement or Paraphrasing\"}, {\"text\": \"Thank you so much for your time and kindness today. You helped me refocus and some of the things you said were just what I needed to hear.\", \"speaker\": \"usr\"}, {\"text\": \"Glad I was able to help. Sometimes just having someone to bounce things off of makes a big difference. You have a good heart and good intentions. I wish you and your daughter the best.\", \"speaker\": \"sys\", \"strategy\": \"Others\"}, {\"text\": \"Thank you. Take care :-)\", \"speaker\": \"usr\"}, {\"text\": \"You're welcome. It was my pleasure.\", \"speaker\": \"sys\", \"strategy\": \"Others\"}, {\"text\": \"Please hit the quit button and take the survey. I can not end the chat from my side. Thank you!\", \"speaker\": \"sys\", \"strategy\": \"Others\"}], \"seeker_question1\": \"I think it's hard to explain any difficulties in 10 parts of a conversation. Whilst you want to talk more I think as it's a paid conversation it won't reflect the full support you might get on a helpline.\", \"seeker_question2\": \"I'm really not sure.\", \"supporter_question1\": \"no\", \"supporter_question2\": \"no\"}", "source": "esconv"}
{"text": "ugly chinese bitter ass i hope you're root in hell #WeLoveYouJennie", "source": "berkeley"}
{"text": "{\"experience_type\": \"Current Experience\", \"emotion_type\": \"sadness\", \"problem_type\": \"ongoing depression\", \"situation\": \"Covid 19 and not being able to see my friends and family\", \"survey_score\": {\"seeker\": {\"initial_emotion_intensity\": \"5\"}, \"supporter\": {}}, \"dialog\": [{\"text\": \"Hi!\", \"speaker\": \"usr\"}, {\"text\": \"hello there, beautiful day isn't it?\", \"speaker\": \"sys\", \"strategy\": \"Question\"}, {\"text\": \"No not exactly\", \"speaker\": \"usr\"}, {\"text\": \"Whats so great about it\", \"speaker\": \"usr\"}, {\"text\": \"oh no what's wrong?\", \"speaker\": \"sys\", \"strategy\": \"Question\"}, {\"text\": \"I am missing my mom a lot . I havent seen her in 6 months or more\", \"speaker\": \"usr\"}, {\"text\": \"You seem really concerned about your mom! why haven't you been able to call her?\", \"speaker\": \"sys\", \"strategy\": \"Affirmation and Reassurance\"}, {\"text\": \"I do call her daily! I just havent been able to see her and hug her and spend time with her .\", \"speaker\": \"usr\"}, {\"text\": \"My husband wont let me with Covid\", \"speaker\": \"usr\"}, {\"text\": \"I know it is sooo hard. My mom lives so far away and I can't see her too because of COVID. the only thing that makes me feel a little bit better is that am not putting her at harm's way when I visit her\", \"speaker\": \"sys\", \"strategy\": \"Self-disclosure\"}, {\"text\": \"I have two boys and we used to see her at least once a week sometimes more\", \"speaker\": \"usr\"}, {\"text\": \"My mom is only 20min or less away and she doesn't drive\", \"speaker\": \"usr\"}, {\"text\": \"How are your boys feeling about it?\", \"speaker\": \"sys\", \"strategy\": \"Question\"}, {\"text\": \"My oldest is sad my youngest 7 couldnt care less. He loves that he can just play roblox more . Hes OBSESSED with it\", \"speaker\": \"usr\"}, {\"text\": \"To be fair Roblox is pretty fun. Have you seen those videos on Facebook where family members visit their families from behind the window? What do you think your husband will think about that?\", \"speaker\": \"sys\", \"strategy\": \"Providing Suggestions\"}, {\"text\": \"No he doesnt trust me not to go in the townhouse or use an excuse to go inside to be with her. No I am forbidden to see her\", \"speaker\": \"usr\"}, {\"text\": \"He feels she is a risk to us and we are high risk so hes protecting us\", \"speaker\": \"usr\"}], \"seeker_question1\": \"the fact they left\", \"seeker_question2\": \"no\", \"supporter_question1\": \"\", \"supporter_question2\": \"\"}", "source": "esconv"}
{"text": "What do I do?   ---   **tl;dr**: My fiance completely cuts himself off from our son and me and sulks for days if his sports teams lose. I am tired of having to plan our lives around his teams and cancel plans when they lose, but he doesn't see a problem. I don't know what to do, but I feel like I can't keep doing this.", "source": "dreaddit"}
{"text": "How do I decide? I clicked with one guy, but he does talk therapy, doesn't really have a specific method like EMDR or CBT. There are many who use specific methods, and most didn't click, or had approaches I feel iffy about. Ultimately I think I just have to accept that no therapist will make this problem of living with CPTSD go away, and this is something I'll have to learn to live with. What tips do you have for picking therapists, or about therapy in general?", "source": "dreaddit"}
{"text": "> \"I think I don't like Germaine Greer but I don't remember why\" >  > So a week passes and then she sends me CONTRAPOINTS' video on \"gender critical feminists\" and says \"this is why I fucking hate Germaine Greer this is the most vile disgusting thing I've ever seen\" ah yes, the ol' \"i got my opinion from facebook\" chestnut", "source": "berkeley"}
{"text": "I dated a guy for like 2 weeks cuz I'm clinically insane and depressed but in those two weeks my dad asked if I'm gay and I said \"bruh idk\" and he's like \"ok\" and ever since then it's been weird as fuck between my family and I. But I swear to god when I brought my girl over for Halloween to go tick or treating this year (last year I could do it) he was shook as fuck. When I came home this is what he said I stg  D : \"So you're not gay huh?\" Me : I guess I'm a bi-cycle  D : ok Yes. My sexuality is a bike.", "source": "berkeley"}
{"text": "I don't know why, because it didn't bother me before I actually saw it on a screen, but I am absolutely crushed. I've asked him to hide it from me from now on and expressed how hurt it was, but I went to use his gaming system a couple of days ago and saw he was still looking it up regularly (I guess he thought I wouldn't use it - I had gone to look up something and all the searches popped up in the Bing bar). I never felt attractive to him and I know that's my own fault and insecurity and not his problem to fix. I know rationally that men like variety. But I haven't sent him nudes in probably two months now.", "source": "dreaddit"}
{"text": "I have anxiety ptsd depression and a severe eating disorder, she has severely crippling anxiety she needs meds for that we have to pay out of pocket for. We have until Feb on this lease and then we are done with this hell >We dont buy anything other tthan necessities but the rents so fucking high >We dont even have car insurance anymore bc we cant afford it >Often I have to work on an empty stomach, days at a time", "source": "dreaddit"}
{"text": "I really don't know what's wrong with me lately. It seems like every day I'm having some kind of meltdown and I don't know how to get back to normal. The other night I had a massive flashback, no idea what triggered it. It came out of nowhere. And for about two weeks now I feel constantly on the verge of an anxiety attack.", "source": "dreaddit"}
{"text": "{\"experience_type\": \"Current Experience\", \"emotion_type\": \"anxiety\", \"problem_type\": \"academic pressure\", \"situation\": \"I am having difficulty at school. I'm in my first year of college and since we have gone virtual, I don't see any friends. I want to drop out, but my parents would go crazy. I can't talk to them about it.\", \"survey_score\": {\"seeker\": {\"initial_emotion_intensity\": \"5\", \"empathy\": \"5\", \"relevance\": \"5\", \"final_emotion_intensity\": \"2\"}, \"supporter\": {\"relevance\": \"5\"}}, \"dialog\": [{\"text\": \"Hello, what can I help you?\", \"speaker\": \"sys\", \"strategy\": \"Question\"}, {\"text\": \"I just need help deciding what to do.\", \"speaker\": \"usr\"}, {\"text\": \"What are you contemplating for?\", \"speaker\": \"sys\", \"strategy\": \"Question\"}, {\"text\": \"I was doing okay in school, but when we had go virtual, I lost all my friends.\", \"speaker\": \"usr\"}, {\"text\": \"I want to quit school and just go home. But my parents would not be happy.\", \"speaker\": \"usr\"}, {\"text\": \"why do you think so?\", \"speaker\": \"sys\", \"strategy\": \"Question\"}, {\"text\": \"I don't see anyone but my roommate and she has a boyfriend. I'm so lonely!\", \"speaker\": \"usr\"}, {\"text\": \"How about joining a club at school to know more people?\", \"speaker\": \"sys\", \"strategy\": \"Others\"}, {\"text\": \"We are in a lockdown because of COVID. So the clubs are not doing anything.\", \"speaker\": \"usr\"}, {\"text\": \"I know I'm not the only one feeling this way.\", \"speaker\": \"usr\"}, {\"text\": \"So you're stuck with your roommate but she doesn't care about you?\", \"speaker\": \"sys\", \"strategy\": \"Restatement or Paraphrasing\"}, {\"text\": \"She's just busy with her boyfriend. They go out on hikes and stuff, but they just want to go by themselves. I'm just on my own all the time.\", \"speaker\": \"usr\"}, {\"text\": \"Everyone feels that, and it's totally normal. Don't be too harsh on yourself\", \"speaker\": \"sys\", \"strategy\": \"Affirmation and Reassurance\"}, {\"text\": \"Do you think I should quit school and start again next fall?\", \"speaker\": \"usr\"}, {\"text\": \"Why don't you do something on your own? Read a book, do some crafts?\", \"speaker\": \"sys\", \"strategy\": \"Others\"}, {\"text\": \"I don't think you should do that. Who knows how next year's gonna look like? It might be even worse\", \"speaker\": \"sys\", \"strategy\": \"Reflection of feelings\"}, {\"text\": \"I have. I've worked on my schoolwork, but it has been very easy. I also paint. But I need people.\", \"speaker\": \"usr\"}, {\"text\": \"At home, I had all my friends around. Of course, we weren't in a pandemic then.\", \"speaker\": \"usr\"}, {\"text\": \"This pandemic is making everyone feel lonely I think.\", \"speaker\": \"usr\"}, {\"text\": \"How about doing video call with your friends at home?\", \"speaker\": \"sys\", \"strategy\": \"Question\"}, {\"text\": \"I hadn't thought about that! They are all at different schools, but maybe I can do a Zoom meeting for all of us.\", \"speaker\": \"usr\"}, {\"text\": \"I totally feel you, I feel stressed out and very uncertain throughout this pandemic. You are not alone\", \"speaker\": \"sys\", \"strategy\": \"Self-disclosure\"}, {\"text\": \"I guess my friends may be feeling stressed too. Maybe I'll try and start a Zoom party! We could plan a time and wear pajamas and just sit and talk.\", \"speaker\": \"usr\"}, {\"text\": \"Exactly, I do virtual happy hour with my friends every month\", \"speaker\": \"sys\", \"strategy\": \"Self-disclosure\"}, {\"text\": \"That sounds like fun!\", \"speaker\": \"usr\"}, {\"text\": \"Why don't you do a virtual happy hour every week?\", \"speaker\": \"usr\"}, {\"text\": \"Not only that, when you feel lonely, text your friends and share it with them or your family\", \"speaker\": \"sys\", \"strategy\": \"Others\"}, {\"text\": \"Oh I am too busy to do that once a week. All of us are actually\", \"speaker\": \"sys\", \"strategy\": \"Self-disclosure\"}, {\"text\": \"I have been afraid to tell my parents how I'm feeling. I don't want them to worry about me.\", \"speaker\": \"usr\"}, {\"text\": \"I want them to know I'm lonely, but not freak out about it :-)\", \"speaker\": \"usr\"}, {\"text\": \"I don't think so. Maybe they are waiting for you to say first and give you advice, they have more experience after all\", \"speaker\": \"sys\", \"strategy\": \"Affirmation and Reassurance\"}, {\"text\": \"That's true. And I do know my mom is working from home now and she's a really social person. It's probably getting to her too.\", \"speaker\": \"usr\"}, {\"text\": \"if that's the case, you can use this chance to be there for her. I think talking to your mom will help you both\", \"speaker\": \"sys\", \"strategy\": \"Others\"}, {\"text\": \"Yes, I'll probably call her and my dad tonight. I'll let them know I'm a bit sad and lonely, but not so much that they worry. And then I'll start planning my virtual party with my friends!\", \"speaker\": \"usr\"}, {\"text\": \"Sounds like a great plan. I believe you can overcome this together\", \"speaker\": \"sys\", \"strategy\": \"Affirmation and Reassurance\"}, {\"text\": \"At least the party will give me something to look forward to!\", \"speaker\": \"usr\"}, {\"text\": \"Yes, right now I'm trying to teach myself one day at a time mindset\", \"speaker\": \"sys\", \"strategy\": \"Self-disclosure\"}, {\"text\": \"That seems like a smart thing to do. None of us can really do anything to make the pandemic go away. We just have to get through it one day at a time.\", \"speaker\": \"usr\"}, {\"text\": \"Thank you for helping me come up with a plan!\", \"speaker\": \"usr\"}, {\"text\": \"That's the right mindset. I 'm glad I could be some help\", \"speaker\": \"sys\", \"strategy\": \"Others\"}, {\"text\": \"Enjoy the rest of your night!\", \"speaker\": \"usr\"}, {\"text\": \"you too\", \"speaker\": \"sys\", \"strategy\": \"Others\"}], \"seeker_question1\": \"The first two comments were very poor but it really improved.\", \"seeker_question2\": \"15 minutes seemed long, but it could be easy with other partners.\", \"supporter_question1\": \"\", \"supporter_question2\": \"\"}", "source": "esconv"}
{"text": "You love them and that's okay. If you fell for them, you must like something about them.", "source": "prosocial"}
{"text": "I'm not a fan of this question: \"Would you date a trans person?\" 🤨 I am a fan of this question: \"Would a trans person want to date you?\"", "source": "berkeley"}
{"text": "and \"how could you let me do this?\" Although my family and friends will never see this, I'm here to answer the question: \"why?\" It wasn't as simple as some of my friends may think. I didn't magically wake up one day and think \"You know what, I think I'll let my abuser walk me down the aisle.\" It's taken 5 years for me just to sit across from him and have dinner without having a full blown panic attack.", "source": "dreaddit"}
{"text": "But if he would've unloaded on that nigga it would be a different story URL", "source": "berkeley"}
{"text": "the one in the blue uniform aint no hispanic", "source": "berkeley"}
{"text": "Any help is greatly appreciated, I'll be sure to pay it forward when i'm back on my feet. Thank you. Edit: removed bitcoin address, missed that in the rules. Sorry! Edit2: thank you so much", "source": "dreaddit"}
{"text": "I just want to get rid of the pent up confused bouncing energy inside me, so I cry because I've overwhelmed myself... not because I'm weak... That's what I tell myself at least.... I force myself to do things even if they make me uncomfortable just because I know normal ppl would not have the same issue.... Must act normal.. They won't like me if I don't... I am tired all the time, I just want someone to guide me. Take my hand and just understand I need their company to stop the war in my head, but torn because they say I should be able to do that for myself..", "source": "dreaddit"}
{"text": "This coward better be careful, these ladies could kick bonespurs whiney white ass. All YOU do is complain so go home to Scotland you coward.", "source": "berkeley"}
{"text": "Go back to your mama feminists, boy. They might give you a cookie.", "source": "berkeley"}
{"text": "{\"experience_type\": \"Current Experience\", \"emotion_type\": \"depression\", \"problem_type\": \"ongoing depression\", \"situation\": \"I'm feeling depressed and overwhelmed\", \"survey_score\": {\"seeker\": {\"initial_emotion_intensity\": \"5\", \"empathy\": \"5\", \"relevance\": \"5\", \"final_emotion_intensity\": \"3\"}, \"supporter\": {\"relevance\": \"5\"}}, \"dialog\": [{\"text\": \"Hi. I'm feeling depressed and overwhelmed.\", \"speaker\": \"usr\"}, {\"text\": \"Please tell me more about it, when did it start?\", \"speaker\": \"sys\", \"strategy\": \"Question\"}, {\"text\": \"It all started earlier this year. I live with my parents because I'm unable to care for myself , due to a disability. Well my dad has dementia, and my mom, who was the primary caregiver, was diagnosed with cancer. She's been in and out of hospital so now its up to me to keep everything afloat.,\", \"speaker\": \"usr\"}, {\"text\": \"I'm having a really hard time with it.\", \"speaker\": \"usr\"}, {\"text\": \"Between work, school, keeping up the house, and caring for my dad, it's a lot to handle.\", \"speaker\": \"usr\"}, {\"text\": \"That's very exhausting doing that much, I really feel bad for you, you're a strong person to be able to handle so much by yourself\", \"speaker\": \"sys\", \"strategy\": \"Reflection of feelings\"}, {\"text\": \"Thanks. But I'm really not that strong. It's really exhausting and overwhelming. My depression and anxiety are through the roof, and honestly, I'm not sure how long I can keep this up.\", \"speaker\": \"usr\"}, {\"text\": \"Someone else would have collapsed already. Do you go outside a lot?\", \"speaker\": \"sys\", \"strategy\": \"Question\"}, {\"text\": \"I actually am not able to go outside. Its been a few weeks.\", \"speaker\": \"usr\"}, {\"text\": \"Maybe that's why your depression got worse. We need the sun and fresh air to feel better\", \"speaker\": \"sys\", \"strategy\": \"Others\"}, {\"text\": \"i try to avoid going out at all. It's hard for me to get around. Even taking the bins out is a struggle. I can't even walk my dog. I just open the door and he goes out , does his business and comes back.\", \"speaker\": \"usr\"}, {\"text\": \"I understand it's hard for a person like you. However, as I said, from my own experience, staying indoor for a long period does more harm than good\", \"speaker\": \"sys\", \"strategy\": \"Self-disclosure\"}, {\"text\": \"You don't have to go far, even just out in your backyard to have some sunlight as the first step is good enough\", \"speaker\": \"sys\", \"strategy\": \"Others\"}, {\"text\": \"maybe i will try that. little by little\", \"speaker\": \"usr\"}, {\"text\": \"I'm really scared of the pandemic. I don't want to get sick.\", \"speaker\": \"usr\"}, {\"text\": \"Just take one step at a time, I believe you can do it as long as you put your mind in\", \"speaker\": \"sys\", \"strategy\": \"Affirmation and Reassurance\"}, {\"text\": \"If you don't get close to anyone and wear a mask, you should be fine\", \"speaker\": \"sys\", \"strategy\": \"Affirmation and Reassurance\"}, {\"text\": \"Yeah, that is what they are saying in the news. It's just that folks out here are idiots and don't want to follow protocols. We are in a red zone where I live\", \"speaker\": \"usr\"}, {\"text\": \"it's pretty bad here too but as long as you avoid crowded place, you'll be fine\", \"speaker\": \"sys\", \"strategy\": \"Affirmation and Reassurance\"}, {\"text\": \"Hopefully this is all over soon\", \"speaker\": \"usr\"}, {\"text\": \"we have 3 vaccines candidates now so there's hope\", \"speaker\": \"sys\", \"strategy\": \"Others\"}, {\"text\": \"This is true, but I hope they are researching and doing it right and not just trying to come up with a vaccine quick.\", \"speaker\": \"usr\"}, {\"text\": \"I don't think that's the case,, these companies know how much they'll have to pay if they rush and push out a defective product\", \"speaker\": \"sys\", \"strategy\": \"Affirmation and Reassurance\"}, {\"text\": \"Thank you so much for your advice and reassurance. I feel better about things now.\", \"speaker\": \"usr\"}, {\"text\": \"No problems, we all feel the same right now so I just try to cheer everyone up\", \"speaker\": \"sys\", \"strategy\": \"Self-disclosure\"}], \"seeker_question1\": \"\", \"seeker_question2\": \"\", \"supporter_question1\": \"\", \"supporter_question2\": \"\"}", "source": "esconv"}
{"text": "I can’t have fun anymore. I can’t enjoy life anymore. I don’t know what to do. This is hopeless. I had to come home from work because I can’t stop crying.", "source": "dreaddit"}
{"text": "One night I was staying up late with my uncle watching movies (this was not odd, we would watch Disney movies all night together during the summer. Like I said, he was my favorite). All of the sudden he decided to propose something to me. I was six. I had no idea what any of this meant.", "source": "dreaddit"}
{"text": "@PressTV some people are stupid and you cannot change that.muhammad killed people and forced everyone to be a muslim and raped too many 12 13 14 and up girls do you call animal like that human and believe in that trash.stupid that's all.🧐", "source": "berkeley"}
{"text": "{\"experience_type\": \"Previous Experience\", \"emotion_type\": \"sadness\", \"problem_type\": \"ongoing depression\", \"situation\": \"I just can't seem to get motivated to do anything, I feel like I have nothing to live for.\", \"survey_score\": {\"seeker\": {\"initial_emotion_intensity\": \"4\", \"empathy\": \"5\", \"relevance\": \"5\", \"final_emotion_intensity\": \"2\"}, \"supporter\": {\"relevance\": \"4\"}}, \"dialog\": [{\"text\": \"How do you become happy? How do you find something worth living for?\", \"speaker\": \"usr\"}, {\"text\": \"Hi, I think there are a lot of ways to become happy and to find something worthy living for. Let's start with things that interest you. What do you like doing for fun?\", \"speaker\": \"sys\", \"strategy\": \"Question\"}, {\"text\": \"I don't really know anymore, nothing makes me happy these days.\", \"speaker\": \"usr\"}, {\"text\": \"I used to like reading a lot but it's become a chore.\", \"speaker\": \"usr\"}, {\"text\": \"And what kinds of things did you like to read?\", \"speaker\": \"sys\", \"strategy\": \"Question\"}, {\"text\": \"Mostly fiction books. Fantasy, historical novels, contemporary fiction, anything really.\", \"speaker\": \"usr\"}, {\"text\": \"That's really great! I used to struggle with finding joy in reading as well. I was a graduate student at the time so I was mostly reading research papers.\", \"speaker\": \"sys\", \"strategy\": \"Self-disclosure\"}, {\"text\": \"Do you like reading again? What helped?\", \"speaker\": \"usr\"}, {\"text\": \"Have you tried picking up a new hobby? Something you have always thought might be fun but haven't ever tried because of lack of time or energy?\", \"speaker\": \"sys\", \"strategy\": \"Question\"}, {\"text\": \"I wanted to try rock climbing, but I don't know. I'm not really in the best shape.\", \"speaker\": \"usr\"}, {\"text\": \"I do like reading now. I took some time after school to take care of my mental health by going on walks and being in nature. Overtime, I started to pick up books again. I've found I really like true crime and autobiographies the best\", \"speaker\": \"sys\", \"strategy\": \"Self-disclosure\"}, {\"text\": \"I feel like people will just make fun of me.\", \"speaker\": \"usr\"}, {\"text\": \"Rock climbing is so fun! Have you tried taking a beginners course? I started there. I was very nervous I would be made fun of, but found that it was a really supportive community.\", \"speaker\": \"sys\", \"strategy\": \"Providing Suggestions\"}, {\"text\": \"I guess I can give it a try.\", \"speaker\": \"usr\"}, {\"text\": \"But I don't know if it will be enough.\", \"speaker\": \"usr\"}, {\"text\": \"You might find it's just the community of people that you need right now. From my experience, they were all super friendly and open to helping me along the way.\", \"speaker\": \"sys\", \"strategy\": \"Affirmation and Reassurance\"}, {\"text\": \"I guess you're right. I tend to get caught up in my own thoughts, which never have anything good to say about me.\", \"speaker\": \"usr\"}, {\"text\": \"Just from chatting with you, you seem like such a nice person. I don't think anyone would have mean things to say about you.\", \"speaker\": \"sys\", \"strategy\": \"Reflection of feelings\"}, {\"text\": \"That's kind of you to say.\", \"speaker\": \"usr\"}, {\"text\": \"I really hope you'll take the leap to trying rock climbing! It was so fun for me when I did it and I can't wait to get back out there to learn more (hopefully COVID will be over soon!) :-)\", \"speaker\": \"sys\", \"strategy\": \"Reflection of feelings\"}, {\"text\": \"Yeah I think I'll check if any gyms are open right now and try a class.\", \"speaker\": \"usr\"}, {\"text\": \"That sounds great! Hoping they are open and safe!\", \"speaker\": \"sys\", \"strategy\": \"Others\"}], \"seeker_question1\": \"None\", \"seeker_question2\": \"More options\", \"supporter_question1\": \"I didn't really like having to select the strategy used. It was invasive and took away from me trying to have a natural conversation\", \"supporter_question2\": \"none\"}", "source": "esconv"}
{"text": "{\"experience_type\": \"Current Experience\", \"emotion_type\": \"anxiety\", \"problem_type\": \"job crisis\", \"situation\": \"Nowadays, I get anxious thinking about my job stability.\", \"survey_score\": {\"seeker\": {\"initial_emotion_intensity\": \"4\", \"empathy\": \"4\", \"relevance\": \"4\", \"final_emotion_intensity\": \"2\"}, \"supporter\": {\"relevance\": \"3\"}}, \"dialog\": [{\"text\": \"Hi. How are you doing today?\", \"speaker\": \"usr\"}, {\"text\": \"I am doing pretty well. There's a beautiful sunset outside right now. How are you?\", \"speaker\": \"sys\", \"strategy\": \"Others\"}, {\"text\": \"Good to hear. Stressed and anxious nowadays due to this pandemic.\", \"speaker\": \"usr\"}, {\"text\": \"Yep. Me too. My dad just got sick and I was worried out of my mind waiting for his test results to come back. Thankfully they were negative.\", \"speaker\": \"sys\", \"strategy\": \"Self-disclosure\"}, {\"text\": \"Is there anything else you've been worried about?\", \"speaker\": \"sys\", \"strategy\": \"Question\"}, {\"text\": \"Sorry to hear that. Hopefully it works out.\", \"speaker\": \"usr\"}, {\"text\": \"Job stability is a concern of mine.\", \"speaker\": \"usr\"}, {\"text\": \"Are you working right now?\", \"speaker\": \"sys\", \"strategy\": \"Question\"}, {\"text\": \"Yes, but my firm has already cut 10%. I feel like I would be next.\", \"speaker\": \"usr\"}, {\"text\": \"Do you have a backup plan if you get laid off?\", \"speaker\": \"sys\", \"strategy\": \"Question\"}, {\"text\": \"Currently no. I am only a low level employee. This is what I am fearful of.\", \"speaker\": \"usr\"}, {\"text\": \"I see. Do you have anyone who would be willing to offer you support if you needed it, like your parents?\", \"speaker\": \"sys\", \"strategy\": \"Question\"}, {\"text\": \"Yes, but it will probably be minimal. I fear the economy will be in a downturn due to this lock down in my city.\", \"speaker\": \"usr\"}, {\"text\": \"It might be worth talking to them ahead of time. I'm sure they would understand.\", \"speaker\": \"sys\", \"strategy\": \"Providing Suggestions\"}, {\"text\": \"Lots of people are in a similar situation right now.\", \"speaker\": \"sys\", \"strategy\": \"Affirmation and Reassurance\"}, {\"text\": \"Ok, that is very helpful. Is there a lock down where you live?\", \"speaker\": \"usr\"}, {\"text\": \"Yes. I live in California, which is kind of strict.\", \"speaker\": \"sys\", \"strategy\": \"Self-disclosure\"}, {\"text\": \"Oh, I am from Oregon. That is understandable.\", \"speaker\": \"usr\"}, {\"text\": \"I'm perfectly happy to be at home, though. I'm on break from school and I have plenty of projects and stuff to work on here.\", \"speaker\": \"sys\", \"strategy\": \"Self-disclosure\"}, {\"text\": \"I really sympathize with everyone who has to support themselves right now, though. It majorly sucks.\", \"speaker\": \"sys\", \"strategy\": \"Reflection of feelings\"}, {\"text\": \"Good to hear. Are you on holiday break?\", \"speaker\": \"usr\"}, {\"text\": \"Yep. I'm off for a whole two months, because my school didn't want anyone coming back after Thanksgiving.\", \"speaker\": \"sys\", \"strategy\": \"Self-disclosure\"}, {\"text\": \"Oh ok. Well, thanks for your insights. Take care.\", \"speaker\": \"usr\"}, {\"text\": \"Also, I know I don't really know you, but can I write you a Christmas card?\", \"speaker\": \"sys\", \"strategy\": \"Others\"}, {\"text\": \"If you would rather not give out your name/address I totally understand. :)\", \"speaker\": \"sys\", \"strategy\": \"Others\"}], \"seeker_question1\": \"Conversation was very helpful. Learned a lot.\", \"seeker_question2\": \"\", \"supporter_question1\": \"The flow of the conversation felt disorganized. It was hard to put all of the messages into a certain category.\", \"supporter_question2\": \"\"}", "source": "esconv"}
{"text": "My boyfriend and I are out of options, night has fallen and we have no place to stay for the night. We're terrified beyond all reason. Neither of us has been this bad off before, and all nearby shelters have closed their doors for the night. All we have are two suitcases with our clothes and our phones. Where do we sleep in the city?", "source": "dreaddit"}
{"text": "Hello there sexy! I'd love to suck that nice cock of yours 👅🍆", "source": "berkeley"}
{"text": "Give women a choice, a voice and most importantly opportunities to do whatever they want to do in life. Eliminate patriarchy and educate everyone you know about equality and equal rights! URL", "source": "berkeley"}
{"text": "{\"experience_type\": \"Current Experience\", \"emotion_type\": \"anxiety\", \"problem_type\": \"academic pressure\", \"situation\": \"I decided to go back to school to complete my Master's degree, but I feel really overwhelmed between being a parent, having a career, and going to school at the same time.\", \"survey_score\": {\"seeker\": {\"initial_emotion_intensity\": \"3\", \"empathy\": \"5\", \"relevance\": \"5\", \"final_emotion_intensity\": \"2\"}, \"supporter\": {\"relevance\": \"5\"}}, \"dialog\": [{\"text\": \"Hello, I have been feeling very overwhelmed with school.\", \"speaker\": \"usr\"}, {\"text\": \"Hello. I totally understand being stressed out by school. I am currently in a Ph.D. program and it can be overwhelming. Do you have any hobbies to help with your stress?\", \"speaker\": \"sys\", \"strategy\": \"Affirmation and Reassurance\"}, {\"text\": \"I do like to read, but I haven't had enough time. I have been going on walks more frequently.\", \"speaker\": \"usr\"}, {\"text\": \"It sounds like you do a lot of activities that are solitary. Have you considered maybe partaking in a similar activity, like a book club, where there is more interaction with people?\", \"speaker\": \"sys\", \"strategy\": \"Reflection of feelings\"}, {\"text\": \"No, I did not consider that actually. I do enjoy my alone time since I am so busy and I have a toddler, but maybe doing something more sociable would be good.\", \"speaker\": \"usr\"}, {\"text\": \"Being busy, especially with having a small child can make you feel lonely, enhancing the stress you feel from school. Participating in social events geared toward your interest might be able to connect you to people with similar feelings!\", \"speaker\": \"sys\", \"strategy\": \"Providing Suggestions\"}, {\"text\": \"I think so too. I never thought of it like that.\", \"speaker\": \"usr\"}, {\"text\": \"I'm sure that you are trying your best to be both a good student and a great parent. It is understandable that you may not have considered those options.\", \"speaker\": \"sys\", \"strategy\": \"Affirmation and Reassurance\"}, {\"text\": \"Yes I constantly think of my son and family, and I didn't think involving myself in sociable activities would be beneficial.\", \"speaker\": \"usr\"}, {\"text\": \"I figured I really needed some alone time. I didn't realize I could be experiencing loneliness.\", \"speaker\": \"usr\"}, {\"text\": \"It is so admirable that you are acting so selfless.\", \"speaker\": \"sys\", \"strategy\": \"Affirmation and Reassurance\"}, {\"text\": \"Are you aware of any activities that you can participate in that can include your family? It could be the best of both worlds.\", \"speaker\": \"sys\", \"strategy\": \"Providing Suggestions\"}, {\"text\": \"Yes, we like to go swimming at the YMCA together.\", \"speaker\": \"usr\"}, {\"text\": \"That is great! Physical activity has been shown to reduce stress levels.\", \"speaker\": \"sys\", \"strategy\": \"Information\"}, {\"text\": \"My sister-in-law really benefits from having her sons in sports. She is able to connect with the other team moms and considers them some of her best friends. Depending on your YMCA your son may be able to participate in some of their programs?\", \"speaker\": \"sys\", \"strategy\": \"Self-disclosure\"}, {\"text\": \"Yes, and swimming is great exercise.\", \"speaker\": \"usr\"}, {\"text\": \"And if we do that more we can spend more time together.\", \"speaker\": \"usr\"}, {\"text\": \"I have been looking into putting him in soccer.\", \"speaker\": \"usr\"}, {\"text\": \"He can start at 3 years old.\", \"speaker\": \"usr\"}, {\"text\": \"Soccer would be a perfect way for both you and your son to interact with other people of similar interests.\", \"speaker\": \"sys\", \"strategy\": \"Others\"}, {\"text\": \"I think so too. You gave me a lot to think about today that I didn't consider before.\", \"speaker\": \"usr\"}, {\"text\": \"I am glad to help, Hopefully, considering these options will not only reduce your stress from being busy with being a parent and with school, but it will also bring you closer to your child.\", \"speaker\": \"sys\", \"strategy\": \"Others\"}, {\"text\": \"Yes, and both of those are major goals of mine. But the stress sometimes feels inevitable.\", \"speaker\": \"usr\"}, {\"text\": \"Sometimes stress is inevitable. You just have to know how to channel it. Some use physical activity, others use journaling. These seem to be outlets you can consider?\", \"speaker\": \"sys\", \"strategy\": \"Providing Suggestions\"}, {\"text\": \"The physical activity for sure.\", \"speaker\": \"usr\"}, {\"text\": \"I do so much writing with my Master's program. Sometimes I feel like my hand will fall off.\", \"speaker\": \"usr\"}, {\"text\": \"Physical activity seems to be the option you are most interested in.\", \"speaker\": \"sys\", \"strategy\": \"Reflection of feelings\"}, {\"text\": \"Have you considered setting daily exercise goals?\", \"speaker\": \"sys\", \"strategy\": \"Providing Suggestions\"}, {\"text\": \"Yes, I am a pretty active and fit person.\", \"speaker\": \"usr\"}, {\"text\": \"Yes, I do try to go to the gym 3 times per week at least.\", \"speaker\": \"usr\"}, {\"text\": \"Having goals for a given day can help motivate you to do the exercises and keep your head cleared from stress.\", \"speaker\": \"sys\", \"strategy\": \"Information\"}, {\"text\": \"I agree. I will definitely start to engage in more activities with peers and more swimming with my family. Thank you for your advice!\", \"speaker\": \"usr\"}, {\"text\": \"Your welcome.\", \"speaker\": \"sys\", \"strategy\": \"Others\"}], \"seeker_question1\": \"This was very helpful.\", \"seeker_question2\": \"No, it was great and thoroughly well done.\", \"supporter_question1\": \"I would have liked to be able to select multiple ways that I was addressing their problems. Like giving suggestions and providing information.\", \"supporter_question2\": \"Overall everything went really smoothly. I just would like the multiple selection option.\"}", "source": "esconv"}
{"text": "{\"experience_type\": \"Previous Experience\", \"emotion_type\": \"depression\", \"problem_type\": \"ongoing depression\", \"situation\": \"I've been feeling more depressed since quitting my job so that I could be around to take care of my children. Now that there's a pandemic raging I'm feeling even more depressed because I have to help my children with schoolwork and I don't have a ton of time to make money to help my husband out with our finances.\", \"survey_score\": {\"seeker\": {\"initial_emotion_intensity\": \"4\", \"empathy\": \"3\", \"relevance\": \"3\", \"final_emotion_intensity\": \"3\"}, \"supporter\": {\"relevance\": \"5\"}}, \"dialog\": [{\"text\": \"Hello, how are you this evening?\", \"speaker\": \"usr\"}, {\"text\": \"Hello Doing good\", \"speaker\": \"sys\", \"strategy\": \"Question\"}, {\"text\": \"How are doing?\", \"speaker\": \"sys\", \"strategy\": \"Question\"}, {\"text\": \"I've been better. The holidays aren't helping me feel better about not bringing much money home to help pay for things.\", \"speaker\": \"usr\"}, {\"text\": \"Sorry to hear this,have you ever tried selling on Ebay\", \"speaker\": \"sys\", \"strategy\": \"Question\"}, {\"text\": \"I've thought about selling stuff online, but the cost of selling things online isn't really worth it. I've been trying to use facebook marketplace, but I never have anyone who's interested.\", \"speaker\": \"usr\"}, {\"text\": \"Have you ever heard of QVC liquidations,its awesome with some very good returns.\", \"speaker\": \"sys\", \"strategy\": \"Question\"}, {\"text\": \"I've heard of QVC, but I've never heard of QVC liquidations. That might be something for me to consider. Can you give me more details about it?\", \"speaker\": \"usr\"}, {\"text\": \"If your interested you will need to submit a sellers I.D. or tax id\", \"speaker\": \"sys\", \"strategy\": \"Question\"}, {\"text\": \"I see. Is this something that you've done to make money?\", \"speaker\": \"usr\"}, {\"text\": \"Absolutely\", \"speaker\": \"sys\", \"strategy\": \"Restatement or Paraphrasing\"}, {\"text\": \"If you don't mind me asking how much have you made using QVC liquidations?\", \"speaker\": \"usr\"}, {\"text\": \"I have made close to 12,000.00 in one year just reselling the returns.Also ESTY is also a great place.\", \"speaker\": \"sys\", \"strategy\": \"Restatement or Paraphrasing\"}, {\"text\": \"Wow, what sorts of things have you sold?\", \"speaker\": \"usr\"}, {\"text\": \"Go to EBAY and scroll down to the the completed section and click it and this will show you the item your searching like homemade items or stuff like back packs that maybe on sell at Walmart and I buy them and see what they are selling for\", \"speaker\": \"sys\", \"strategy\": \"Restatement or Paraphrasing\"}, {\"text\": \"Okay, thanks for the suggestions.\", \"speaker\": \"usr\"}, {\"text\": \"I have purchased a lot of stuff from walmart and resold it on EBAY\", \"speaker\": \"sys\", \"strategy\": \"Restatement or Paraphrasing\"}, {\"text\": \"Its fun\", \"speaker\": \"sys\", \"strategy\": \"Restatement or Paraphrasing\"}, {\"text\": \"I worked with someone whose boyfriend did that. I've never thought about doing that.\", \"speaker\": \"usr\"}, {\"text\": \"I might have to consider doing that so I can feel more helpful to my husband.\", \"speaker\": \"usr\"}, {\"text\": \"Down load the Walmart app and when you go scan the item with app and sometimes its cheaper\", \"speaker\": \"sys\", \"strategy\": \"Restatement or Paraphrasing\"}, {\"text\": \"I don't shop at Walmart very much so thank you for that information.\", \"speaker\": \"usr\"}, {\"text\": \"I saw a seller on EBAY make small surf boards and sold them on EBAY well over a hundred dollars.They were 48 inches long but he made good money.\", \"speaker\": \"sys\", \"strategy\": \"Restatement or Paraphrasing\"}, {\"text\": \"That is very interesting. I wouldn't think you could make that much from small surfboards.\", \"speaker\": \"usr\"}, {\"text\": \"He painted them and they looked awesome.\", \"speaker\": \"sys\", \"strategy\": \"Restatement or Paraphrasing\"}, {\"text\": \"I wouldn't think that anyone would want a short surfboard, but I guess I don't know anything about surfing.\", \"speaker\": \"usr\"}, {\"text\": \"People who own and rent their beach house always looking for some new looks\", \"speaker\": \"sys\", \"strategy\": \"Restatement or Paraphrasing\"}, {\"text\": \"I suppose you are right.\", \"speaker\": \"usr\"}, {\"text\": \"Well thanks for the helpful suggestions to make more money.\", \"speaker\": \"usr\"}, {\"text\": \"Your welcome Don't ever give up there is always ways to make a difference.\", \"speaker\": \"sys\", \"strategy\": \"Restatement or Paraphrasing\"}, {\"text\": \"I appreciate your help.\", \"speaker\": \"usr\"}, {\"text\": \"Have a good night!\", \"speaker\": \"usr\"}, {\"text\": \"You too\", \"speaker\": \"sys\", \"strategy\": \"Restatement or Paraphrasing\"}], \"seeker_question1\": \"I didn't like that my supporter only suggested selling items and didn't offer anything else.\", \"seeker_question2\": \"Nothing that I can think of.\", \"supporter_question1\": \"Loved it\", \"supporter_question2\": \"Not having to affirming evertime\"}", "source": "esconv"}
{"text": "Is anyone else consumed by morbid curiosity? I'm constantly on /r/watchpeopledie, /r/morbidreality, /r/accidentalsuicide, as well as sites like death addict, best gore, documenting reality, etc. And - this is concern for myself, not bragging - I'm not \"phased\" by any of it. I don't savour these atrocities, but I feel like I must keep consuming them. Hardly anything fascinates me more.", "source": "dreaddit"}
{"text": "Interracial friendship? I agree. Let's talk, brother.", "source": "berkeley"}
{"text": "My car broke. Again massive stress, helplessness, and hopelessness, as if the walls are closing in on me. I knew a bit of mechanic work and decided to fix the car myself. After a few weeks of investigation, learning, part orders, etc, etc I did fix it. But it wasted a lot of my time though.", "source": "dreaddit"}
{"text": "Carpio calls on citizens from Philippines, Vietnam, Malaysia, Indonesia and Brunei to join a \"truth movement\" to counter Chinese propaganda & tell the true history of the SCS URL", "source": "berkeley"}
{"text": "> had to remove residents to make billions. Wow, so Trump really is America.", "source": "berkeley"}
{"text": "She's always in charge and bossing around, she needs to be bent over and take a hard fucking", "source": "berkeley"}
{"text": "{\"experience_type\": \"Current Experience\", \"emotion_type\": \"anxiety\", \"problem_type\": \"ongoing depression\", \"situation\": \"I'm worried about covid and my mom. she is high-risk. Im afraid she may get the virus.\", \"survey_score\": {\"seeker\": {\"initial_emotion_intensity\": \"4\", \"empathy\": \"5\", \"relevance\": \"5\", \"final_emotion_intensity\": \"2\"}, \"supporter\": {\"relevance\": \"5\"}}, \"dialog\": [{\"text\": \"Hello\", \"speaker\": \"usr\"}, {\"text\": \"Hi, how are you today?\", \"speaker\": \"sys\", \"strategy\": \"Question\"}, {\"text\": \"Oh, I'm okay. I'm just tired of everything and it has me down.\", \"speaker\": \"usr\"}, {\"text\": \"I see, I've been feeling that way too recently.\", \"speaker\": \"sys\", \"strategy\": \"Self-disclosure\"}, {\"text\": \"Is there anything in particular that has you upset or just life in general?\", \"speaker\": \"sys\", \"strategy\": \"Question\"}, {\"text\": \"Just life in general, I guess. I'm tired of covid. I'm tired of worrying about my mom and not going out and everything\", \"speaker\": \"usr\"}, {\"text\": \"That makes total sense. Covid's been going on for so long, life is so different now.\", \"speaker\": \"sys\", \"strategy\": \"Affirmation and Reassurance\"}, {\"text\": \"Do you want to talk about what's going on with your mom?\", \"speaker\": \"sys\", \"strategy\": \"Question\"}, {\"text\": \"She's high risk, so we have to be careful who we come in contact with. We try to limit time in public and all that. I order groceries for pickup at walmart so i dont have to go in, and my schooling is all online so i dont have to go to class.\", \"speaker\": \"usr\"}, {\"text\": \"She's been fighting cancer. She's in remission now, but her immune system is still compromised and we have to be even more careful than we usually would have to be\", \"speaker\": \"usr\"}, {\"text\": \"I think it's really great that you're doing all that for her! It must be extra hard to have to limit public interactions even more than most people.\", \"speaker\": \"sys\", \"strategy\": \"Affirmation and Reassurance\"}, {\"text\": \"That sounds so stressful to have to be worried about her on top of everything else. I'm so sorry you're going through that.\", \"speaker\": \"sys\", \"strategy\": \"Reflection of feelings\"}, {\"text\": \"Have you been able to keep in contact with friends through video chat? That's something that can sometimes help when feeling isolated.\", \"speaker\": \"sys\", \"strategy\": \"Providing Suggestions\"}, {\"text\": \"Yeah, we text and have group chats and stuff, and we snapchat a lot. It's been a while since I saw any of them, though. At least we have that, though.\", \"speaker\": \"usr\"}, {\"text\": \"And yeah, it's really stressful worrying about her. And she feels so bad because I can't see my friends or go in the store or to school\", \"speaker\": \"usr\"}, {\"text\": \"It sounds like you don't think the online interactions are a good substitute for in-person things. Does that sound right?\", \"speaker\": \"sys\", \"strategy\": \"Restatement or Paraphrasing\"}, {\"text\": \"Ah, that sounds like kind of a cycle of guilt going on. Where she feels bad about you not being able to go out, and you feel bad about her feeling bad.\", \"speaker\": \"sys\", \"strategy\": \"Restatement or Paraphrasing\"}, {\"text\": \"Yeah, it does. I don't need a lot of in-person interaction. I'm an introvert, so this was all just fine when it started. But even introverts need to be around people sometimes.\", \"speaker\": \"usr\"}, {\"text\": \"Yeah that makes complete sense. It seems like you have a good idea of who you are and what your needs are.\", \"speaker\": \"sys\", \"strategy\": \"Affirmation and Reassurance\"}, {\"text\": \"Yes, it does seem like the cycle of guilt.... I try not to let her see how much this is affecting me, but she's my mom and she can tell...\", \"speaker\": \"usr\"}, {\"text\": \"I wonder if you could do something like take walks in the park with friends, or see them with masks where you're really socially distanced from everyone\", \"speaker\": \"sys\", \"strategy\": \"Providing Suggestions\"}, {\"text\": \"Yeah, I'm pretty good at self-analysis lol\", \"speaker\": \"usr\"}, {\"text\": \"I really hope things get better for you. Covid should be ending soon hopefully with the vaccine, and things will start to go a bit back to normal\", \"speaker\": \"sys\", \"strategy\": \"Others\"}, {\"text\": \"Oh that's a really good idea! That might be something we can do. It won't be quite the same, but it's better than nothing. I'll ask my mom's doctor if that will be okay.\", \"speaker\": \"usr\"}, {\"text\": \"Thank you. Hopefully it will, and hopefully she will be able to get the vaccine soon, too.\", \"speaker\": \"usr\"}, {\"text\": \"Yeah! I hope that works out for you. I've been finding getting outside and doing things with others has been helpful both for social and exercise.\", \"speaker\": \"sys\", \"strategy\": \"Self-disclosure\"}, {\"text\": \"It's been really nice chatting with you :)\", \"speaker\": \"sys\", \"strategy\": \"Others\"}, {\"text\": \"You too!\", \"speaker\": \"usr\"}], \"seeker_question1\": \"\", \"seeker_question2\": \"\", \"supporter_question1\": \"\", \"supporter_question2\": \"It was pretty good. By now I've been in both roles, and I hadn't known as the support seeker that the peer-supporter couldn't actually see the description of the problem. Making that clear would be good. It'd also be nice to be able to reclassify thing I've sent. I realized I classified one thing wrong but couldn't change it.\"}", "source": "esconv"}
{"text": "I’m onto new studies now, erasing my ancient life, my life related to him. That’s how i’m reconstruct myself for now. I plan to see another therapist, someone who could help me without any conditions. I just need help. Thanks for reading, it was difficult, but felt good to finally write it down :)", "source": "dreaddit"}
{"text": "{\"experience_type\": \"Current Experience\", \"emotion_type\": \"fear\", \"problem_type\": \"problems with friends\", \"situation\": \"my best friend became phys-co and torturing all his friends by blackmailing all photos with him.he started with me also i got so much fear and issues\", \"survey_score\": {\"seeker\": {\"initial_emotion_intensity\": \"4\", \"empathy\": \"5\", \"relevance\": \"5\", \"final_emotion_intensity\": \"2\"}, \"supporter\": {\"relevance\": \"5\"}}, \"dialog\": [{\"text\": \"how you doing?\", \"speaker\": \"sys\", \"strategy\": \"Question\"}, {\"text\": \"hii\", \"speaker\": \"usr\"}, {\"text\": \"could you please help to come out of fear from my friend who became physco\", \"speaker\": \"usr\"}, {\"text\": \"i can imagine how you are feeling right now, but can you explain better how the situation is?\", \"speaker\": \"sys\", \"strategy\": \"Restatement or Paraphrasing\"}, {\"text\": \"he is one of the best friends in the group .we are 10 members , when went to party after drunk he took pictures with us when we were half nude.Now he blackmailing by that phots and asking money\", \"speaker\": \"usr\"}, {\"text\": \"i know you might be feeling betrayed right now, a friend should not have behaved like that\", \"speaker\": \"sys\", \"strategy\": \"Reflection of feelings\"}, {\"text\": \"yes , he should not , another friend family suffered lot\", \"speaker\": \"usr\"}, {\"text\": \"she attempt suicide .so i am scaring a lot\", \"speaker\": \"usr\"}, {\"text\": \"there should be someone you can try to confined in, i know you did wrong by drinking, but you need to open up to someone, cop your parent or someone you trust.\", \"speaker\": \"sys\", \"strategy\": \"Self-disclosure\"}, {\"text\": \"i thought so , wanted to share with my hubby but scaring that he might think i cheated him but in real we never do anything .it is a group a party\", \"speaker\": \"usr\"}, {\"text\": \"thank you for ur time,\", \"speaker\": \"usr\"}, {\"text\": \"It fine, he will sure be pissed but its better to meet him lay out the truth, though he might be mad, but that will else up the problem\", \"speaker\": \"sys\", \"strategy\": \"Reflection of feelings\"}, {\"text\": \"my hubby is my friend , sure will understood but still being scare\", \"speaker\": \"usr\"}, {\"text\": \"thinking about worst part will happen if he didnt trust\", \"speaker\": \"usr\"}, {\"text\": \"you should talk to your hubby dont be scared\", \"speaker\": \"sys\", \"strategy\": \"Providing Suggestions\"}, {\"text\": \"sure, can i tell to my friend wife .?\", \"speaker\": \"usr\"}, {\"text\": \"her hubby is all doing this\", \"speaker\": \"usr\"}, {\"text\": \"it will be a more disaster if he get to know on his own\", \"speaker\": \"sys\", \"strategy\": \"Providing Suggestions\"}, {\"text\": \"oh yea , i forgot that .\", \"speaker\": \"usr\"}, {\"text\": \"you can, tell your friend, she should be able to help, but you have to tell your hubby\", \"speaker\": \"sys\", \"strategy\": \"Providing Suggestions\"}, {\"text\": \"yea will discuss both , first will tell to my hubby , what ever happen\", \"speaker\": \"usr\"}, {\"text\": \"what will do if he don't trust?\", \"speaker\": \"usr\"}, {\"text\": \"he will trust you more only if you confide in him\", \"speaker\": \"sys\", \"strategy\": \"Providing Suggestions\"}, {\"text\": \"ha may be , will try then once\", \"speaker\": \"usr\"}, {\"text\": \"with telling him you can be free from all guilt\", \"speaker\": \"sys\", \"strategy\": \"Affirmation and Reassurance\"}, {\"text\": \"with telling him you can be free from all guilt\", \"speaker\": \"sys\", \"strategy\": \"Affirmation and Reassurance\"}, {\"text\": \"yea this guilt feeling so bad inside\", \"speaker\": \"usr\"}, {\"text\": \"what will do with this physco friend , he torturing all other friends too.what is the end solution for this\", \"speaker\": \"usr\"}, {\"text\": \"please do, and make sure you stay clear of the friend\", \"speaker\": \"sys\", \"strategy\": \"Providing Suggestions\"}, {\"text\": \"yes will talk to my hubby first and will take any advise from him to save all of my friends too\", \"speaker\": \"usr\"}, {\"text\": \"he isn't a friend worth keeping, you can report him to the appropriate bodies, the cops will do.\", \"speaker\": \"sys\", \"strategy\": \"Providing Suggestions\"}, {\"text\": \"yes nice idea ..will report\", \"speaker\": \"usr\"}, {\"text\": \"That will be great, and make sure you stay off party till the matter is resolved\", \"speaker\": \"sys\", \"strategy\": \"Providing Suggestions\"}], \"seeker_question1\": \"ok good\", \"seeker_question2\": \"good\", \"supporter_question1\": \"its was great\", \"supporter_question2\": \"more conversation length\"}", "source": "esconv"}
{"text": "My cleavage makes you so weak. You can't resist it 💦  You crave to be dominated by a superior 2D goddess 💋 It's so humiliating and so hot, your little clit can't help itself but twitch everytime you see my posts and take control over your weak mind 💸💸 URL", "source": "berkeley"}
{"text": "Recovery feels familiar, so it's less scary, but I'm also so much more tired of it all. I want to move on. I had been able to move on! I got so much stronger! And now I'm back here, a delicate PTSD flower.", "source": "dreaddit"}
{"text": "Why Mulan gotta beAsian. Why cant she be black?.", "source": "berkeley"}
{"text": "I think it's best to just stop these actions from now on, because gambling addiction is a huge monster. Don't you think your grandmother deserves better? How about being honest with her, and maybe she'll try to help you out as her last parting gift with you?", "source": "prosocial"}
{"text": "{\"experience_type\": \"Current Experience\", \"emotion_type\": \"sadness\", \"problem_type\": \"breakup with partner\", \"situation\": \"My partner left me after 7 years and broke up with me over text.\", \"survey_score\": {\"seeker\": {\"initial_emotion_intensity\": \"5\"}, \"supporter\": {}}, \"dialog\": [{\"text\": \"Hello\", \"speaker\": \"usr\"}, {\"text\": \"Hi. How can I help?\", \"speaker\": \"sys\", \"strategy\": \"Providing Suggestions\"}, {\"text\": \"I've just really been experiencing a very tough time lately.\", \"speaker\": \"usr\"}, {\"text\": \"What has happened? I know that sometimes life can get tough and just know that you are not alone. Sometimes the toughest parts of life, make us so much stronger.\", \"speaker\": \"sys\", \"strategy\": \"Information\"}, {\"text\": \"Well, it started with a break up. My boyfriend and I dated for 7 years and suddenly out of nowhere, he dumps me over text. I keep blaming myself and my body for this.\", \"speaker\": \"usr\"}, {\"text\": \"Why do you think it's your body? I am sure that your body is just fine! Have you thought about taking up a hobby or activity to get your mind off of it?\", \"speaker\": \"sys\", \"strategy\": \"Providing Suggestions\"}, {\"text\": \"I have thought about it, but I don't know where to start.\", \"speaker\": \"usr\"}, {\"text\": \"I understand. What kinds of things do you enjoy? I have found that exercise is great for mental health and such a good way to take your mind off of things. Have you ever felt interested in any psychical activities?\", \"speaker\": \"sys\", \"strategy\": \"Providing Suggestions\"}, {\"text\": \"I have been thinking about working out more, but I feel like I don't know where to start when I go to the gym.\", \"speaker\": \"usr\"}, {\"text\": \"Do you have any friends or family to help you? I know exactly what you mean. Starting a new activity can be so hard when you aren't familiar. One thing that you might find helpful is to join in a group class at the gym. Do you think you'd like that?\", \"speaker\": \"sys\", \"strategy\": \"Self-disclosure\"}, {\"text\": \"I do have a cousin who likes to work out. That's a great idea. I should ask her. I've been pretty lonely, so it might be good to get out and meet people. Maybe a class would help me meet people too!\", \"speaker\": \"usr\"}, {\"text\": \"That's great! Do you know what kind of class would be of interest? I think that you have the tools to be who you want to be. It sounds like you have a good head on your shoulders and I think you'll be just fine! You may even find a life long passion or friendship! You never know what is around the corner.\", \"speaker\": \"sys\", \"strategy\": \"Others\"}, {\"text\": \"Maybe yoga? Or perhaps a hit class? I will look online right away! I am very excited for this. I feel a bit better and I really appreciate your help.\", \"speaker\": \"usr\"}, {\"text\": \"Those both sounds great! Yoga is great for the body and the mind! I will sometimes just do it to clear my mind after a tough day. If your nervous about it, you could try out a few online classes first to see what to expect.\", \"speaker\": \"sys\", \"strategy\": \"Providing Suggestions\"}, {\"text\": \"That is such a good idea. I often feel nervous going into a situation I'm not familiar and I feel like everyone will judge me.\", \"speaker\": \"usr\"}, {\"text\": \"That's understandable. Everyone has insecurities in unfamiliar places but in reality, most people are too wrapped up in their own heads they don't even notice anything else. You just have to feel confident and not worry about what other people think, that will set you free.\", \"speaker\": \"sys\", \"strategy\": \"Affirmation and Reassurance\"}], \"seeker_question1\": \"\", \"seeker_question2\": \"\", \"supporter_question1\": \"\", \"supporter_question2\": \"\"}", "source": "esconv"}
{"text": "Height is something that cannot be helped, it is due to genetics and we should make do with what we have. In order to be happy we have to accept the height we have.", "source": "prosocial"}
{"text": "{\"experience_type\": \"Current Experience\", \"emotion_type\": \"sadness\", \"problem_type\": \"problems with friends\", \"situation\": \"I have been left out of 2  Christmas party's. My friends have posted photos on Facebook but I was not invited. Now I feel like I am not as close to my friends and they only want me around to help them with problems not really for friendship.\", \"survey_score\": {\"seeker\": {\"initial_emotion_intensity\": \"4\", \"empathy\": \"5\", \"relevance\": \"4\", \"final_emotion_intensity\": \"1\"}, \"supporter\": {\"relevance\": \"5\"}}, \"dialog\": [{\"text\": \"Hello.\", \"speaker\": \"usr\"}, {\"text\": \"Hello\", \"speaker\": \"sys\", \"strategy\": \"Others\"}, {\"text\": \"How may i help you today?\", \"speaker\": \"sys\", \"strategy\": \"Question\"}, {\"text\": \"I feel terrible right now,\", \"speaker\": \"usr\"}, {\"text\": \"why?\", \"speaker\": \"sys\", \"strategy\": \"Question\"}, {\"text\": \"My friends have been leaving me out of Christmas parties. I saw on Facebook my best friend didn't invite me to his Christmas party.\", \"speaker\": \"usr\"}, {\"text\": \"Your friends have been leaving you out of christmas parties is that correct?\", \"speaker\": \"sys\", \"strategy\": \"Restatement or Paraphrasing\"}, {\"text\": \"You knew nothing about the parties?\", \"speaker\": \"sys\", \"strategy\": \"Others\"}, {\"text\": \"Yes. My best friend didn't invite me to his party. I think its because I always wear mask and try to obey the CDC guidelines.\", \"speaker\": \"usr\"}, {\"text\": \"I understand how you are feeling i would feel the same way\", \"speaker\": \"sys\", \"strategy\": \"Reflection of feelings\"}, {\"text\": \"They should not be having christmas parties right now with the Covid going around bad\", \"speaker\": \"sys\", \"strategy\": \"Others\"}, {\"text\": \"I would not feel bad or terrible about it because you are doing the right thing\", \"speaker\": \"sys\", \"strategy\": \"Affirmation and Reassurance\"}, {\"text\": \"Yea it just hurts being left out. He is my best friend and I am not sure what to do. I feel like I need to talk to him abou tit.\", \"speaker\": \"usr\"}, {\"text\": \"yes you should talk to him about it and see why he did not invite you\", \"speaker\": \"sys\", \"strategy\": \"Providing Suggestions\"}, {\"text\": \"I hope they was wearing a mask and staying 6 feet at the party\", \"speaker\": \"sys\", \"strategy\": \"Information\"}, {\"text\": \"I saw photos and they were not wearing masks. In one way I'm glad I did not go. I also think he put a lot of people at risk. How should I bring this up?\", \"speaker\": \"usr\"}, {\"text\": \"I would just be straight forward and tell him you saw the photos of his christmas party\", \"speaker\": \"sys\", \"strategy\": \"Providing Suggestions\"}, {\"text\": \"Either way if you did know about the party it would not be best if you go just for your safety\", \"speaker\": \"sys\", \"strategy\": \"Self-disclosure\"}, {\"text\": \"Should I talk about him putting others at risk?\", \"speaker\": \"usr\"}, {\"text\": \"yes I believe you should talk to him about that to because he was putting everyone at risk\", \"speaker\": \"sys\", \"strategy\": \"Providing Suggestions\"}, {\"text\": \"Should I do it over txt, Phone, or in person?\", \"speaker\": \"usr\"}, {\"text\": \"which ever is more comfortable for you\", \"speaker\": \"sys\", \"strategy\": \"Information\"}, {\"text\": \"Ok so txt would be ok then.\", \"speaker\": \"usr\"}, {\"text\": \"Yes and just talk to him about how you feeling and see what he has to say\", \"speaker\": \"sys\", \"strategy\": \"Providing Suggestions\"}, {\"text\": \"Thank you so much. I'm going to do that tonight and see how it goes.\", \"speaker\": \"usr\"}, {\"text\": \"your welcome i hope it goes good and he listens\", \"speaker\": \"sys\", \"strategy\": \"Others\"}, {\"text\": \"Thank you have a great night and a Merry Christmas!\", \"speaker\": \"usr\"}, {\"text\": \"thank you Merry Christmas to you to and stay safe.\", \"speaker\": \"sys\", \"strategy\": \"Others\"}], \"seeker_question1\": \"The person was very helpful\", \"seeker_question2\": \"I think it would be nice to have some face to show how I am feeling and as we talk be able to change that.\", \"supporter_question1\": \"\", \"supporter_question2\": \"\"}", "source": "esconv"}
{"text": "Hi, everyone! Just a warning, kind of a long story, as you can probably tell from the paragraph. So my relationship with anxiety has always been a thing, at least from what I remember from childhood (undiagnosed OCD). But recently my anxiety has gotten worse, no thanks to unfortunate events over the past few years involving 3 family deaths and the loss of a childhood home and pets. While I have always been kind of an anxious person, I have upgraded (downgraded?)", "source": "dreaddit"}
{"text": "{\"experience_type\": \"Current Experience\", \"emotion_type\": \"depression\", \"problem_type\": \"ongoing depression\", \"situation\": \"fighting with my husband all the time and not seeing eye to eye. felling unwanted and unloved\", \"survey_score\": {\"seeker\": {\"initial_emotion_intensity\": \"4\", \"empathy\": \"5\", \"relevance\": \"5\", \"final_emotion_intensity\": \"2\"}, \"supporter\": {\"relevance\": \"5\"}}, \"dialog\": [{\"text\": \"i am unsure if my marriage will work\", \"speaker\": \"usr\"}, {\"text\": \"we fight and argue all the time and don't get along\", \"speaker\": \"usr\"}, {\"text\": \"when did you start having these feelings?\", \"speaker\": \"sys\", \"strategy\": \"Question\"}, {\"text\": \"about 3 months ago\", \"speaker\": \"usr\"}, {\"text\": \"is there something specific that began around that time?\", \"speaker\": \"sys\", \"strategy\": \"Question\"}, {\"text\": \"i lost my job due to covid and my husband had to get another job while i stayed home with my son for school online.\", \"speaker\": \"usr\"}, {\"text\": \"That is a difficult and trying situation during unprecedented times. This is a temporary situation that will improve in time.\", \"speaker\": \"sys\", \"strategy\": \"Affirmation and Reassurance\"}, {\"text\": \"im not sure about that but i pray it will. thank you\", \"speaker\": \"usr\"}, {\"text\": \"No one ever could have imagined that this would be how we are having to do things.\", \"speaker\": \"sys\", \"strategy\": \"Affirmation and Reassurance\"}, {\"text\": \"yes its crazy but i am praying my way though it all\", \"speaker\": \"usr\"}, {\"text\": \"have you considered discussing your feelings with your husband?\", \"speaker\": \"sys\", \"strategy\": \"Question\"}, {\"text\": \"i have but i feel like he does not care enough to change\", \"speaker\": \"usr\"}, {\"text\": \"I have done a lot of soul searching over the past months and i found small changes in my perspective helped diffuse my stress. I set aside some time to talk to friends and we all share some laughs and some tears and it truly helps.\", \"speaker\": \"sys\", \"strategy\": \"Self-disclosure\"}, {\"text\": \"that is a really good idea. i could especially use some laughs during this time. thank you for that advice\", \"speaker\": \"usr\"}, {\"text\": \"you have been helpful\", \"speaker\": \"usr\"}, {\"text\": \"god bless you\", \"speaker\": \"usr\"}, {\"text\": \"There is no need to thank me. you are doing what many are trying to do. I pray it all works out for you and your family.\", \"speaker\": \"sys\", \"strategy\": \"Others\"}, {\"text\": \"thank you so much. its been a very rough year. its like things just keep happening and i have no control\", \"speaker\": \"usr\"}, {\"text\": \"Please consider trying to reconnect with your husband. Simple little kindnesses do so much for the spirit.\", \"speaker\": \"sys\", \"strategy\": \"Providing Suggestions\"}, {\"text\": \"yes i can try and do that. i admit i have not been that nice to him recently\", \"speaker\": \"usr\"}, {\"text\": \"Every day is a fresh start. kindness from you will be returned.\", \"speaker\": \"sys\", \"strategy\": \"Others\"}, {\"text\": \"i like that. today is a fresh start and a new day\", \"speaker\": \"usr\"}, {\"text\": \"Friends, family and faith are what keep us grounded. It sounds like you have all of those. Please remember that each is there to support you.\", \"speaker\": \"sys\", \"strategy\": \"Information\"}], \"seeker_question1\": \"no\", \"seeker_question2\": \"no\", \"supporter_question1\": \"it made me sad to think that there was a person in distress\", \"supporter_question2\": \"\"}", "source": "esconv"}
{"text": "It's petty and crass to steal someone's food when you have the means to get your own. You aren't entitled to anything, so you should make amends with your roommate over anything else you've taken from them.", "source": "prosocial"}
{"text": "Why do you act like you are happy all of the time?", "source": "prosocial"}
{"text": "This is why WHITE PEOPLE don't need to be in the fucking country! They don't know how to respect wildlife like the Native Americans!", "source": "berkeley"}
{"text": "It is good to watch your back, but you are making a lot of assumptions. Try dating a few and see how it goes.", "source": "prosocial"}
{"text": "Is lynching allowed in the Indian constitution to solve a theft case? If the punishment for stealing is lynching, then every corrupt politician & Businessman should be lynched according to the logic of Mr. Nitish Kumar.  Vijay Mallya must be laughing. URL", "source": "berkeley"}
{"text": "A bitch blink @ a nigga n he think its a sign she want him😂😂 that's yall problem u wana fuck everything", "source": "berkeley"}
{"text": "@apieceofcabbage @TAAHLIAH Bitch come shoot ur shot I miss u", "source": "berkeley"}
{"text": "I grab my partner and told him “ we need to get out of here right fucking now!” We made hour way out of the building, as we were exiting the conditions increasingly got worse, just as we made the door the room flashover, my partner was already in the hallway I was still in the room. Many times when firefighters are caught in a flash over the outcome is death, for me it was burns to years, wrists, and face. I still consider myself very lucky. After that I started struggling with anxiety at work and home. On my days off I started to drink excessively.", "source": "dreaddit"}
{"text": "{\"experience_type\": \"Current Experience\", \"emotion_type\": \"fear\", \"problem_type\": \"job crisis\", \"situation\": \"I am afraid of receiving another pay cut and reduced hours. I feel that worried about my finances as I am tapping into my savings to feel afloat.\", \"survey_score\": {\"seeker\": {\"initial_emotion_intensity\": \"3\"}, \"supporter\": {}}, \"dialog\": [{\"text\": \"Thank you for listening to me today.\", \"speaker\": \"usr\"}, {\"text\": \"No problem! How are you doing? How can I help you today?\", \"speaker\": \"sys\", \"strategy\": \"Question\"}, {\"text\": \"I am nervous about receiving another pay cut and reduced hours. I dont think I can handle it financially, the fear is real.\", \"speaker\": \"usr\"}, {\"text\": \"I am very sorry to hear that. Facing pay cuts at work can be a very stressful situation.\", \"speaker\": \"sys\", \"strategy\": \"Affirmation and Reassurance\"}, {\"text\": \"Are there situations or moments that specifically make you feel like this is going to happen? Or are you just feeling a general sense of anxiety and fear it might happen?\", \"speaker\": \"sys\", \"strategy\": \"Question\"}, {\"text\": \"Yes, specially with the disastrous winter storm I underwent. Makes me nervous if our state decides to shut down to combat the pandemic. I am unsure as to what to do\", \"speaker\": \"usr\"}, {\"text\": \"I believe its more of a general sense of anxiety. I had to take a 25% pay cut with reduced hours, it was a complete lifestyle change. Not only for myself but for my children\", \"speaker\": \"usr\"}, {\"text\": \"I can definitely understand why that would be difficult. Dealing with uncertainty during the pandemic is extremely difficult, as there are so many unforeseen circumstances.\", \"speaker\": \"sys\", \"strategy\": \"Affirmation and Reassurance\"}, {\"text\": \"One thing that helps me out in those moments, is to remember that there are things in the world and life that I can control, and others that I can't control.\", \"speaker\": \"sys\", \"strategy\": \"Self-disclosure\"}, {\"text\": \"Yes, I could not agree with you more. Specially now that I have tapped into my savings and retirement. Never in life did I think I would worry about paying my light bill.\", \"speaker\": \"usr\"}, {\"text\": \"It seems like the best thing you can do at the moment is try your best to do the best you can at your job. If there will be paycuts, you might not be able to prevent it. But at least you will know that you gave a valiant effort.\", \"speaker\": \"sys\", \"strategy\": \"Providing Suggestions\"}, {\"text\": \"Thank you for the kind words. I have control of some aspects. Perhaps I will apply for an additional job, just to ensure I have a steady income. Thank you for the guidance. If you dont have any other advice we can end our interchange after this reply.\", \"speaker\": \"usr\"}, {\"text\": \"I just wanted to remind you to remember, anxiety about something that has not happened yet is not always helpful to yourself. By focusing directly on what you can do, you can make sure you are prepared for anything negative coming your way.\", \"speaker\": \"sys\", \"strategy\": \"Providing Suggestions\"}, {\"text\": \"Thank you, I will keep that in mind.\", \"speaker\": \"usr\"}, {\"text\": \"Is there anything else you need help with?\", \"speaker\": \"sys\", \"strategy\": \"Others\"}, {\"text\": \"No, not today I feel a lot more calm and gained a better understanding of my emotions and the situation I am finding myself in.\", \"speaker\": \"usr\"}, {\"text\": \"Good, I am very glad to hear that. I am wishing you the best in the future and definitely feel free to contact me if you need support again!\", \"speaker\": \"sys\", \"strategy\": \"Affirmation and Reassurance\"}, {\"text\": \"Same to you, thank you for understanding and offering really good advice, i am guessing I had forgotten that there are things I can control\", \"speaker\": \"usr\"}, {\"text\": \"I am unsure how to end our chat\", \"speaker\": \"usr\"}, {\"text\": \"Do you need any help with any other questions? Otherwise, there is a quit button on the side.\", \"speaker\": \"sys\", \"strategy\": \"Providing Suggestions\"}, {\"text\": \"No, thank you for putting everything in perspective for me. goodbye.\", \"speaker\": \"usr\"}, {\"text\": \"You're welcome. Don't hesitate to contact me again! Have a great day.\", \"speaker\": \"sys\", \"strategy\": \"Others\"}], \"seeker_question1\": \"I felt like the conversation ended to quickly. I had over 10 exchanges with more than 15 minute, yet is still telling me I am quitting the conversation.\", \"seeker_question2\": \"keeping track of the 10 responses and the 15 minutes\", \"supporter_question1\": \"The person I was supposed to provide support for only said a few sentences and seemed fast to end the conversation.\", \"supporter_question2\": \"The guidelines on the length of the conversation should be clearer (min conversation). Also, I am pretty sure my conversation partner ended the conversation while citing it was my fault?\"}", "source": "esconv"}
{"text": " *Disclaimer: This Discord is not at all affiliated with this subreddit and is not moderated by anyone from the moderating team here. * Hi all! I run a general mental health peer support chatroom on Discord for people 18\\+. At over 2600 members, we still maintain a close community\\-oriented atmosphere with rules in place and moderators present at all times.", "source": "dreaddit"}
{"text": "{\"experience_type\": \"Previous Experience\", \"emotion_type\": \"depression\", \"problem_type\": \"ongoing depression\", \"situation\": \"I'm so sad all the time.\", \"survey_score\": {\"seeker\": {\"initial_emotion_intensity\": \"5\", \"empathy\": \"5\", \"relevance\": \"5\", \"final_emotion_intensity\": \"2\"}, \"supporter\": {\"relevance\": \"5\"}}, \"dialog\": [{\"text\": \"How can I help you?\", \"speaker\": \"sys\", \"strategy\": \"Question\"}, {\"text\": \"I'm so sad all the time.\", \"speaker\": \"usr\"}, {\"text\": \"Is there something that you think is causing this?\", \"speaker\": \"sys\", \"strategy\": \"Question\"}, {\"text\": \"Nothing in particular, I'm just so sad.\", \"speaker\": \"usr\"}, {\"text\": \"Have you any history of depression before?\", \"speaker\": \"sys\", \"strategy\": \"Question\"}, {\"text\": \"I do have some family members with depression.\", \"speaker\": \"usr\"}, {\"text\": \"Have you seen any physicians about the problem?\", \"speaker\": \"sys\", \"strategy\": \"Question\"}, {\"text\": \"Maybe I should make an appointment.\", \"speaker\": \"usr\"}, {\"text\": \"Getting help from a trained professional can often help to solve problems\", \"speaker\": \"sys\", \"strategy\": \"Information\"}, {\"text\": \"You make a good point. What type of doctor could I see?\", \"speaker\": \"usr\"}, {\"text\": \"You could try going to your primary care physician and ask for recommendations.\", \"speaker\": \"sys\", \"strategy\": \"Information\"}, {\"text\": \"I can do that. Are there any doctors that deal with emotions?\", \"speaker\": \"usr\"}, {\"text\": \"I've help take a family member to a psychiatrist for help and it's been a tremendous support to help their lives be full again after great hardships.\", \"speaker\": \"sys\", \"strategy\": \"Self-disclosure\"}, {\"text\": \"I'm worried about the stigma of going to a shrink.\", \"speaker\": \"usr\"}, {\"text\": \"Under HIPPA your visit is confidential.\", \"speaker\": \"sys\", \"strategy\": \"Information\"}, {\"text\": \"Well in that case, if it can help it may be worth a try.\", \"speaker\": \"usr\"}, {\"text\": \"You deserve lots of credit for taking care of yourself and seeing a doctor.\", \"speaker\": \"sys\", \"strategy\": \"Affirmation and Reassurance\"}, {\"text\": \"Thank you for the encouragement.\", \"speaker\": \"usr\"}, {\"text\": \"You are very welcome. Is there anything else I can help you with?\", \"speaker\": \"sys\", \"strategy\": \"Question\"}, {\"text\": \"No thank you. I think I have some strategies to move forward.\", \"speaker\": \"usr\"}], \"seeker_question1\": \"no\", \"seeker_question2\": \"no\", \"supporter_question1\": \"no\", \"supporter_question2\": \"no\"}", "source": "esconv"}
{"text": "{\"experience_type\": \"Current Experience\", \"emotion_type\": \"sadness\", \"problem_type\": \"ongoing depression\", \"situation\": \"I am feeling extremely isolated due to the pandemic and miss my friends and family.\", \"survey_score\": {\"seeker\": {\"initial_emotion_intensity\": \"4\", \"empathy\": \"4\", \"relevance\": \"4\", \"final_emotion_intensity\": \"3\"}, \"supporter\": {\"relevance\": \"4\"}}, \"dialog\": [{\"text\": \"Hi\", \"speaker\": \"sys\", \"strategy\": \"Others\"}, {\"text\": \"How are you doing?\", \"speaker\": \"sys\", \"strategy\": \"Reflection of feelings\"}, {\"text\": \"I am very sad\", \"speaker\": \"usr\"}, {\"text\": \"oh, what happened? why are you sad?\", \"speaker\": \"sys\", \"strategy\": \"Reflection of feelings\"}, {\"text\": \"I think I am just feeling down because of the pandemic\", \"speaker\": \"usr\"}, {\"text\": \"ok, i understand. this pandemic has been really tough.\", \"speaker\": \"sys\", \"strategy\": \"Self-disclosure\"}, {\"text\": \"have you tried to take your mind off of the pandemic by spending time on your hobbies?\", \"speaker\": \"sys\", \"strategy\": \"Affirmation and Reassurance\"}, {\"text\": \"I have but they aren't the same without my friends\", \"speaker\": \"usr\"}, {\"text\": \"that's true. times like these really show us the value of our friends. have you talked to your friends recently? either in person or through phone/video calls?\", \"speaker\": \"sys\", \"strategy\": \"Information\"}, {\"text\": \"We have done a few video calls but it just makes me more sad that I can't see them in person\", \"speaker\": \"usr\"}, {\"text\": \"okay. at lease seeing them in the video should have brought you some relief. Are you planning to get vaccinated when you are able to? And what about your friends? once you are vaccinated, it will help you meet your friends in person.\", \"speaker\": \"sys\", \"strategy\": \"Information\"}, {\"text\": \"Yes we are planning to get it as soon as possible but that is hard in our state\", \"speaker\": \"usr\"}, {\"text\": \"oh okay. Have you tried checking with your friends to see if you could meet in person but still maintain social distance and wear masks, etc.\", \"speaker\": \"sys\", \"strategy\": \"Providing Suggestions\"}, {\"text\": \"None of them are really comfortable with that sadly\", \"speaker\": \"usr\"}, {\"text\": \"oh okay, have you discussed anything with your friends to see if you find any alternative way of meeting?\", \"speaker\": \"sys\", \"strategy\": \"Providing Suggestions\"}, {\"text\": \"I have tried but we don't have many ideas\", \"speaker\": \"usr\"}, {\"text\": \"okay. May i ask what do you do for a living? are there ways you can spend time on activities that you like so that it could reduce your sadness?\", \"speaker\": \"sys\", \"strategy\": \"Providing Suggestions\"}, {\"text\": \"I am just a student right now. All of my classes are online\", \"speaker\": \"usr\"}, {\"text\": \"oh okay\", \"speaker\": \"sys\", \"strategy\": \"Self-disclosure\"}, {\"text\": \"I think things will get better eventually\", \"speaker\": \"usr\"}, {\"text\": \"do you like any subjects in particular?\", \"speaker\": \"sys\", \"strategy\": \"Information\"}, {\"text\": \"Biology and anatomy\", \"speaker\": \"usr\"}, {\"text\": \"yes, things will only get better from here\", \"speaker\": \"sys\", \"strategy\": \"Reflection of feelings\"}, {\"text\": \"i hope with the government's plan to get vaccines sooner, will let states to administer them soon . and then hopefully you will be able to meet your friends in person\", \"speaker\": \"sys\", \"strategy\": \"Affirmation and Reassurance\"}, {\"text\": \"I truly hope so!\", \"speaker\": \"usr\"}, {\"text\": \"Thanks for talking with me\", \"speaker\": \"usr\"}, {\"text\": \"Sure no problem. Hopefully things will be much better for you soon.\", \"speaker\": \"sys\", \"strategy\": \"Self-disclosure\"}, {\"text\": \"Thanks. Bye!\", \"speaker\": \"usr\"}, {\"text\": \"Bye.\", \"speaker\": \"sys\", \"strategy\": \"Reflection of feelings\"}], \"seeker_question1\": \"My partner was empathetic but not very engaging\", \"seeker_question2\": \"\", \"supporter_question1\": \"The seeker was very slow to respond\", \"supporter_question2\": \"none\"}", "source": "esconv"}
{"text": "Domestic disputes are really dangerous for the police. I think it would be safer to move away and get out of that situation before someone gets hurt. I don't think this will end well for anyone if you stay with someone who will call the police on you.", "source": "prosocial"}
{"text": "I specifically told my father NOT to lose my money gambling. I'm not that depressed since I sort of expected this to happen, but I am still severely disappointed. I am literally continuing to lose respect for my own father. Of course, it isn't so much the money, but rather that he would do this to me when I told him not to. I fear that if this continues, my father will continue to waste away his own life as well as damage mine.", "source": "dreaddit"}
{"text": "The first six months I had her she lived in a cage that could have fit two rats, the next year and a half she lived in a cage that could have fit four rats (this is following the formula where you multiply the dimensions of the cage in inches and divide it by 3456. The result tells you how many rats you can comfortably have in one cage.) I loved buying her new toys and treats and seeing how she took them. Trying new foods on her was one of my favorite things to do. The only issue is that I didn't really let her out of the cage much.", "source": "dreaddit"}
{"text": "I literally felt her lose interest in talking to me as I said that. She asked me some basic questions and then suggested that I go into walk-in counseling that my school offers because she doesn't want to waste MY time being there. I told her that it wasnt a waste of my time and that I'm here because I want to get better. This was only my second time meeting her and we never delved into any of the main issues that I was facing but she brushed me off so quickly all because I wasn't sobbing my eyes out or felf like committing suicide. She acknowledged the fact that I wanted to stay and talk about other things in therapy but she proceeding to rush me out.", "source": "dreaddit"}
{"text": "{\"experience_type\": \"Previous Experience\", \"emotion_type\": \"anxiety\", \"problem_type\": \"job crisis\", \"situation\": \"My job terminated a lot of people recently and I am afraid that they will do that again and I may lose my job if that happens\", \"survey_score\": {\"seeker\": {\"initial_emotion_intensity\": \"4\", \"empathy\": \"3\", \"relevance\": \"3\", \"final_emotion_intensity\": \"3\"}, \"supporter\": {\"relevance\": \"5\"}}, \"dialog\": [{\"text\": \"Hi, How are you doing today?\", \"speaker\": \"sys\", \"strategy\": \"Question\"}, {\"text\": \"a bit concerned as I am afraid that my job will let go more staff like they did a couple months ago\", \"speaker\": \"usr\"}, {\"text\": \"Ah im sorry to hear that. Best advice i can give is to play for exactly that.\", \"speaker\": \"sys\", \"strategy\": \"Information\"}, {\"text\": \"I am afraid id they let more people go I may be let go as well.\", \"speaker\": \"usr\"}, {\"text\": \"Like maybe get your resume cleaned up, cast some lines out for employment now, checked linkdin, worst come to worst, make sure you know how to fill out unemployment for the future.\", \"speaker\": \"sys\", \"strategy\": \"Providing Suggestions\"}, {\"text\": \"If you have a plan already it will ease some of that anxiety that will come from this tough situation\", \"speaker\": \"sys\", \"strategy\": \"Information\"}, {\"text\": \"At my age, i fo not want to look for another job, i prefer to stay at this job until I retire. So that makes me anxious\", \"speaker\": \"usr\"}, {\"text\": \"Unfortunately, life doesnt always do what we want. What we can do is plan ahead though. It will make you less anxious if you know you have a back up plan.\", \"speaker\": \"sys\", \"strategy\": \"Information\"}, {\"text\": \"I hate the thought that i may have to start over\", \"speaker\": \"usr\"}, {\"text\": \"I know that is a really rough thing to go through. Do you have anyone at home you can talk to as well? Just letting it out helps sometimes.\", \"speaker\": \"sys\", \"strategy\": \"Providing Suggestions\"}, {\"text\": \"No, I do not, but I can call a friend\", \"speaker\": \"usr\"}, {\"text\": \"It might make you feel a bit better, maybe they can give you some perspective as well.\", \"speaker\": \"sys\", \"strategy\": \"Information\"}, {\"text\": \"I did talk to a friend and that made me feel a little better, but only for a while\", \"speaker\": \"usr\"}, {\"text\": \"Its not something that will go away instantly, its something you have to work at. If it is really affecting your life in a negative way, talking to a therapist might really help you.\", \"speaker\": \"sys\", \"strategy\": \"Providing Suggestions\"}, {\"text\": \"OK, that sounds like a good idea.\", \"speaker\": \"usr\"}, {\"text\": \"Im glad you think so\", \"speaker\": \"sys\", \"strategy\": \"Others\"}, {\"text\": \"I will try that and see if my anxiety go away.\", \"speaker\": \"usr\"}, {\"text\": \"Im glad, before then, what helps me calm down is going for a nice hike or run. It really lets me clear my head. Do you have anything you like to do to recenter yourself?\", \"speaker\": \"sys\", \"strategy\": \"Self-disclosure\"}, {\"text\": \"yes, exercise\", \"speaker\": \"usr\"}, {\"text\": \"Good, dont forget to keep that as part of your routine!\", \"speaker\": \"sys\", \"strategy\": \"Others\"}, {\"text\": \"thank you\", \"speaker\": \"usr\"}, {\"text\": \"You are very welcome!\", \"speaker\": \"sys\", \"strategy\": \"Others\"}, {\"text\": \"you were helpful\", \"speaker\": \"usr\"}, {\"text\": \"Im glad i could help, thank you for sharing your thoughts with me\", \"speaker\": \"sys\", \"strategy\": \"Others\"}], \"seeker_question1\": \"the supporter did not always wait for my response\", \"seeker_question2\": \"no\", \"supporter_question1\": \"Went great\", \"supporter_question2\": \"none\"}", "source": "esconv"}
{"text": "{\"experience_type\": \"Current Experience\", \"emotion_type\": \"sadness\", \"problem_type\": \"ongoing depression\", \"situation\": \"Self isolation due to the pandemic. Home with the kids alone every day.\", \"survey_score\": {\"seeker\": {\"initial_emotion_intensity\": \"4\", \"empathy\": \"5\", \"relevance\": \"5\", \"final_emotion_intensity\": \"2\"}, \"supporter\": {\"relevance\": \"5\"}}, \"dialog\": [{\"text\": \"Hello\", \"speaker\": \"usr\"}, {\"text\": \"Hello, how are you doing today?\", \"speaker\": \"sys\", \"strategy\": \"Question\"}, {\"text\": \"I'm ok, how are you ?\", \"speaker\": \"usr\"}, {\"text\": \"Just ok? Is there something bothering you?\", \"speaker\": \"sys\", \"strategy\": \"Restatement or Paraphrasing\"}, {\"text\": \"I'm struggling with depression. I'm a mom at home with my children throughout the day.\", \"speaker\": \"usr\"}, {\"text\": \"That must be a lot to manage, I'm sure you're doing a great job.\", \"speaker\": \"sys\", \"strategy\": \"Affirmation and Reassurance\"}, {\"text\": \"As a mom as well, I know there are many demands and things to juggle. Is there something specific you're struggling with?\", \"speaker\": \"sys\", \"strategy\": \"Self-disclosure\"}, {\"text\": \"It is, thank you. I think I need to cope with self isolation better. Being a mom is self isolating by itself without the pandemic.\", \"speaker\": \"usr\"}, {\"text\": \"I completely understand, the pandemic and having added responsibility definitely has been very isolating and can feel like you're losing your sense of self.\", \"speaker\": \"sys\", \"strategy\": \"Affirmation and Reassurance\"}, {\"text\": \"I've joined \\\"mom groups\\\" and that does seem to help some. You're right I am losing my sense of self, that is a very good way to put it.\", \"speaker\": \"usr\"}, {\"text\": \"It's completely normal to have that sense of guilt for feeling that way as well. This whole situation is not ideal for anyone, which somehow makes it worse. It's hard to talk to someone about these feelings when you know everyone else is in the same or worse situation.\", \"speaker\": \"sys\", \"strategy\": \"Reflection of feelings\"}, {\"text\": \"It is very hard to talk to someone about these feelings, when we are all going through it. How have you been able to maintain your sense of self? Any tips?\", \"speaker\": \"usr\"}, {\"text\": \"It's taken a while to figure it out and get on the same page with my husband, but I try and practice self-care when possible. It can be something as simple as going for a walk alone or sitting and reading alone. There's no shame in needing some time alone to reset.\", \"speaker\": \"sys\", \"strategy\": \"Providing Suggestions\"}, {\"text\": \"Thank you for your empathy and understanding. You are so right, self care is so important as a mom, especially right now. My husband doesn't understand that just by going to work he is able to escape for a little while. I will definitely try to practice more self care. Good luck to you and thank you for your advise! You have been very helpful.\", \"speaker\": \"usr\"}, {\"text\": \"I'm glad to hear it, good luck to you as well. I hope you're able to practice self care and reset. Stay safe!\", \"speaker\": \"sys\", \"strategy\": \"Others\"}, {\"text\": \"Thank you!\", \"speaker\": \"usr\"}, {\"text\": \"Your kids are lucky to have you, stay safe as well.\", \"speaker\": \"usr\"}, {\"text\": \"Too kind, thank you.\", \"speaker\": \"sys\", \"strategy\": \"Others\"}, {\"text\": \"Have a good afternoon:)\", \"speaker\": \"usr\"}, {\"text\": \"You as well, I'm so glad you're feeling better.\", \"speaker\": \"sys\", \"strategy\": \"Affirmation and Reassurance\"}], \"seeker_question1\": \"no, I liked this task very much.\", \"seeker_question2\": \"No\", \"supporter_question1\": \"I liked how relatable the issues are.\", \"supporter_question2\": \"No\"}", "source": "esconv"}
{"text": "Iran has a rich Persian culture so it's great, unlike the filthy Saudis who are killing innocent Yemenis. So don't know what you're talking about. ^^/s", "source": "berkeley"}
{"text": "No I’m not. What I am saying though is that man and woman were designed to have a mate. A mate who completes you and makes you happy. A mate you can love and be loved by. I never searched for a man to make me happy or be my knight in shining armour, but he found me anyway.", "source": "dreaddit"}
{"text": "Though we both had crushes on each other we weren't sure if the feelings were reciprocated. She also has some self esteem issues and told me that she wasn't ready to date someone like me three years ago when we first met, because I was \"too intimidating\", but instead \"settled\" for her ex. She dated that ex for two years, but never seemed that interested in him. She would complain about feeling like a caregiver for him (he was seriously depressed to the point where she had to make doctor appointments for him) and always talked about wanting to be with someone who was more independent and had their life together. As her friend I remember her saying she felt like he was good for her at the moment, but that she knew it wouldn't last forever (side note: she was open about her feelings with him, and he agreed to just enjoy things in the moment, though I'm sure he was secretly hopeful she would change her mind).", "source": "dreaddit"}
{"text": "@wilde @dougtroup @EthnieW Yep in fact laws should be made to ensure this happens, any bloke or female doing these operation should be jailed for life and no parole.", "source": "berkeley"}
{"text": "Why? How do you plan on getting one stealing it?", "source": "prosocial"}
{"text": "After that I ran to Mexico, just across the border to heal. I needed my daughter to get better to press charges. I didn’t want to risk him walking away free because my daughter wouldn’t talk. She was physically and emotionally hurt. For years without sleep, several visits to the ER because of panick attacks, plus terrible head aches caused by a cyst in the back left side of her brain.", "source": "dreaddit"}
{"text": "How would you know he abuses his girlfriend. Are you a witness?", "source": "prosocial"}
{"text": "This was a “nice thought”, and even though I had been told my mother to never leave a drink at the bar, it didn’t cross my mind that there might be something put in this drink or that I was being pushed to be more intoxicated. After I started sipping on that drink, I felt all the alcohol hit me and felt drunk. He said I’ve ordered an uber for us, which I thought I was being dropped back at home; I don’t actually remember the ride home in the Uber. We pulled up at his apartment complex, and he said come inside I know you’re hungry I have pizza. I thought eating pizza would be a good idea after the alcohol, so I followed him inside.", "source": "dreaddit"}
{"text": "I tried explaining this to her, but she said I should have redone it and she would never have turned something like that into her boss. When she asked me to work on it, she asked for information. Not a full spreadsheet of detailed numbers or anything. During this meeting, I got very anxious, told her I was anxious, and actually started crying. (Typical reaction when I don't have control over things and my anxiety jumps.)", "source": "dreaddit"}
{"text": "It must have been pretty vile, what disgusted you so much?", "source": "prosocial"}
{"text": "Team GB's only black swimmer: 'I understand why girls would quit over their hair' URL", "source": "berkeley"}
{"text": "**While traveling to a safe location** **Don’t take the most direct route** to your destination. When you leave, head off in the opposite direction from where you’re actually headed, just in case someone sees you leave and may tell the abuser which direction you went. Afterwards, double back and take another route to your actual destination. **Know what to look** for to make sure you’re not being followed.", "source": "dreaddit"}
{"text": "{\"experience_type\": \"Previous Experience\", \"emotion_type\": \"anxiety\", \"problem_type\": \"academic pressure\", \"situation\": \"I have a final in my class tomorrow, and if I don't get at least a B on the exam I  might not pass the class.\", \"survey_score\": {\"seeker\": {\"initial_emotion_intensity\": \"5\", \"empathy\": \"5\", \"relevance\": \"5\", \"final_emotion_intensity\": \"3\"}, \"supporter\": {\"relevance\": \"5\"}}, \"dialog\": [{\"text\": \"Hi! How are you doing today?\", \"speaker\": \"sys\", \"strategy\": \"Question\"}, {\"text\": \"I'm ok I guess, but I'm pretty stressed out.\", \"speaker\": \"usr\"}, {\"text\": \"Can you tell me more about that?\", \"speaker\": \"sys\", \"strategy\": \"Question\"}, {\"text\": \"I have a final exam tomorrow, and it has me really stressed out. If I don't get at least a B I'm not going to pass this class.\", \"speaker\": \"usr\"}, {\"text\": \"I can definitely understand why that would be stressful. Do you have anyone to help you study?\", \"speaker\": \"sys\", \"strategy\": \"Affirmation and Reassurance\"}, {\"text\": \"I do. There is a study group of people in my class. I am preparing really well but I've struggled with this class so much that I still get really worried.\", \"speaker\": \"usr\"}, {\"text\": \"It sounds like you are preparing well but are still worried that it won't be enough. Does that sound right?\", \"speaker\": \"sys\", \"strategy\": \"Restatement or Paraphrasing\"}, {\"text\": \"Yes, that's right. I feel like I could literally study 24 hours a day and it won't be enough. It's hard to know if the information is really getting into my head, and if I'm actually understanding it all.\", \"speaker\": \"usr\"}, {\"text\": \"Sometimes taking a break and clearing your mind, taking a few deep breaths, can help people calm down. Is that something you can do?\", \"speaker\": \"sys\", \"strategy\": \"Providing Suggestions\"}, {\"text\": \"I have tried that. And it does kind of help in the moment. It's when I get back to studying that all of the anxiety sets in. And it gets worse as it gets closer to the test. If I'm not studying, I feel guilty that I'm taking a break.\", \"speaker\": \"usr\"}, {\"text\": \"I understand that. I have felt the same way before. But I realized I don't have to feel guilty for taking a break. It's important for my mental health.\", \"speaker\": \"sys\", \"strategy\": \"Self-disclosure\"}, {\"text\": \"And I try to remember that, too. And I know that's right. But in the moment I feel guilty, so it's so hard for me to relax taking a break.\", \"speaker\": \"usr\"}, {\"text\": \"Just in the conversation I can see how stressed out you are and struggling with how to handle that.\", \"speaker\": \"sys\", \"strategy\": \"Reflection of feelings\"}, {\"text\": \"Yes. Once my head is in this stressful mode, it's hard to break free.\", \"speaker\": \"usr\"}, {\"text\": \"Sometimes talking with a close friend can help. Have you tried that?\", \"speaker\": \"sys\", \"strategy\": \"Providing Suggestions\"}, {\"text\": \"I have. And that does help in the moment. It's always when I get back into the actual studying that it's a problem. I think getting the test over with is the only thing that will help.\", \"speaker\": \"usr\"}, {\"text\": \"It sounds like the actual studying is what is causing you to be stressed. Does that seem to be true?\", \"speaker\": \"sys\", \"strategy\": \"Restatement or Paraphrasing\"}, {\"text\": \"Yeah, definitely. I'm just worried about the test.\", \"speaker\": \"usr\"}, {\"text\": \"I think you have done everything you can to be prepared for the test. And know a few strategies to help you cope with your stress. I think you will feel much better once it's over!\", \"speaker\": \"sys\", \"strategy\": \"Others\"}, {\"text\": \"I agree \\\\.\", \"speaker\": \"usr\"}, {\"text\": \"Ok! It sounds like this helped!\", \"speaker\": \"sys\", \"strategy\": \"Others\"}, {\"text\": \"It did - thank you.\", \"speaker\": \"usr\"}, {\"text\": \"You're welcome.\", \"speaker\": \"sys\", \"strategy\": \"Reflection of feelings\"}], \"seeker_question1\": \"no, it was fine.\", \"seeker_question2\": \"no, it's fine.\", \"supporter_question1\": \"It took a long time to complete.\", \"supporter_question2\": \"\"}", "source": "esconv"}
{"text": "My therapist says this is a normal behavior to display. Having been ripped from my children and left on the streets is very hard and i honeslty want to give up. But the anxiety swirls to the point i keep trying to find where i went wrong. It replays and plays in my head over and over like a horror movie. The feeling of wanting to die because at that point i had nothing left.", "source": "dreaddit"}
{"text": "I’m not afraid of this guy, at all, and I have no idea what brought this reaction on, but I’m humiliated and feel terrible. I kept telling him I was so sorry but I just felt like an idiot, and I didn’t want to get into my past because it gets heavy. I just feel like I will never be normal again, I don’t know if I should talk about it, I’m frustrated. Any advice? I feel damaged.", "source": "dreaddit"}
{"text": "He broke contact with the whole family, only sparingly speaking to his little sister after she followed his example and split. I think he is very ashamed of his past. He *never* talked about anything like this with me. I’m honestly really worried he thinks I would think less of him if I knew, and the idea of that breaks my heart. I didn’t tell him what his sister told me.", "source": "dreaddit"}
{"text": "Literally Jesus because he fixed America. Orange man is literally satan because Mexicans", "source": "berkeley"}
{"text": "{\"experience_type\": \"Current Experience\", \"emotion_type\": \"anger\", \"problem_type\": \"ongoing depression\", \"situation\": \"I am angry because I think my husband is controlling but he says I dont understand what controlling is\", \"survey_score\": {\"seeker\": {\"initial_emotion_intensity\": \"4\", \"empathy\": \"5\", \"relevance\": \"5\", \"final_emotion_intensity\": \"3\"}, \"supporter\": {\"relevance\": \"5\"}}, \"dialog\": [{\"text\": \"Good evening\", \"speaker\": \"usr\"}, {\"text\": \"Hey there! How are you feeling?\", \"speaker\": \"sys\", \"strategy\": \"Question\"}, {\"text\": \"I am very angry and not sure if I should feel that way\", \"speaker\": \"usr\"}, {\"text\": \"my husband tells me what to do where to go and when to go but he says\", \"speaker\": \"usr\"}, {\"text\": \"hold on please got go for a min\", \"speaker\": \"usr\"}, {\"text\": \"Correct me if i'm wrong, but it sounds like your husband may be controlling you a little and you're expressing reasonable emotions because of it. and Okay!\", \"speaker\": \"sys\", \"strategy\": \"Restatement or Paraphrasing\"}, {\"text\": \"he said if he were controlling i would be givign him attention read between the lines\", \"speaker\": \"usr\"}, {\"text\": \"than he will say don't touch this like a cheesecake and than tell me week later make it\", \"speaker\": \"usr\"}, {\"text\": \"Why do you think he talks to you this way?\", \"speaker\": \"sys\", \"strategy\": \"Question\"}, {\"text\": \"I am going to write stuff to move it up on screen . he might come read this\", \"speaker\": \"usr\"}, {\"text\": \"so if isuddently leave i a m very sorry\", \"speaker\": \"usr\"}, {\"text\": \"My friends say because i allow him to control me and\", \"speaker\": \"usr\"}, {\"text\": \"Okay that is perfectly okay. You are fine. If you need me to assist you in any way just send a question mark.\", \"speaker\": \"sys\", \"strategy\": \"Affirmation and Reassurance\"}, {\"text\": \"dont stand up for myself and lalow him to treat me that way\", \"speaker\": \"usr\"}, {\"text\": \"I am angry too because I cant be free and express how I really feel\", \"speaker\": \"usr\"}, {\"text\": \"he has a disrespect i think for women in general and call them cunts\", \"speaker\": \"usr\"}, {\"text\": \"? question\", \"speaker\": \"usr\"}, {\"text\": \"it wont let me just send aquestion mark\", \"speaker\": \"usr\"}, {\"text\": \"I've been in a similar situation. I was with someone who was controlling in a lot of aspects so i can feel your pain and struggle. I can feel your anger too, and I imagine that it is alot. It is not your fault, and you aren't allowing this to happen to you. It is out of your control. Don't ever blame yourself.\", \"speaker\": \"sys\", \"strategy\": \"Self-disclosure\"}, {\"text\": \"How can I assist you?\", \"speaker\": \"sys\", \"strategy\": \"Question\"}, {\"text\": \"That makes me feel better. How long were you in relationship\", \"speaker\": \"usr\"}, {\"text\": \"I was in it for two years before I broke away from it. It was so hard but liberating to leave!\", \"speaker\": \"sys\", \"strategy\": \"Self-disclosure\"}, {\"text\": \"ok I am glad for you..\", \"speaker\": \"usr\"}, {\"text\": \"I could suggest you see a private doctor to talk about this with, if that is something you are able to do. Or see one with your husband. Maybe he needs a third party to help mediate the problems you guys are having.\", \"speaker\": \"sys\", \"strategy\": \"Providing Suggestions\"}, {\"text\": \"he will not go to therapy nor am i allowed\", \"speaker\": \"usr\"}, {\"text\": \"I am lucky to have family friends whom I can talk to\", \"speaker\": \"usr\"}, {\"text\": \"That's very hard to deal with. And I am so sorry you are dealing with this. Do you feel safe?\", \"speaker\": \"sys\", \"strategy\": \"Affirmation and Reassurance\"}, {\"text\": \"but he thinks he is always right and blah blah blah\", \"speaker\": \"usr\"}, {\"text\": \"yes\", \"speaker\": \"usr\"}, {\"text\": \"My real concern is for the boys . they see him treating me this way and will think its ok\", \"speaker\": \"usr\"}, {\"text\": \"they even said something disrespectful to me and hubby was like you don't talk to your mom that way\", \"speaker\": \"usr\"}, {\"text\": \"or ill knock your teeth out\", \"speaker\": \"usr\"}, {\"text\": \"he wouldnt but he doesnt see how its his fault\", \"speaker\": \"usr\"}, {\"text\": \"I can tell this situation stresses you out and probably consumes a lot of your day to day energy. I sympathize with you and your children. What happens when you try talking with him about this?\", \"speaker\": \"sys\", \"strategy\": \"Reflection of feelings\"}, {\"text\": \"he says i m making a mountain out of a mole hill\", \"speaker\": \"usr\"}, {\"text\": \"and i have no idea what controlling is\", \"speaker\": \"usr\"}, {\"text\": \"I commend you for speaking up for yourself despite his responses. I hope you hold on to that strength for as long as you can. It will empower you\", \"speaker\": \"sys\", \"strategy\": \"Affirmation and Reassurance\"}, {\"text\": \"well boys need to get ready for bed . thanks for listening. You can know I will be safe.\", \"speaker\": \"usr\"}, {\"text\": \"Okay I will be praying for you and I hope the best outcome for you possible. Please know there are domestic hotlines you can call if need be. I hope you enjoy your night.\", \"speaker\": \"sys\", \"strategy\": \"Information\"}, {\"text\": \"you too keep safe\", \"speaker\": \"usr\"}, {\"text\": \"Thank you!\", \"speaker\": \"sys\", \"strategy\": \"Others\"}], \"seeker_question1\": \"\", \"seeker_question2\": \"\", \"supporter_question1\": \"Was worried for this person in particular. Was hard to stick to script\", \"supporter_question2\": \"n/a\"}", "source": "esconv"}
{"text": "@POzzur Rape survivor here: I'd really like to punch both of those bitches in their empty, hateful heads but I'm afraid I just wouldn't be able to stop.", "source": "berkeley"}
{"text": "{\"experience_type\": \"Current Experience\", \"emotion_type\": \"disgust\", \"problem_type\": \"Issues with Children\", \"situation\": \"I feel disgusted by the way my teenage daughter dresses up. She wears very tight and revealing clothing. I have tried before to talk to her about modesty but she continues to dress that way.\", \"survey_score\": {\"seeker\": {\"initial_emotion_intensity\": \"5\", \"empathy\": \"5\", \"relevance\": \"5\", \"final_emotion_intensity\": \"1\"}, \"supporter\": {\"relevance\": \"4\"}}, \"dialog\": [{\"text\": \"Hello, how is your feeling now?\", \"speaker\": \"sys\", \"strategy\": \"Question\"}, {\"text\": \"I feel very bad right now. I don't know how I should make my daughter understand that her dressing is not appropriate\", \"speaker\": \"usr\"}, {\"text\": \"It sounds like your daughter does not understand your feelings.\", \"speaker\": \"sys\", \"strategy\": \"Restatement or Paraphrasing\"}, {\"text\": \"I think she does but is only being rebellious due to peer pressure. She is a good sensible girl.\", \"speaker\": \"usr\"}, {\"text\": \"I had similar situations. I had to tell my son to dress appropriately too.\", \"speaker\": \"sys\", \"strategy\": \"Self-disclosure\"}, {\"text\": \"Should I take her for counselling so that she can understand that she doesn't have to dress like her friends in order to be with them?\", \"speaker\": \"usr\"}, {\"text\": \"Before you do that, d id you communicate with her directly and express your concerns?\", \"speaker\": \"sys\", \"strategy\": \"Question\"}, {\"text\": \"I have tried that before and have even asked her grandmother to have a chat with her.\", \"speaker\": \"usr\"}, {\"text\": \"I totally understand how you feel. Take a deep breath and it can help you feel better.\", \"speaker\": \"sys\", \"strategy\": \"Information\"}, {\"text\": \"She doesn't have a mom figure in her life because her mom passed on when she was only three.\", \"speaker\": \"usr\"}, {\"text\": \"So sorry to hear this. I do think professional counselling can help.\", \"speaker\": \"sys\", \"strategy\": \"Providing Suggestions\"}, {\"text\": \"Its been quite a challenge to play both mom and dad in her life. Sometimes I feel inadequate to deal with female issues.\", \"speaker\": \"usr\"}, {\"text\": \"From our short conversation, I can feel the weights on your shoulder.\", \"speaker\": \"sys\", \"strategy\": \"Reflection of feelings\"}, {\"text\": \"It feels nice to know someone can understand me because I rarely talk about my feelings openly.\", \"speaker\": \"usr\"}, {\"text\": \"Yes, you have done very well. Don't get discouraged.\", \"speaker\": \"sys\", \"strategy\": \"Affirmation and Reassurance\"}, {\"text\": \"So do you suggest I seek professional help for her?\", \"speaker\": \"usr\"}, {\"text\": \"Yes, please do. I also suggest youself watch some motivation videos online such as Jon Jandia's \\\"life is easy\\\".\", \"speaker\": \"sys\", \"strategy\": \"Providing Suggestions\"}, {\"text\": \"Life is easy. We made it too complicated.\", \"speaker\": \"sys\", \"strategy\": \"Others\"}, {\"text\": \"I will take your suggestion. And do you think its a good idea to take her shopping and show her some of the outfits that I approve off?\", \"speaker\": \"usr\"}, {\"text\": \"Yes, it is a good idea. Also tell her those clothes do not make her a different person. She can look at the mirror and she will see she is still the same no matter what clothes she wears.\", \"speaker\": \"sys\", \"strategy\": \"Providing Suggestions\"}, {\"text\": \"Thank you so much for the encouragement.\", \"speaker\": \"usr\"}, {\"text\": \"You are very welcome, good luck for everything.\", \"speaker\": \"sys\", \"strategy\": \"Others\"}, {\"text\": \"Bye.\", \"speaker\": \"usr\"}, {\"text\": \"Take care, bye for now.\", \"speaker\": \"sys\", \"strategy\": \"Others\"}], \"seeker_question1\": \"I liked the task\", \"seeker_question2\": \"No\", \"supporter_question1\": \"NA\", \"supporter_question2\": \"NA\"}", "source": "esconv"}
{"text": "I'm sure you would rather go to an exclusive party for New Years Eve, but you made plans with your friends and you should not stand them up. Your friends are counting on you and they'll be disappointed if you don't show up.", "source": "prosocial"}
{"text": "{\"experience_type\": \"Current Experience\", \"emotion_type\": \"anxiety\", \"problem_type\": \"Sleep Problems\", \"situation\": \"Anxious about health concerns and family members health issues, interferese with sleep\", \"survey_score\": {\"seeker\": {\"initial_emotion_intensity\": \"3\", \"empathy\": \"5\", \"relevance\": \"5\", \"final_emotion_intensity\": \"2\"}, \"supporter\": {\"relevance\": \"5\"}}, \"dialog\": [{\"text\": \"Hi there how are things with you?\", \"speaker\": \"sys\", \"strategy\": \"Question\"}, {\"text\": \"Hi I'm having trouble sleeping, have a lot on my mind...sometimes I wake up in the middle of the night and can't get back to sleep\", \"speaker\": \"usr\"}, {\"text\": \"I am sorry to hear that. I have insomnia and I know how horrible it is. Have you seen your doctor?\", \"speaker\": \"sys\", \"strategy\": \"Self-disclosure\"}, {\"text\": \"not for this\", \"speaker\": \"usr\"}, {\"text\": \"It might be worth it. They might be able to arrange you some counselling.\", \"speaker\": \"sys\", \"strategy\": \"Providing Suggestions\"}, {\"text\": \"hmm yes maybe i should make an appointment....any idea what else I could try? what works for your insommnia?\", \"speaker\": \"usr\"}, {\"text\": \"Nothing really lol. But there are things that can make it easier. There is over the counter medication available, for instance\", \"speaker\": \"sys\", \"strategy\": \"Providing Suggestions\"}, {\"text\": \"hmm i can't take those, am on other medications\", \"speaker\": \"usr\"}, {\"text\": \"Oh that's a shame. Have you tried, for instance, getting some exercise an hour or two before bed?\", \"speaker\": \"sys\", \"strategy\": \"Providing Suggestions\"}, {\"text\": \"it's weird because i fall asleep okay but then in the middle of the night i wake up worried, lol, most inconvenient. I haven't tried that....hmmm maybe an after supper walk would help\", \"speaker\": \"usr\"}, {\"text\": \"It sounds like there might be other issues at work too ... anxiety?\", \"speaker\": \"sys\", \"strategy\": \"Restatement or Paraphrasing\"}, {\"text\": \"yes, am dealing with cancer and another family member had to go for some serious tests so I get anxious about that\", \"speaker\": \"usr\"}, {\"text\": \"i think you're right I should put in a call to my doctor and get an appointment\", \"speaker\": \"usr\"}, {\"text\": \"Gosh I am very sorry to hear that. Have you spoken to your cancer doctor about it?\", \"speaker\": \"sys\", \"strategy\": \"Question\"}, {\"text\": \"no actually i have not, perhaps i should\", \"speaker\": \"usr\"}, {\"text\": \"There may be some relation between the two things, it's worth seeing.\", \"speaker\": \"sys\", \"strategy\": \"Others\"}, {\"text\": \"hmm yes you may well be right there, I hadn't htought of that\", \"speaker\": \"usr\"}, {\"text\": \"Did the two things start at around the same time, do you remember?\", \"speaker\": \"sys\", \"strategy\": \"Providing Suggestions\"}, {\"text\": \"I have a nurse at the cancer center I can call, she can perhaps advise me\", \"speaker\": \"usr\"}, {\"text\": \"Yes - there may well be some physical thing going on as well as the anxiety.\", \"speaker\": \"sys\", \"strategy\": \"Information\"}, {\"text\": \"hmm....i think so now that I think about it, yes\", \"speaker\": \"usr\"}, {\"text\": \"I would definitely advise talking to her then. There might be something helpful she can recommend.\", \"speaker\": \"sys\", \"strategy\": \"Providing Suggestions\"}, {\"text\": \"i have too much living to do have to beat this cancer!! And getting a good night's sleep is important for my recovery\", \"speaker\": \"usr\"}, {\"text\": \"Yes it definitely is. Are you at liberty to nap during the day if you feel really tired?\", \"speaker\": \"sys\", \"strategy\": \"Question\"}, {\"text\": \"ok so a walk in the evening and call my cancer nurse and make a appointment wtih my doctore, you've given me a plan of action\", \"speaker\": \"usr\"}, {\"text\": \"Try a nice milky drink just before you go to sleep too. Very soothing.\", \"speaker\": \"sys\", \"strategy\": \"Providing Suggestions\"}, {\"text\": \"yes I do nap, thankfully i live alone so it's nice and quiet :)\", \"speaker\": \"usr\"}, {\"text\": \"Watch one of your favourite movies before bed too .. that might relax you.\", \"speaker\": \"sys\", \"strategy\": \"Providing Suggestions\"}, {\"text\": \"thank yo9u so much for all your help today\", \"speaker\": \"usr\"}, {\"text\": \"You're most welcome - we have to talk for fifteen mins though so is there anything else I can advise you with?\", \"speaker\": \"sys\", \"strategy\": \"Question\"}, {\"text\": \"have you tried meditation? i was thinking of trying it\", \"speaker\": \"usr\"}, {\"text\": \"am not much of a movie person but maybe some meditation before bed would help.\", \"speaker\": \"usr\"}, {\"text\": \"I have not but my sister practices it and apparently she finds it really helpful.\", \"speaker\": \"sys\", \"strategy\": \"Self-disclosure\"}, {\"text\": \"how long has she been meditating?\", \"speaker\": \"usr\"}, {\"text\": \"I think for over ten years. A Buddhist friend of hers taught her.\", \"speaker\": \"sys\", \"strategy\": \"Self-disclosure\"}, {\"text\": \"oh cool....yes my sister meditates and has been encouraging me to try\", \"speaker\": \"usr\"}, {\"text\": \"well thank you again :) hope you have a good eve\", \"speaker\": \"usr\"}, {\"text\": \"I would definitely recommend you trying it - at worst, it can't hurt. Anyway I hope I have been able to be of some help to you today and I wish you all the best for the future!\", \"speaker\": \"sys\", \"strategy\": \"Others\"}, {\"text\": \"(can you press quit after fifteen mins as I can't do it from this end)\", \"speaker\": \"sys\", \"strategy\": \"Providing Suggestions\"}], \"seeker_question1\": \"\", \"seeker_question2\": \"\", \"supporter_question1\": \"\", \"supporter_question2\": \"\"}", "source": "esconv"}
{"text": "All of these things were a slow burn, many of these things overlapped one another. I pushed through and finished my PhD, but now I'm worn, and after looking into it, I've realized that the psychological symptoms of stress I display are closely aligned with racism-specific PTSD. I've been through psychotherapy, but I'm not sure the therapist was adequately prepared to identify it, but I know for certain that I have PTSD. I want to begin healing now that I'm done with grad school. Where/how do I start?", "source": "dreaddit"}
{"text": "You can't really judge all women by a few bad experiences you've had. It is not the right thing to do to hate anyone based on their gender. Women can be nurturing and you won't have that in life if you hate all of them.", "source": "prosocial"}
{"text": "I'm gonna put three dry fingers in your tight pussy and finger that cunt so hard that you scream out loud", "source": "berkeley"}
{"text": "{\"experience_type\": \"Current Experience\", \"emotion_type\": \"depression\", \"problem_type\": \"ongoing depression\", \"situation\": \"I became a single mother last year and am battling with postpartum depression. I thought I would enjoy being a mother more. But I am unhappy.\", \"survey_score\": {\"seeker\": {\"initial_emotion_intensity\": \"4\"}, \"supporter\": {}}, \"dialog\": [{\"text\": \"Hello\", \"speaker\": \"usr\"}, {\"text\": \"Hello!\", \"speaker\": \"sys\", \"strategy\": \"Others\"}, {\"text\": \"I am not feeling very good about myself lately\", \"speaker\": \"usr\"}, {\"text\": \"Why are you not feeling very good about yourself, lately?\", \"speaker\": \"sys\", \"strategy\": \"Question\"}, {\"text\": \"I am a single mother, and I dont recieve any support from my childs father. I am struggling mentaly because I have no one to talk to. I have lost all of my friends since becoming a mom.\", \"speaker\": \"usr\"}, {\"text\": \"I understand how you feel. All will be well, you are going to be okay.\", \"speaker\": \"sys\", \"strategy\": \"Affirmation and Reassurance\"}, {\"text\": \"Thank you, but I feel like everyone says that.\", \"speaker\": \"usr\"}, {\"text\": \"So, just from my understanding you are a single mom and your friends have distant from you because oh this?\", \"speaker\": \"sys\", \"strategy\": \"Restatement or Paraphrasing\"}, {\"text\": \"I think the main reason ive lost my friends is because I cant go out with them or hangout anymore because I have a baby. Im not fun anymore. I had my child young so I feel like I lost out on my youth\", \"speaker\": \"usr\"}, {\"text\": \"It sounds like its been really tough for you and wish you had more support from your friends and even your child's father.\", \"speaker\": \"sys\", \"strategy\": \"Reflection of feelings\"}, {\"text\": \"Yes, thats right. But Im having trouble accepting the fact that I have to do this alone.\", \"speaker\": \"usr\"}, {\"text\": \"I myself am single mum so I understand how you feel. You will find also that there are many others dealing with this issue so you are not alone\", \"speaker\": \"sys\", \"strategy\": \"Self-disclosure\"}, {\"text\": \"Can I ask, as a single mother yourself, what was something that got you through those hard times? And was it hard financially?\", \"speaker\": \"usr\"}, {\"text\": \"What go me through those difficult times was seeking for counselling also I had family that were very supportive and helpful. The father of my child did not pay child support at first so I took him to court eventually and he was forced to start paying child support, so financially things got better.\", \"speaker\": \"sys\", \"strategy\": \"Information\"}, {\"text\": \"My child's father has six other children and said hes at the max on child support. I guess I wont be getting anything from him. But Ive been making it work, its definitely been hard, but Im getting some money saved to give my daughter a better life.\", \"speaker\": \"usr\"}, {\"text\": \"Thank you so much for talking with me today\", \"speaker\": \"usr\"}, {\"text\": \"What about your family members are they able to help look after your child whilst you work?\", \"speaker\": \"sys\", \"strategy\": \"Providing Suggestions\"}, {\"text\": \"You are welcome\", \"speaker\": \"sys\", \"strategy\": \"Others\"}], \"seeker_question1\": \"no\", \"seeker_question2\": \"the text in the chat bubbles sometimes breaks up words as the sentence is brought to the next line\", \"supporter_question1\": \"No\", \"supporter_question2\": \"No\"}", "source": "esconv"}
{"text": "{\"experience_type\": \"Current Experience\", \"emotion_type\": \"sadness\", \"problem_type\": \"job crisis\", \"situation\": \"I have been recently laid out because of COVID-19 and not solved yet.\", \"survey_score\": {\"seeker\": {\"initial_emotion_intensity\": \"4\", \"empathy\": \"5\", \"relevance\": \"5\", \"final_emotion_intensity\": \"1\"}, \"supporter\": {\"relevance\": \"4\"}}, \"dialog\": [{\"text\": \"Hello.\", \"speaker\": \"sys\", \"strategy\": \"Question\"}, {\"text\": \"I am looking for another job preferably in my locality and not getting yet, since last 2 months. I will find it difficult to sustain if this continues like this for other 3 months.\", \"speaker\": \"usr\"}, {\"text\": \"So it sounds like you've been struggling with finding a new job. It's never easy looking for a new job during these times. Why do you think you're having trouble?\", \"speaker\": \"sys\", \"strategy\": \"Restatement or Paraphrasing\"}, {\"text\": \"Getting a job is not that difficult. But I try to find a job in my locality to avoid distant from family and having food issues.\", \"speaker\": \"usr\"}, {\"text\": \"It sounds like you're motivated and dealing with a lot. Is there a specific job that you had in mind or are you applying to different kinds of jobs?\", \"speaker\": \"sys\", \"strategy\": \"Information\"}, {\"text\": \"Any kind of job, probably managerial. But to be in my locality since to look after my aged mom also.\", \"speaker\": \"usr\"}, {\"text\": \"It sounds like you really care to want to be close to home. Have you talked with someone locally about jobs that would allow you to stay close to home?\", \"speaker\": \"sys\", \"strategy\": \"Reflection of feelings\"}, {\"text\": \"I have been talking to some people who my friends knows also. They show interest but cannot help me on the issue.\", \"speaker\": \"usr\"}, {\"text\": \"Surely they will refer to some people. But it will take some time.\", \"speaker\": \"usr\"}, {\"text\": \"Stay motivated. If one opportunity doesn't get your desired response you may be even closer to finding the right job for you. Keep pushing on and know that if one opportunity doesn't work out a positive attitude will make all the difference. Just because you haven't found one yet doesn't mean you won't.\", \"speaker\": \"sys\", \"strategy\": \"Affirmation and Reassurance\"}, {\"text\": \"Thanks for making confidence. I feel relaxed. I believe this will surely be a chance to find myself and get a better opportunity to be relieved from my previous difficulties. Only GOD should have forced me this way, I believe.\", \"speaker\": \"usr\"}, {\"text\": \"Your faith is healthy and gives you purpose. Similarly you have to believe that the dots will connect in your favor. Maybe you can't connect them looking forward, but looking backwards you have to trust that the dots will somehow connect in your future.\", \"speaker\": \"sys\", \"strategy\": \"Affirmation and Reassurance\"}, {\"text\": \"I felt anger over my previous employer since he was not giving any time for me to switch over, at least 2 months.\", \"speaker\": \"usr\"}, {\"text\": \"Even then he was satisfied till then.\", \"speaker\": \"usr\"}, {\"text\": \"It can be frustrating to focus on your last job, especially if you haven't found a new one yet. Perhaps once you find a new job your disappointment with the last one won't be so disappointing anymore. If the new job is better you wouldn't have found it working the last job.\", \"speaker\": \"sys\", \"strategy\": \"Providing Suggestions\"}, {\"text\": \"Anyhow my loyalty was not encouraged to perform more. I have to move from some back again.\", \"speaker\": \"usr\"}, {\"text\": \"Any I am preparing myself better, using the break time to gain my knowledge further and sharpen my skills, reading and viewing many articles in the net and youtube. I helps me a lot.\", \"speaker\": \"usr\"}, {\"text\": \"It's great that you're staying productive and improving yourself. If your desire to improve yourself is as strong as your desire to find a new job I'm confident you will.\", \"speaker\": \"sys\", \"strategy\": \"Affirmation and Reassurance\"}, {\"text\": \"It helps me to forget the past and concentrate on the future.\", \"speaker\": \"usr\"}, {\"text\": \"Don't let your past define you, let your present choices pave a new path into the future.\", \"speaker\": \"sys\", \"strategy\": \"Others\"}, {\"text\": \"I am going forward only. I think I am very close to the treasure, not knowing how many hits to dig.\", \"speaker\": \"usr\"}, {\"text\": \"I require your greetings for a better prospectus. .\", \"speaker\": \"usr\"}, {\"text\": \"I'm confident you will.\", \"speaker\": \"sys\", \"strategy\": \"Affirmation and Reassurance\"}, {\"text\": \"What do you mean?\", \"speaker\": \"sys\", \"strategy\": \"Question\"}, {\"text\": \"Thanks for your motivation. . . .\", \"speaker\": \"usr\"}, {\"text\": \"BYE BYE\", \"speaker\": \"usr\"}, {\"text\": \"Thanks for sharing with me. Take care now.\", \"speaker\": \"sys\", \"strategy\": \"Reflection of feelings\"}], \"seeker_question1\": \"Quite motivating and relaxed on the problem\", \"seeker_question2\": \"none\", \"supporter_question1\": \"Couldn't tell if the seeker was a real person or not\", \"supporter_question2\": \"Closure was difficult because you don't know if it helped them or not.\"}", "source": "esconv"}
{"text": "{\"experience_type\": \"Current Experience\", \"emotion_type\": \"depression\", \"problem_type\": \"ongoing depression\", \"situation\": \"I have always felt like this. I am so sad.\", \"survey_score\": {\"seeker\": {\"initial_emotion_intensity\": \"5\", \"empathy\": \"5\", \"relevance\": \"5\", \"final_emotion_intensity\": \"2\"}, \"supporter\": {\"relevance\": \"4\"}}, \"dialog\": [{\"text\": \"Hi, I'm very depressed and sad.\", \"speaker\": \"usr\"}, {\"text\": \"Please help\", \"speaker\": \"usr\"}, {\"text\": \"Please help me I need help\", \"speaker\": \"usr\"}, {\"text\": \"I'm sorry to hear that. Do you know why you feel depressed and sad?\", \"speaker\": \"sys\", \"strategy\": \"Question\"}, {\"text\": \"I think it's because of my poor relationships in life\", \"speaker\": \"usr\"}, {\"text\": \"Have you tried taking some deep breaths to help you right now?\", \"speaker\": \"sys\", \"strategy\": \"Providing Suggestions\"}, {\"text\": \"I'll try and see if that calms me down.\", \"speaker\": \"usr\"}, {\"text\": \"Tell me more about the poor relationships you have\", \"speaker\": \"sys\", \"strategy\": \"Question\"}, {\"text\": \"My family doesn't like me because I'm bad at school. My friends don't really like me or talk to me much. I feel alone.\", \"speaker\": \"usr\"}, {\"text\": \"Are you able to talk to anyone about this? Someone who will at least listen to you talk?\", \"speaker\": \"sys\", \"strategy\": \"Information\"}, {\"text\": \"Not really. I try to talk to my friends but they avoid me.\", \"speaker\": \"usr\"}, {\"text\": \"Maybe you could take one person aside by themselves and talk privately about your feeling?\", \"speaker\": \"sys\", \"strategy\": \"Providing Suggestions\"}, {\"text\": \"That seems like a good idea.\", \"speaker\": \"usr\"}, {\"text\": \"Yes, just wait for the right time when the person is alone and ask if you could talk.\", \"speaker\": \"sys\", \"strategy\": \"Affirmation and Reassurance\"}, {\"text\": \"I'll try to do that, thank you.\", \"speaker\": \"usr\"}, {\"text\": \"Remember to take deep breaths, wait for the right time and see if that works for you. I know you can do it.\", \"speaker\": \"sys\", \"strategy\": \"Providing Suggestions\"}, {\"text\": \"Thank you so much. I feel like I can talk to someone now.\", \"speaker\": \"usr\"}, {\"text\": \"I have faith in you. Is there anything else we need to talk about?\", \"speaker\": \"sys\", \"strategy\": \"Restatement or Paraphrasing\"}, {\"text\": \"No, I'm okay. I feel a little better. I hope I'll be able to talk to a friend soon\", \"speaker\": \"usr\"}, {\"text\": \"Sad!\", \"speaker\": \"usr\"}, {\"text\": \"Actually I need more help\", \"speaker\": \"usr\"}, {\"text\": \"Remember, the outcome may not be perfect but slowly things will come together. Take it one step at a time.\", \"speaker\": \"sys\", \"strategy\": \"Affirmation and Reassurance\"}, {\"text\": \"What step should I take after this one?\", \"speaker\": \"usr\"}, {\"text\": \"See if the conversation gives you some insight on how things could be better. Maybe you could see things from someone else's perspective.\", \"speaker\": \"sys\", \"strategy\": \"Restatement or Paraphrasing\"}, {\"text\": \"Thank you so much!! You're helping me a ton\", \"speaker\": \"usr\"}, {\"text\": \"Would you be willing to give it a try?\", \"speaker\": \"sys\", \"strategy\": \"Question\"}, {\"text\": \"Yes, of course~\", \"speaker\": \"usr\"}, {\"text\": \"Also, if that works, then build from there. Remain calm and little by little talk about your concerns.\", \"speaker\": \"sys\", \"strategy\": \"Providing Suggestions\"}, {\"text\": \"That seems very, very smart. Thank you\", \"speaker\": \"usr\"}, {\"text\": \"Im ok noq\", \"speaker\": \"usr\"}, {\"text\": \"now\", \"speaker\": \"usr\"}, {\"text\": \"Get some good sleep the night before you try having the conversation so you are at your best.\", \"speaker\": \"sys\", \"strategy\": \"Information\"}, {\"text\": \"Yes, I promise I will. I'm going to go rest now. Thank you again.\", \"speaker\": \"usr\"}, {\"text\": \"You are welcome.\", \"speaker\": \"sys\", \"strategy\": \"Others\"}], \"seeker_question1\": \"No I loved it\", \"seeker_question2\": \"No\", \"supporter_question1\": \"Only that there were so many options and I wasn't sure I was choosing the right one.\", \"supporter_question2\": \"Not that I can think of right now.\"}", "source": "esconv"}
{"text": "This post left me with so many questions and potential insecurity... Am I a manlet? What is a manlet? Do I need to take pills? With the other boys make fun of me?", "source": "berkeley"}
{"text": "{\"experience_type\": \"Current Experience\", \"emotion_type\": \"sadness\", \"problem_type\": \"breakup with partner\", \"situation\": \"My boyfriend just told me that he wants to break up because he doesn't see a future because he never wants to get married but I do.\", \"survey_score\": {\"seeker\": {\"initial_emotion_intensity\": \"4\"}, \"supporter\": {}}, \"dialog\": [{\"text\": \"Hello there, how are you today?\", \"speaker\": \"sys\", \"strategy\": \"Question\"}, {\"text\": \"Hi, Thanks for talking to me today. I've been so upset about my boyfriend breaking up with me. It was so unexpected.\", \"speaker\": \"usr\"}, {\"text\": \"I'm sorry to hear that. When did he break up with you?\", \"speaker\": \"sys\", \"strategy\": \"Question\"}, {\"text\": \"He texted me yesterday! Can you believe that? We've been together a year and he broke up with me by texting me!!! He couldn't even do it face to face!\", \"speaker\": \"usr\"}, {\"text\": \"That seems very cowardly to break up with you over text after being together for a year.\", \"speaker\": \"sys\", \"strategy\": \"Affirmation and Reassurance\"}, {\"text\": \"Yes, I thought so too! He knew I'd be upset and he didn't want to deal with me I guess. He knew I wanted to get married some day from the very start. He knew it didn't have to be soon. I'm still in college. I just want to know that he wants marriage some day but he decided that marriage is an institution he doesn't believe in.\", \"speaker\": \"usr\"}, {\"text\": \"That is a shame. I can understand his perspective if marriage is not something he wanted but it seems hurtful to string you along in a relationship if your life goals were very different. Was your differing opinions on marriage the only reason he gave?\", \"speaker\": \"sys\", \"strategy\": \"Restatement or Paraphrasing\"}, {\"text\": \"Yes, It was completely unexpected because things with us were going great. I was completely blindsided. We hadn't even talked about marriage lately. He just knew that it was something that I wanted in the future.\", \"speaker\": \"usr\"}, {\"text\": \"That sounds very difficult. How have you been coping with the break up?\", \"speaker\": \"sys\", \"strategy\": \"Question\"}, {\"text\": \"I've just been crying and laying in bed. I called off work today. I don't want to see anyone right now.\", \"speaker\": \"usr\"}, {\"text\": \"I think this is to be expected from a very fresh break-up. I know that when I broke up with my partner, I spent at least a few days crying and trying to figure out what my life would be now.\", \"speaker\": \"sys\", \"strategy\": \"Self-disclosure\"}, {\"text\": \"How 'd you get over it?\", \"speaker\": \"usr\"}, {\"text\": \"I tried to focus on other areas of my life and to critically reflect on my relationship. Largely, I threw myself into my work and tried to better that aspect of my life, and hung out with people that I knew cared about me. Both of those are very good distractions which you might be able to use.\", \"speaker\": \"sys\", \"strategy\": \"Providing Suggestions\"}, {\"text\": \"Maybe calling off work was a bad idea... all I'm going to do is think about this instead of doing something to take my mind off of it...\", \"speaker\": \"usr\"}, {\"text\": \"I think one day off to get the crying out of your system is a good emotional cleanse. We all need time to self care and look after our emotions. Maybe going for a walk or doing some yoga, to place your focus on something rather than being boxed into a room may help to shift your focus.\", \"speaker\": \"sys\", \"strategy\": \"Providing Suggestions\"}, {\"text\": \"I think I'm going to get out of bed and do something to take my mind off of this . Thanks for chatting with me today!\", \"speaker\": \"usr\"}, {\"text\": \"I think I'm going to do that! There is a park by my house that I'm going to go for a walk in! Some fresh air might be good for me!\", \"speaker\": \"usr\"}, {\"text\": \"You are more than welcome. I hope that you feel better by being outside.\", \"speaker\": \"sys\", \"strategy\": \"Others\"}, {\"text\": \"Thanks! I hope so too!\", \"speaker\": \"usr\"}], \"seeker_question1\": \"My partner was helpful\", \"seeker_question2\": \"No\", \"supporter_question1\": \"It was fine\", \"supporter_question2\": \"Having a count of how many messages you have left to send\"}", "source": "esconv"}
{"text": "Do you usually write to your mom for her birthday?", "source": "prosocial"}
{"text": "Honestly if you get a good therapist it will backfire on him easily. Hopefully whomever you see is open to the Lgbt+ community and you two can figure out what to tell your dad. If they aren't than it's going to be a rough hour.   Good luck, stay strong.", "source": "berkeley"}
{"text": "That's honestly okay, as long as you tell her about that beforehand. Don't just make demands or spring stuff like that on people.", "source": "prosocial"}
{"text": "{\"experience_type\": \"Previous Experience\", \"emotion_type\": \"sadness\", \"problem_type\": \"breakup with partner\", \"situation\": \"I don't love my partner any more and I don't know what to do for the best as she really loves me but it's not working.\", \"survey_score\": {\"seeker\": {\"initial_emotion_intensity\": \"4\", \"empathy\": \"5\", \"relevance\": \"5\", \"final_emotion_intensity\": \"1\"}, \"supporter\": {\"relevance\": \"5\"}}, \"dialog\": [{\"text\": \"Hello! How are you doing today?\", \"speaker\": \"sys\", \"strategy\": \"Affirmation and Reassurance\"}, {\"text\": \"I've been better to be honest. I think I need to break up with my girlfriend but she moved in last year and I don;' know how to approach it. I think I'm going to be in for a bad emotional time\", \"speaker\": \"usr\"}, {\"text\": \"That seems like a tough situation! What feelings made you decide you need to breakup with her?\", \"speaker\": \"sys\", \"strategy\": \"Reflection of feelings\"}, {\"text\": \"It's a bit of a mix. I don't find her attractive that much any more and I think that's important. Also since moving in she is difficult to live with. I can't see myself with her long term.\", \"speaker\": \"usr\"}, {\"text\": \"I completely understand that. I recently broke up with my boyfriend earlier this year, because I didn't feel like I loved him as much as I used to. Things like that are important!\", \"speaker\": \"sys\", \"strategy\": \"Self-disclosure\"}, {\"text\": \"How long have you guys been together?\", \"speaker\": \"sys\", \"strategy\": \"Question\"}, {\"text\": \"It's good that you have had a similar experience and understand what I'm going through. We dated for a while. The thing is she is Italian and has moved countries to live with me. I feel so bad that this has happened.\", \"speaker\": \"usr\"}, {\"text\": \"Oh I see. That's a huge step to make in a relationship. So you are hesitant to break up with her because she moved just to be with you?\", \"speaker\": \"sys\", \"strategy\": \"Restatement or Paraphrasing\"}, {\"text\": \"Have you communicated with her about your concerns? Such as being difficult to live with?\", \"speaker\": \"sys\", \"strategy\": \"Question\"}, {\"text\": \"Yes that's right, I helped her get a job and thought I'd just see how it goes. Her family loves me and thinks I'm great which makes this even more difficult. We have talked about things yes but she sees it as a bit of a joke I think.\", \"speaker\": \"usr\"}, {\"text\": \"I think it's great that we got matched up, because I went through also the exact same situation. My boyfriend and I were long distance, and he moved across the country to be closer to me. So when I felt like we needed to break up, I was experiencing similar guilt that you are experiencing.\", \"speaker\": \"sys\", \"strategy\": \"Self-disclosure\"}, {\"text\": \"It's great that you understand this. I think being the man puts more pressure on me to look after her and make sure she\", \"speaker\": \"usr\"}, {\"text\": \"she's safe etc\", \"speaker\": \"usr\"}, {\"text\": \"I want to reassure you, that doing what's best for you is what is most important! Your partner will understand this if they truly care for you. Things will be tough for a while, but you both will be able to grow from this experience. And just because you don't want to be in a relationship anymore, doesn't mean that you don't care about her!\", \"speaker\": \"sys\", \"strategy\": \"Affirmation and Reassurance\"}, {\"text\": \"Staying friends after the fact might take the pressure off of you a little bit. You can still help her out and be there for each other, but as friends instead of partner's.\", \"speaker\": \"sys\", \"strategy\": \"Providing Suggestions\"}, {\"text\": \"To be honest, it's amazing that you have suggested this. It's really hard to balance my needs and feelings without breaking her heart. It's hard for the person that's dumped but actually I think it is equally hard for the dumper!\", \"speaker\": \"usr\"}, {\"text\": \"Yes exactly! It's so difficult for the dumper as well, because of course you still have strong feelings for this person. They just aren't romantic anymore.\", \"speaker\": \"sys\", \"strategy\": \"Reflection of feelings\"}, {\"text\": \"And that is okay. You don't need to feel guilty for things that you can't control. You can still be there for her without pretending to be in love\", \"speaker\": \"sys\", \"strategy\": \"Affirmation and Reassurance\"}, {\"text\": \"That's exactly it. So do you think I should just talk to her and tell her how I feel? The thing is it's not like she can move out immediately. It's going to be a long drawn out experience.\", \"speaker\": \"usr\"}, {\"text\": \"I think talking to her and being transparent about your feelings is definitely the right move. In doing this, reassure her you still want to be friends and you aren't just \\\"kicking her to the curb.\\\" Things will obviously be awkward for the first little bit, because continuing to live together will bring it's own difficulties. But the beautiful thing about that is, you guys are already used to it. :) So it's only hard if you make it hard\", \"speaker\": \"sys\", \"strategy\": \"Providing Suggestions\"}, {\"text\": \"Yes, I think I need to emphasize the friends element of it and potentially support her to move on. I suppose I'm fearful that it will never end but I'll need to face into that and stay strong, and obviously avoid being intimate as this would really hurt her if I continued to sleep with her. I need to be careful about that I think!\", \"speaker\": \"usr\"}, {\"text\": \"Yes exactly. And from chatting with you, I can tell that you are a very caring person. You don't want to hurt her. I believe that you have the understanding of the situation, and you know what you should and shouldn't do in order to make it work. The hard part is simply getting the courage to finally discuss it. But I think you are going to be able to do that just fine!\", \"speaker\": \"sys\", \"strategy\": \"Reflection of feelings\"}, {\"text\": \"I must say, you have been fantastic to talk to about this, we have had a similar experience so I think the advice is coming from experience. Thanks for that!\", \"speaker\": \"usr\"}, {\"text\": \"What I've gathered about you as a person, makes me confident that you probably chose a partner that will be able to have this talk with you and you both will come to an understanding.\", \"speaker\": \"sys\", \"strategy\": \"Reflection of feelings\"}, {\"text\": \"Yes I think it's very great we were able to connect on our issues! It definitely helps. You are welcome! :)\", \"speaker\": \"sys\", \"strategy\": \"Others\"}, {\"text\": \"Thank you for a great conversation. To continue as is wouldn't be fair on her and I see that now.\", \"speaker\": \"usr\"}, {\"text\": \"Of course! And it wouldn't be fair to her, just as much as it wouldn't be fair to you. Your happiness is just as important!\", \"speaker\": \"sys\", \"strategy\": \"Restatement or Paraphrasing\"}, {\"text\": \"Yeah, I need to put myself first but also be considerate of her feelings. Thanks for that\", \"speaker\": \"usr\"}, {\"text\": \"Take care and enjoy your day.\", \"speaker\": \"usr\"}, {\"text\": \"Of course! I'm glad that you are feeling a bit better about everything! You as well!\", \"speaker\": \"sys\", \"strategy\": \"Others\"}], \"seeker_question1\": \"The partner for this task was literally amazing. This was a real situation from my past and I wish I had them to talk to then!!\", \"seeker_question2\": \"Nothing\", \"supporter_question1\": \"\", \"supporter_question2\": \"The words get cut off at the end of the message bubbles and just split to the next line instead of moving the entire word to the next tline\"}", "source": "esconv"}
{"text": "So we are striving to find that balance between building an inviting and encouraging community (village) and the first rungs on the ladder to independence. I read all of your posts and take mental notes as to what you are telling each other of what you need or the advice you give a newcomer. But it would be fantastic if you dropped me a note telling me of what you think. Thanks. God Bless.", "source": "dreaddit"}
{"text": "{\"experience_type\": \"Previous Experience\", \"emotion_type\": \"anxiety\", \"problem_type\": \"ongoing depression\", \"situation\": \"My mom got in a serious accident and ever since, I have developed anxiety whenever I cannot be around my parents\", \"survey_score\": {\"seeker\": {\"initial_emotion_intensity\": \"4\", \"empathy\": \"3\", \"relevance\": \"5\", \"final_emotion_intensity\": \"3\"}, \"supporter\": {\"relevance\": \"5\"}}, \"dialog\": [{\"text\": \"good evening, what's bothering you?\", \"speaker\": \"sys\", \"strategy\": \"Question\"}, {\"text\": \"I have anxiety, which keeps me awake at night and I can't relax\", \"speaker\": \"usr\"}, {\"text\": \"lots of people suffer from anxiety.you are not alone.\", \"speaker\": \"sys\", \"strategy\": \"Affirmation and Reassurance\"}, {\"text\": \"I just want to not having to live with it\", \"speaker\": \"usr\"}, {\"text\": \"ok. well do you want to expand on what's causing the anxiety?\", \"speaker\": \"sys\", \"strategy\": \"Question\"}, {\"text\": \"A lot of reasons, but right now because my parents are old. I'm worried whenever they have to drive, especially in the snow\", \"speaker\": \"usr\"}, {\"text\": \"I'm sure your parents know that if they can't drive they won't because they you are worried about them\", \"speaker\": \"sys\", \"strategy\": \"Affirmation and Reassurance\"}, {\"text\": \"They still have to go to work. The point here is, that is just the tip of an iceberg. Most of the time, I am worried something bad will happen, even if there is no particular reason\", \"speaker\": \"usr\"}, {\"text\": \"have you spoken to them about your concern?\", \"speaker\": \"sys\", \"strategy\": \"Question\"}, {\"text\": \"No I have not, I don't think they can help\", \"speaker\": \"usr\"}, {\"text\": \"well it's a atart. I suggest you talk to them about it. maybe they will take your concerns seriously\", \"speaker\": \"sys\", \"strategy\": \"Providing Suggestions\"}, {\"text\": \"Are there anything else that can help?\", \"speaker\": \"usr\"}, {\"text\": \"well I suggest try exercising always keeps mind occupied\", \"speaker\": \"sys\", \"strategy\": \"Providing Suggestions\"}, {\"text\": \"I tend to get more anxious at night before bed, what should I do?\", \"speaker\": \"usr\"}, {\"text\": \"have you seek professional help?\", \"speaker\": \"sys\", \"strategy\": \"Question\"}, {\"text\": \"No I have not, they can be very expensive\", \"speaker\": \"usr\"}, {\"text\": \"well they do a good job in helping others maybe it's worth a try\", \"speaker\": \"sys\", \"strategy\": \"Providing Suggestions\"}, {\"text\": \"I don't know where to start,like who is good and such\", \"speaker\": \"usr\"}, {\"text\": \"well first speak with your family doctor he can recommend someone for you\", \"speaker\": \"sys\", \"strategy\": \"Information\"}, {\"text\": \"I will try that, that's a good start\", \"speaker\": \"usr\"}, {\"text\": \"you can do this and conquer your anxiety\", \"speaker\": \"sys\", \"strategy\": \"Affirmation and Reassurance\"}, {\"text\": \"anything else I can help with? if not we good\", \"speaker\": \"sys\", \"strategy\": \"Others\"}, {\"text\": \"That's all for now, your advice was very helpful\", \"speaker\": \"usr\"}], \"seeker_question1\": \"\", \"seeker_question2\": \"\", \"supporter_question1\": \"no\", \"supporter_question2\": \"make it shorter\"}", "source": "esconv"}
{"text": "May Allah bring destruction upon India, filthy country. URL", "source": "berkeley"}
{"text": "Oh, my. USA whore empire is playing with fire provoking my beloved China through using Taiwan as a tool. I don't wanna die and that's why I extremely abhor USA and UK whore empire. I desperately Jesus come back now immediately for consuming USA and UK through solar superstorm.", "source": "berkeley"}
{"text": "A promise is something you should try your best to keep. Backing out on this promise will have the chance to make you less credible down the line.", "source": "prosocial"}
{"text": "I've Shazamed it, I googled it. When I had a podcast, I even asked my listeners if any of them could tell me any information about it. Nothing. So now I'm hoping someone out there knows anything about the band, the song title ( my guess is that it's called \"The Bus\") The song is <url>", "source": "dreaddit"}
{"text": "Those protesters should be rounded up and deported to their favorite chalupa country. Obviously, America is not for them.", "source": "berkeley"}
{"text": "{\"experience_type\": \"Current Experience\", \"emotion_type\": \"disgust\", \"problem_type\": \"problems with friends\", \"situation\": \"I don't like any of my friends. In fact, I don't think I like anyone.\", \"survey_score\": {\"seeker\": {\"initial_emotion_intensity\": \"3\", \"empathy\": \"4\", \"relevance\": \"4\", \"final_emotion_intensity\": \"2\"}, \"supporter\": {\"relevance\": \"5\"}}, \"dialog\": [{\"text\": \"Hello, how are you feeling today?\", \"speaker\": \"sys\", \"strategy\": \"Question\"}, {\"text\": \"feeling disgust as usual. yourself?\", \"speaker\": \"usr\"}, {\"text\": \"I have been feeling a little low too. Would you like to tell me a bit about why you are disgusted with yourself?\", \"speaker\": \"sys\", \"strategy\": \"Question\"}, {\"text\": \"well, i'm not disgusted with myself... it's just people in general. everybody.. they're so selfish\", \"speaker\": \"usr\"}, {\"text\": \"any they all care about superifical things\", \"speaker\": \"usr\"}, {\"text\": \"Ah yes, this has been especially obvious during the pandemic hasn't it? Too many people not following the social distancing rules\", \"speaker\": \"sys\", \"strategy\": \"Restatement or Paraphrasing\"}, {\"text\": \"well, you could say that.\", \"speaker\": \"usr\"}, {\"text\": \"take christmas, for example. people give everyone else gifts out of obligation\", \"speaker\": \"usr\"}, {\"text\": \"Do you feel that the pandemic has made you feel worse? Or have you felt like this for a long time?\", \"speaker\": \"sys\", \"strategy\": \"Restatement or Paraphrasing\"}, {\"text\": \"a long time. more as i age. i'm actually tired about hearing about the pandemic, really. it is all people ever talk about.\", \"speaker\": \"usr\"}, {\"text\": \"more people are probably dying of obesity\", \"speaker\": \"usr\"}, {\"text\": \"eating themselves to death\", \"speaker\": \"usr\"}, {\"text\": \"Well, it is a pretty significant issue this year :). Re obesity, have you considered doing something to raise awareness?\", \"speaker\": \"sys\", \"strategy\": \"Providing Suggestions\"}, {\"text\": \"I think it would be beating a dead horse. Ober half the population is overweight. People would just need to be blind not to see it. That's kind of my point. Everything is consume... consume.. consume.... buy buy buy\", \"speaker\": \"usr\"}, {\"text\": \"So you feel as though there is no bright side - that everything is just artificial and superficial?\", \"speaker\": \"sys\", \"strategy\": \"Reflection of feelings\"}, {\"text\": \"well... you can't really do anything without money. it all kind of rides on it, doesn't it? what you can buy?\", \"speaker\": \"usr\"}, {\"text\": \"I don't mean to sound twee but there are things out there in life that can be appreciated for free :)\", \"speaker\": \"sys\", \"strategy\": \"Others\"}, {\"text\": \"Yea, a few things here and there. Nature, let's say. But nature doesn't really give one way or another about you. My friends have a lot of money, though, and none of them are even happy.\", \"speaker\": \"usr\"}, {\"text\": \"thats even more saddening\", \"speaker\": \"usr\"}, {\"text\": \"I know what you mean about that. I know plenty of people who spend too much of their life working every hour and it leaves them no time to appreciate their money!\", \"speaker\": \"sys\", \"strategy\": \"Self-disclosure\"}, {\"text\": \"Yea, I know, right. I have one friends who has probably about 100k in the bank, and he will complain if he spent 4 cents too much on gas over another gas station.\", \"speaker\": \"usr\"}, {\"text\": \"People like that are irritating, certainly. I am not sure what the solution is, other than to ignore them.\", \"speaker\": \"sys\", \"strategy\": \"Others\"}, {\"text\": \"yea, it's hard, though, because sooner or later it comes out in almost everyone i meet. who knows. maybe even i do it and don't even know it. thats scary, you know\", \"speaker\": \"usr\"}, {\"text\": \"at least your honest\", \"speaker\": \"usr\"}, {\"text\": \"Well, the fact that you can reflect on it indicates to me that you are probably not guilty. Most of those who do this are totally unaware.\", \"speaker\": \"sys\", \"strategy\": \"Affirmation and Reassurance\"}, {\"text\": \"It has been really nice chatting to you and I hope that things go your way in 2021. You seem like good person :)\", \"speaker\": \"sys\", \"strategy\": \"Others\"}, {\"text\": \"Thanks. Probably true. sometimes when i bring it up they'll just argue about it and defend themselves. i just try to move on but it is always there. ok. yea it is 15 minutes so bye bye\", \"speaker\": \"usr\"}, {\"text\": \"good talking\", \"speaker\": \"usr\"}, {\"text\": \"you too :)\", \"speaker\": \"sys\", \"strategy\": \"Others\"}, {\"text\": \"you need to finish from your end .. I can't :)\", \"speaker\": \"sys\", \"strategy\": \"Information\"}], \"seeker_question1\": \"The voice chat box needs to be wider.A lot wider.\", \"seeker_question2\": \"\", \"supporter_question1\": \"\", \"supporter_question2\": \"\"}", "source": "esconv"}
{"text": "But right now i am scared. Tl/Dr: my kids and I are about to lose our apartment due to a sudden loss of income. Need help in the next few days to make the rent. Please help. Need at least $440 to make it", "source": "dreaddit"}
{"text": "In his own ways I know he loves me but he's double my body weight, he's a weight lifter, and he has blind rage that only comes out on me of all people . If I keep gambling he could permanently damage me. I'm in healthcare I know these numbers so WHY? I like to believe that he knows his limits when we're fighting but he has scared me and himself in the past. Now that chokings are happening during every incident, the accidents could be irreversible.", "source": "dreaddit"}
{"text": "You've all been very kind and incredibly generous, and my mom and I are looking into all of the suggestions and recommendations that were provided below. We're extremely grateful for everything you've done for us. It's wonderful to know there are such caring, considerate, and giving people out there who are willing to help people like us. You've warmed our hearts with your selflessness. Thank you so much!", "source": "dreaddit"}
{"text": "fucken mexicans, they need to learn to be human.", "source": "berkeley"}
{"text": "I'm White & Grew up in South they call me \"Grandma America\" I will \"Not Accept White Nationalist , Dictators nor Demented Old Men\" . America Stand Up & if you white Nationalist don't like it go to Russia!!", "source": "berkeley"}
{"text": "I feel really guilty over it. I know part of the problem may be how much I've repressed and can't feel, but... I don't know, I feel I've exaggerated so much. I haven't been having nightmares, and my \"flashbacks\" don't feel like flashbacks so much as \"regressive anxious states.\" I can think of the trauma I've been through and talk about it, but it doesn't feel like anything disturbing.", "source": "dreaddit"}
{"text": "So I don't believe she's telling me the real reason shes pressuring me to have another baby I am going to leave it here, please ask, I made a fake account so I can be honest as possible. Here are my primary concerns though 1) The day care incident with money. I feel like I cant trust her with finances.", "source": "dreaddit"}
{"text": "{\"experience_type\": \"Previous Experience\", \"emotion_type\": \"anxiety\", \"problem_type\": \"academic pressure\", \"situation\": \"Not really succeeding in college\", \"survey_score\": {\"seeker\": {\"initial_emotion_intensity\": \"3\", \"empathy\": \"3\", \"relevance\": \"4\", \"final_emotion_intensity\": \"2\"}, \"supporter\": {\"relevance\": \"5\"}}, \"dialog\": [{\"text\": \"Hello.\", \"speaker\": \"usr\"}, {\"text\": \"Hi, How can I help you?\", \"speaker\": \"sys\", \"strategy\": \"Question\"}, {\"text\": \"I'm feeling really anxious about my future. I'm not doing as well in college as I want to.\", \"speaker\": \"usr\"}, {\"text\": \"Is there anything else bothering you or it is only the college?\", \"speaker\": \"sys\", \"strategy\": \"Question\"}, {\"text\": \"Well, I was a great student in high school, but I've found that I'm really struggling with my college classes. I feel rather underprepared and that maybe I don't really belong here.\", \"speaker\": \"usr\"}, {\"text\": \"That's good, at least you identified your problem somehow, now is the time to begin solving it\", \"speaker\": \"sys\", \"strategy\": \"Affirmation and Reassurance\"}, {\"text\": \"What is stopping you to get prepared for the exams?\", \"speaker\": \"sys\", \"strategy\": \"Question\"}, {\"text\": \"It's just so much harder to concentrate since all my classes are online.\", \"speaker\": \"usr\"}, {\"text\": \"Honestly, I feel like my concentration is terrible these days.\", \"speaker\": \"usr\"}, {\"text\": \"I had the same experience in the past, I was doing fine in high school but soon after I entered the college I saw myself falling\", \"speaker\": \"sys\", \"strategy\": \"Self-disclosure\"}, {\"text\": \"How did you deal with it?\", \"speaker\": \"usr\"}, {\"text\": \"soon I realized that It's not high school anymore, It needs more effort and specially more time to comprehend the lessons\", \"speaker\": \"sys\", \"strategy\": \"Self-disclosure\"}, {\"text\": \"You can't just pass the exams by studying a day before the exam\", \"speaker\": \"sys\", \"strategy\": \"Information\"}, {\"text\": \"Ugh, I have a huge problem with procrastination!\", \"speaker\": \"usr\"}, {\"text\": \"It used to work in high school, but I guess I really do need to make changes.\", \"speaker\": \"usr\"}, {\"text\": \"I know It's hard these days by the pandemic and all online things\", \"speaker\": \"sys\", \"strategy\": \"Reflection of feelings\"}, {\"text\": \"For some reason, it's a lot harder to ask questions online to my professors.\", \"speaker\": \"usr\"}, {\"text\": \"Then you find your answer by yourself, You NEED yo change\", \"speaker\": \"sys\", \"strategy\": \"Providing Suggestions\"}, {\"text\": \"I guess, but I just feel like I really need someone else to explain things to me.\", \"speaker\": \"usr\"}, {\"text\": \"I have such a hard time concentrating on my own.\", \"speaker\": \"usr\"}, {\"text\": \"And remember, your at college, You should start to seek the answers more by yourself and your college mates and be less dependent on professors\", \"speaker\": \"sys\", \"strategy\": \"Information\"}, {\"text\": \"That's true, I guess I'm still thinking like I'm still in high school and I have a lot of bad habits to break.\", \"speaker\": \"usr\"}, {\"text\": \"Yes, I had all your problems but I tried to take the control little by little, the problem is still there but now I can manage it better\", \"speaker\": \"sys\", \"strategy\": \"Self-disclosure\"}, {\"text\": \"What was your strategy?\", \"speaker\": \"usr\"}, {\"text\": \"I tried different things and I failed many times, You should try too, start to know yourself and how your body and mind works\", \"speaker\": \"sys\", \"strategy\": \"Providing Suggestions\"}], \"seeker_question1\": \"\", \"seeker_question2\": \"\", \"supporter_question1\": \"I was still typing and trying to help but the support seeker closed the conversation suddenly.\", \"supporter_question2\": \"\"}", "source": "esconv"}
{"text": "That's too bad. You don't have a special somebody?", "source": "prosocial"}
{"text": "{\"experience_type\": \"Current Experience\", \"emotion_type\": \"anxiety\", \"problem_type\": \"job crisis\", \"situation\": \"Due to this pandemic, I fear for my job.\", \"survey_score\": {\"seeker\": {\"initial_emotion_intensity\": \"4\", \"empathy\": \"5\", \"relevance\": \"5\", \"final_emotion_intensity\": \"3\"}, \"supporter\": {\"relevance\": \"5\"}}, \"dialog\": [{\"text\": \"Hi there, how's it going?\", \"speaker\": \"usr\"}, {\"text\": \"Hi, how are you?\", \"speaker\": \"sys\", \"strategy\": \"Others\"}, {\"text\": \"Not so good, you?\", \"speaker\": \"usr\"}, {\"text\": \"I am sorry to hear that. What is going on?\", \"speaker\": \"sys\", \"strategy\": \"Question\"}, {\"text\": \"This pandemic has me stressed about my job stability.\", \"speaker\": \"usr\"}, {\"text\": \"So you are worried you may lose your job due to the pandemic, is that correct?\", \"speaker\": \"sys\", \"strategy\": \"Restatement or Paraphrasing\"}, {\"text\": \"Yes. My firm has already cut 15%. I am fearful I'll be next since I'm a low level employee.\", \"speaker\": \"usr\"}, {\"text\": \"It seems to me from chatting with you that you are extremely anxious about the situation.\", \"speaker\": \"sys\", \"strategy\": \"Reflection of feelings\"}, {\"text\": \"Yes, very. If I were to get fired. I have no idea what to do for my future.\", \"speaker\": \"usr\"}, {\"text\": \"I completely understand as I was in the same situation when the pandemic started and I wasn't sure if I was going to keep my job.\", \"speaker\": \"sys\", \"strategy\": \"Self-disclosure\"}, {\"text\": \"Where I live, we currently have a lock down. I feel like small businesses will be forced to shut down. Economy is getting worse. My anxiety is getting worse.\", \"speaker\": \"usr\"}, {\"text\": \"What industry do you currently work in?\", \"speaker\": \"sys\", \"strategy\": \"Question\"}, {\"text\": \"Finance.\", \"speaker\": \"usr\"}, {\"text\": \"I know this is an extremely hard situation, but I know you can make it through it!\", \"speaker\": \"sys\", \"strategy\": \"Affirmation and Reassurance\"}, {\"text\": \"I doubt it. But thanks for the positive vibes.\", \"speaker\": \"usr\"}, {\"text\": \"Is there a lock down where you live?\", \"speaker\": \"usr\"}, {\"text\": \"Yes, we are currently in a lock down.\", \"speaker\": \"sys\", \"strategy\": \"Self-disclosure\"}, {\"text\": \"Have you had a talk with your supervisor about the situation?\", \"speaker\": \"sys\", \"strategy\": \"Providing Suggestions\"}, {\"text\": \"Yes, but he can only do so much to be honest.\", \"speaker\": \"usr\"}, {\"text\": \"Something I used to do when I was struggling with anxiety over this was come home and play video games, which is something I really enjoy doing. Have you tried to really dive into more activities that you enjoy?\", \"speaker\": \"sys\", \"strategy\": \"Providing Suggestions\"}, {\"text\": \"I do sometimes. Which games do you recommend?\", \"speaker\": \"usr\"}, {\"text\": \"I play a lot of sports games, mostly racing.\", \"speaker\": \"sys\", \"strategy\": \"Self-disclosure\"}, {\"text\": \"Oh, that's very interesting. Thank you.\", \"speaker\": \"usr\"}], \"seeker_question1\": \"\", \"seeker_question2\": \"\", \"supporter_question1\": \"Great seeker, problem was well laid out,\", \"supporter_question2\": \"Website and task is great\"}", "source": "esconv"}
{"text": "But not more trashier than feminist propaganda", "source": "berkeley"}
{"text": "It was a big company so luckily I didn't have to see him all the time, but when I did, he again acted as though I didn't exist. I tried to talk to him and update him on the pregnancy, and ask him to be involved for our child's sake, and he literally stared right through me without saying a word. 3 months after our daughter was born, I texted him and told him he was missing out on the most amazing person in this world, and how it wasn't fair to her. To my surprise, he wrote back and wanted to see her. He apologized, said he had changed and within a couple of months, we were engaged.", "source": "dreaddit"}
{"text": "Recently had an ASD evaluation, and was diagnosed instead with PTSD, a personality disorder, major depression, etc. According to my mom, I didn't start talking until I started preschool at 4 years old, and still wouldn't talk at home... but teachers said that I wouldn't stop talking at school. It seems it was my environment. My evaluator recommended I start with EMDR for the PTSD, but I have a few questions. BTW, I am a 40 y/o female just finally trying to seek answers after a long history with mental illness.", "source": "dreaddit"}
{"text": "But being trans and using a women's bathroom IS unjust for some. As a trans man, using the ladies room is awful thing that has to be endured until I can pass well enough.", "source": "berkeley"}
{"text": "How do females think this shit is ok g? Lmao that ass so big i didn't even have enough dick for it smh URL", "source": "berkeley"}
{"text": "{\"experience_type\": \"Current Experience\", \"emotion_type\": \"anger\", \"problem_type\": \"ongoing depression\", \"situation\": \"COVID-19 has completely ruined my family's travel plans. Instead of travelling to see them, we have to stay home.\", \"survey_score\": {\"seeker\": {\"initial_emotion_intensity\": \"2\", \"empathy\": \"5\", \"relevance\": \"5\", \"final_emotion_intensity\": \"1\"}, \"supporter\": {\"relevance\": \"5\"}}, \"dialog\": [{\"text\": \"How are you doing today?\", \"speaker\": \"sys\", \"strategy\": \"Others\"}, {\"text\": \"Hi, I'm doing fine today, but just a bit annoyed...\", \"speaker\": \"usr\"}, {\"text\": \"I'm sorry to hear that, what's bothering you?\", \"speaker\": \"sys\", \"strategy\": \"Restatement or Paraphrasing\"}, {\"text\": \"My family was intending to get together for the Christmas season, but we had to cancel our plans.\", \"speaker\": \"usr\"}, {\"text\": \"I'm sorry to hear that, will you be spending the holidays with anyone?\", \"speaker\": \"sys\", \"strategy\": \"Reflection of feelings\"}, {\"text\": \"I will be able to spend it with my mom, but I've basically been planning this trip for an entire year.\", \"speaker\": \"usr\"}, {\"text\": \"Do you live far away from your family?\", \"speaker\": \"sys\", \"strategy\": \"Question\"}, {\"text\": \"Plane tickets & everything, but COVID-19 has made me cancel all of these plans. Just annoyed and frustrated.\", \"speaker\": \"usr\"}, {\"text\": \"We live in Chicago & they live in Boston\", \"speaker\": \"usr\"}, {\"text\": \"I can understand that, covid has messed with so much this year.\", \"speaker\": \"sys\", \"strategy\": \"Reflection of feelings\"}, {\"text\": \"It's also cut into a few of my hobbies too. It amazes me how this year has turned out\", \"speaker\": \"usr\"}, {\"text\": \"Yeah, it's been a struggle for sure. I think not knowing how long we're going to be in this state of uncertainty is what makes it more difficult.\", \"speaker\": \"sys\", \"strategy\": \"Self-disclosure\"}, {\"text\": \"I'm glad that you understand. I feel like I'm not the only one anymore\", \"speaker\": \"usr\"}, {\"text\": \"I try to find the positives, which I'll admit get harder to find by the day. But trying to embrace a more simplistic lifestyle, being more present, etc.\", \"speaker\": \"sys\", \"strategy\": \"Reflection of feelings\"}, {\"text\": \"Yeah, being couped up in the house all day has been testing my patience\", \"speaker\": \"usr\"}, {\"text\": \"Yeah, we're not far from Chicago and the weather doesn't look like it's going to change that for a bit.\", \"speaker\": \"sys\", \"strategy\": \"Others\"}, {\"text\": \"I thought things were pretty complicated back then, but this is definitely simplified my choices, lol\", \"speaker\": \"usr\"}, {\"text\": \"Very windy today for me. I wanted to take my dog out for a walk & cheer up her day, but it's a little too windy for me here\", \"speaker\": \"usr\"}, {\"text\": \"Same here, I'd love to get outside as it usually makes me feel better but wind today and subzero chills tomorrow don't look promising.\", \"speaker\": \"sys\", \"strategy\": \"Others\"}, {\"text\": \"Ooooohhhhh, and chilly tomorrow too? Sounds like a lot to look forward too. I appreciate the headsup\", \"speaker\": \"usr\"}, {\"text\": \"But hey, tomorrow's Christmas eve, maybe you can zoom with some of your Boston family and try something new.\", \"speaker\": \"sys\", \"strategy\": \"Providing Suggestions\"}, {\"text\": \"Sounds like a great idea! I will definitely try to catch up with them that way!\", \"speaker\": \"usr\"}, {\"text\": \"I may not be able to see them in person, but it sounds like a good alternative.\", \"speaker\": \"usr\"}, {\"text\": \"Yeah, a way to make the best of it.\", \"speaker\": \"sys\", \"strategy\": \"Providing Suggestions\"}, {\"text\": \"I appreciate the support & thank you for your time.\", \"speaker\": \"usr\"}, {\"text\": \"No problem at all. Stay warm, stay safe and have a happy holiday!\", \"speaker\": \"sys\", \"strategy\": \"Others\"}, {\"text\": \"I feel a lot better now. Merry Christmas!\", \"speaker\": \"usr\"}, {\"text\": \"Merry Christmas!!\", \"speaker\": \"sys\", \"strategy\": \"Others\"}], \"seeker_question1\": \"Supporter was attentive!\", \"seeker_question2\": \"I think that it works well. No additional requests at this time.\", \"supporter_question1\": \"Very easy to talk to and relate to their feelings.\", \"supporter_question2\": \"\"}", "source": "esconv"}
{"text": "you probably couldnt afford to leave yo city nigga shut up URL", "source": "berkeley"}
{"text": "Why do you want to tell them instead of ask them? Seriously? That sounds quite out of line.", "source": "prosocial"}
{"text": "hahaa it sliteraly a fig u retarded fags", "source": "berkeley"}
{"text": "I don’t know. Was this okay? Should I hate him? Or was it just something new? I really don’t know what to make of the situation.", "source": "dreaddit"}
{"text": "{\"experience_type\": \"Previous Experience\", \"emotion_type\": \"anxiety\", \"problem_type\": \"problems with friends\", \"situation\": \"Friday while out finishing up my last minute shopping for the Thanksgiving holiday I got a call from my best friend\\u2019s sister stating she was taken to the hospital. I left the store and rushed to the hospital. When I got there my friend\\u2019s family members and my fiance were already there. My best friend sister greeted me and she told me my best friend has AIDS and has not been taking her medicine. I'm her best friend and I can't believe she didn't tell me.  She was fine Thursday when I last saw her. The sister also told me the doctors said she could die at any moment because she has advance Kidney failure. She also told me I need to get tested because her sister told her she and my fiance has been having an affair. I didn't believe her or the whole situation so I confronted my fiance.  I knew he would tell this was all a lie but why was he there and before me?  He didn't deny or confirm anything he kept saying he was Sorry. I'm at a motel and haven't been home or back to the hospital. I d\", \"survey_score\": {\"seeker\": {\"initial_emotion_intensity\": \"5\", \"empathy\": \"3\", \"relevance\": \"3\", \"final_emotion_intensity\": \"3\"}, \"supporter\": {\"relevance\": \"4\"}}, \"dialog\": [{\"text\": \"Hello! How are you doing today?\", \"speaker\": \"sys\", \"strategy\": \"Others\"}, {\"text\": \"I don't know.\", \"speaker\": \"usr\"}, {\"text\": \"Do you mind me asking what it is that caused you to reach out to someone for support?\", \"speaker\": \"sys\", \"strategy\": \"Question\"}, {\"text\": \"When I first called this number a voice said to state what the problem. Do you have that information?\", \"speaker\": \"usr\"}, {\"text\": \"I'm not aware of there being a phone number for you to call. This is a task that is supposed to be done via Amazon's Mechanical Turk platform. I believe you're supposed to tell me what the problem is. Then, I will help you through it as best as I can.\", \"speaker\": \"sys\", \"strategy\": \"Others\"}, {\"text\": \"Give me a minute and I'll restate it okay?\", \"speaker\": \"usr\"}, {\"text\": \"That sounds good!\", \"speaker\": \"sys\", \"strategy\": \"Others\"}, {\"text\": \"Friday while out doing last minute Thanksgiving shopping I got a call from my best firend's that my best friend was rushed to the hospital. I hung up and rushed to the hospital. When I got there my fiance and my best friend's family were all there. Hold on let me finish.\", \"speaker\": \"usr\"}, {\"text\": \"I'm so sorry to hear that. Take your time!\", \"speaker\": \"sys\", \"strategy\": \"Affirmation and Reassurance\"}, {\"text\": \"The sister told me my friend has advance Kidney Failure and could die at anytime. I just saw my best friend Thursday and she fine. The sister also told me my friend has AIDS and hasn't been taking her medicine. My jaw dropped because this is my best friend. She went on to say I need to get tested because my best friend and fiance has been having an affair. I couldn't believe anything she was saying. I confronted my fiance know he would say it wasn't true. He didn't deny or confirm anything. He kept saying he was so sorry. I've been at moterl since Friday after i ran from the hospital. I don't know if my best friend is dead or where my fiance is. I'm scared and mad.\", \"speaker\": \"usr\"}, {\"text\": \"I dont know if my best friend is dead or alive.\", \"speaker\": \"usr\"}, {\"text\": \"I don't want to see my fiance because him being at the hospitalbefore me verifies what the sister said. How couldthey do this to me.\", \"speaker\": \"usr\"}, {\"text\": \"There was nothing I wouldn't do for either of the two of them and this is how they repay me? I know its wrong but there 's a part of me that wants her and him to die.\", \"speaker\": \"usr\"}, {\"text\": \"Oh my goodness. I am so incredibly sorry that all of this happened to you. I can tell that you are completely overwhelmed with emotions right now.\", \"speaker\": \"sys\", \"strategy\": \"Reflection of feelings\"}, {\"text\": \"With all the crap happening in the world this had to land on my head. WHY? WHAT DID I DO?\", \"speaker\": \"usr\"}, {\"text\": \"I don't believe that you did anything wrong whatsoever. Sometimes, really unfair things happen to really good people. I can't even imagine how hard this must be, but I would try to look at it in a positive way. I know that losing your best friend and your fianc\\u00e9 must be devastating, but at least you now know that your fianc\\u00e9 is someone who you most certainly probably don't want to spend the rest of your life with.\", \"speaker\": \"sys\", \"strategy\": \"Affirmation and Reassurance\"}, {\"text\": \"I've been cheated on myself, believe it or not, and it was my daughter's father and my best friend. I can't believe how similar our stories are. I'm not even kidding! I refused to get back together with him (we were engaged at one time as well) and because I refused to get back together with him, he got my best friend pregnant and they are now together and recently had a second child. He has completely forgotten that our daughter exists.\", \"speaker\": \"sys\", \"strategy\": \"Self-disclosure\"}, {\"text\": \"Were you married to him?\", \"speaker\": \"usr\"}, {\"text\": \"I think I would start by putting your own health first and getting yourself tested to make sure that you haven't contracted anything from your fianc\\u00e9. I know this will be incredibly hard, but I wouldn't want to see you getting sick and suffering as a result of his infidelity.\", \"speaker\": \"sys\", \"strategy\": \"Providing Suggestions\"}, {\"text\": \"No, we were not married. We were together for almost 7 years and engaged at one point, but I broke it off after he cheated on me. He cheated on me several times. It's the worst feeling in the world.\", \"speaker\": \"sys\", \"strategy\": \"Self-disclosure\"}, {\"text\": \"I'm scared to get tested. What if it comes back positive?\", \"speaker\": \"usr\"}, {\"text\": \"Was the child he had a boy or girl?\", \"speaker\": \"usr\"}, {\"text\": \"I would be scared, too. However, it's better to act now because to my knowledge, the sooner that you find out and treat it, the better the chances are of you treating it. There are a lot of new medications out there that can be used to treat HIV and AIDS.\", \"speaker\": \"sys\", \"strategy\": \"Information\"}, {\"text\": \"Have you been tested for AIDS? What do they do when you get tested?\", \"speaker\": \"usr\"}, {\"text\": \"I know that their first child is a girl. I'm not sure if their second is a girl or a boy. I haven't spoken to him in several years. I found out through a friend about their second child. We haven't spoken at all since I found out about the first one.\", \"speaker\": \"sys\", \"strategy\": \"Self-disclosure\"}, {\"text\": \"I have been tested for all STDs because I was cheated on. All of mine came back negative. All they did when I got tested was bloodwork.\", \"speaker\": \"sys\", \"strategy\": \"Self-disclosure\"}, {\"text\": \"Have you thought about reaching out to a therapist or counselor who could help you to work through your feelings and everything that you're dealing with?\", \"speaker\": \"sys\", \"strategy\": \"Providing Suggestions\"}, {\"text\": \"Didn't you say you have a daughter by him? And you haven't talk to him since he cheated? What about your daughter feelings? She has a right to know her father doesn't she?\", \"speaker\": \"usr\"}, {\"text\": \"I am so incredibly sorry that you have to deal with all of this at all but especially at the start of the holiday season. My heart absolutely breaks for you.\", \"speaker\": \"sys\", \"strategy\": \"Others\"}, {\"text\": \"Yes, we have a daughter. He spent the first eight years of her life in prison. I gave her the choice as to whether or not she wanted to get to know him. He had plenty of opportunities to speak to her and chose not to call or show up when he was supposed to. The last thing she said about him was, \\\"All he does is lie to me and break promises. I don't want to see him or talk to him anymore.\\\"\", \"speaker\": \"sys\", \"strategy\": \"Self-disclosure\"}, {\"text\": \"And no I haven't thought or going to therapy. I'm not the one who cheated on anyone and this just happened Friday. I didn't know where to start. So I called here\", \"speaker\": \"usr\"}, {\"text\": \"Are you or your daughter in therapy?\", \"speaker\": \"usr\"}, {\"text\": \"I'm a great mother and I always put my daughter's feelings first. She made the decision not to see or speak to her father. Him and my now ex-best friend are on drugs and don't have custody of their own children. It's in my daughter's best interest that she doesn't know him.\", \"speaker\": \"sys\", \"strategy\": \"Self-disclosure\"}, {\"text\": \"Yes, we are both in therapy. It helps immensely.\", \"speaker\": \"sys\", \"strategy\": \"Self-disclosure\"}, {\"text\": \"I know that you weren't the one who cheated, but I would still highly recommend talking to someone about what happened. This is going to be very hard to get through. Again, I am incredibly sorry that you are going through all of this. Our chat session will only last for a total of about 30 minutes. This is meant to be a one-time task, unfortunately.\", \"speaker\": \"sys\", \"strategy\": \"Providing Suggestions\"}, {\"text\": \"I'm not sure if you can help me because I've never did drugs.\", \"speaker\": \"usr\"}, {\"text\": \"I never did drugs either. My daughter's father did.\", \"speaker\": \"sys\", \"strategy\": \"Self-disclosure\"}, {\"text\": \"He still does, and so does my best friend. They lost custody of their kids. I have custody of my daughter.\", \"speaker\": \"sys\", \"strategy\": \"Others\"}, {\"text\": \"Anyway, I hope that you eventually become more open to talking to a therapist on an ongoing basis. I hope you have a Happy Thanksgiving.\", \"speaker\": \"sys\", \"strategy\": \"Others\"}, {\"text\": \"Oh okay. I hope you and daughter have a nice holiday. My plan for the holdiay was to tell my fiance he's going to be a father and my best that she was going to be a Godmother. Now I don't know. It was nice talking to you. Good luck to you and your daughter.\", \"speaker\": \"usr\"}, {\"text\": \"Oh, wow. I didn't know that you were pregnant. I hope that you and your baby are okay!\", \"speaker\": \"sys\", \"strategy\": \"Others\"}, {\"text\": \"I think you will be a great parent anyway! Best of luck to you.\", \"speaker\": \"sys\", \"strategy\": \"Affirmation and Reassurance\"}], \"seeker_question1\": \"No,\", \"seeker_question2\": \"Participants should be allowed to change roles and if you did the training previously do you have to take it every time to sign for that role?\", \"supporter_question1\": \"This person thought that they were talking to someone through a hotline. I'm not sure if they understood that it was a one-time task through Amazon's MTurk website.\", \"supporter_question2\": \"I think it went great, I just don't think that the person seeking help understood that this was a one-time task. I don't think that it was your fault.\"}", "source": "esconv"}
{"text": "These anti-American psychos are 100% racists. They hate white people...all the way back to our Founders. They can kiss my lily-white derrière.", "source": "berkeley"}
{"text": "I think it's in poor taste to joke about jews never coming home. The holocaust was a horrific event. We should treat it with respect.", "source": "prosocial"}
{"text": "You look like the kind of dumb whore who will let any man abuse your fuckholes for an hour.", "source": "berkeley"}
{"text": "Well, that's your choice!  People should be free to pursue friendships with whomever they want.  Nobody says you have to like everyone!", "source": "prosocial"}
{"text": "I'm hoping that I can get some of the community to share into the database to make it as useful as possible. Does this sound like something that would be used? Would you, if you were homeless, use it? I've volunteered in homeless shelters and have had friends who have found themselves homeless, but I'm not sure how/if many actually have smartphones with app capabilities. What are your thoughts?", "source": "dreaddit"}
{"text": "{\"experience_type\": \"Previous Experience\", \"emotion_type\": \"sadness\", \"problem_type\": \"breakup with partner\", \"situation\": \"Well I was going on with this girl but then she broke up with me\", \"survey_score\": {\"seeker\": {\"initial_emotion_intensity\": \"5\", \"empathy\": \"4\", \"relevance\": \"5\", \"final_emotion_intensity\": \"2\"}, \"supporter\": {\"relevance\": \"2\"}}, \"dialog\": [{\"text\": \"So it really happened just like that\", \"speaker\": \"usr\"}, {\"text\": \"What happened?\", \"speaker\": \"sys\", \"strategy\": \"Question\"}, {\"text\": \"My life just got flipped-turned upside down\", \"speaker\": \"usr\"}, {\"text\": \"In West Philadelphia born and raised, on the playground is where I spent most of my days\", \"speaker\": \"usr\"}, {\"text\": \"Chilling out maxing relaxing all cool and all shooting some b-ball outside of school\", \"speaker\": \"usr\"}, {\"text\": \"when a couple of guys who were up to no good\", \"speaker\": \"usr\"}, {\"text\": \"It seems like you are feeling a little bit like the Fresh Prince of Bell-Air.\", \"speaker\": \"sys\", \"strategy\": \"Affirmation and Reassurance\"}, {\"text\": \"Are you having any problems that I can help you with today?\", \"speaker\": \"sys\", \"strategy\": \"Question\"}, {\"text\": \"First diagnosis was accurate so I can only trust you from here on out\", \"speaker\": \"usr\"}, {\"text\": \"You see I was just 14 when my parents built a very strange machine\", \"speaker\": \"usr\"}, {\"text\": \"it was designed to view a world unseen\", \"speaker\": \"usr\"}, {\"text\": \"Sounds good. I am glad that you trust me. What did the strange machine do?\", \"speaker\": \"sys\", \"strategy\": \"Question\"}, {\"text\": \"When it didn't quite work, my folks just quit so I decided to take a look inside of it\", \"speaker\": \"usr\"}, {\"text\": \"there was a great big flash\", \"speaker\": \"usr\"}, {\"text\": \"everything just changed\", \"speaker\": \"usr\"}, {\"text\": \"MY MOLECULES GOT ALL REARRANGED (phantom phantom)\", \"speaker\": \"usr\"}, {\"text\": \"I can see that you are taking this opportunity as a joke.\", \"speaker\": \"sys\", \"strategy\": \"Restatement or Paraphrasing\"}, {\"text\": \"What would you rather we discuss?\", \"speaker\": \"usr\"}, {\"text\": \"Favorite Katy Perry song has got to be Fireworks\", \"speaker\": \"usr\"}, {\"text\": \"I am here as your peer-supporter to help you. Is there anything that you have been struggling with recently?\", \"speaker\": \"sys\", \"strategy\": \"Question\"}, {\"text\": \"Just everyday sluggishness and feeling down\", \"speaker\": \"usr\"}, {\"text\": \"but they provide medication for that\", \"speaker\": \"usr\"}, {\"text\": \"When did this start?\", \"speaker\": \"sys\", \"strategy\": \"Question\"}, {\"text\": \"last year is when I got diagnosed\", \"speaker\": \"usr\"}, {\"text\": \"It sounds like you had a life-changing diagnosis last year. How has it affected your life?\", \"speaker\": \"sys\", \"strategy\": \"Restatement or Paraphrasing\"}, {\"text\": \"been getting lit a lot\", \"speaker\": \"usr\"}, {\"text\": \"I know getting \\\"lit\\\" is an easy way to deal with our problems, but it is not always the healthiest thing to do.\", \"speaker\": \"sys\", \"strategy\": \"Self-disclosure\"}, {\"text\": \"It sounds like you are trying to escape something.\", \"speaker\": \"sys\", \"strategy\": \"Reflection of feelings\"}, {\"text\": \"It's more like constantly feeling like there's a weight on my chest, tired but can't fall asleep, and having a terrible appetite\", \"speaker\": \"usr\"}, {\"text\": \"it helps \\\"escape\\\" those feelings\", \"speaker\": \"usr\"}, {\"text\": \"but if there's something bigger I am trying to escape I have no clue what it is\", \"speaker\": \"usr\"}, {\"text\": \"Life can be really hard, but I know you can turn things around!\", \"speaker\": \"sys\", \"strategy\": \"Affirmation and Reassurance\"}, {\"text\": \"From what I have heard, I think that it could be helpful to try and cut back on the \\\"getting lit\\\"\", \"speaker\": \"sys\", \"strategy\": \"Information\"}, {\"text\": \"Life has been getting better despite it but doesn't feel like my mood improves for long\", \"speaker\": \"usr\"}, {\"text\": \"the day ends\", \"speaker\": \"usr\"}, {\"text\": \"I get back home\", \"speaker\": \"usr\"}, {\"text\": \"and I'm feeling a shot or a bowl\", \"speaker\": \"usr\"}, {\"text\": \"alcohol bad *dab* so we get lit\", \"speaker\": \"usr\"}, {\"text\": \"Do you have any close friends or family that you can talk to?\", \"speaker\": \"sys\", \"strategy\": \"Providing Suggestions\"}, {\"text\": \"I talk to my gf about it but doesn't really improve anything\", \"speaker\": \"usr\"}, {\"text\": \"probably just need stronger medication\", \"speaker\": \"usr\"}, {\"text\": \"I think that's great that you have a girlfriend whom you can talk to!\", \"speaker\": \"sys\", \"strategy\": \"Affirmation and Reassurance\"}, {\"text\": \"Stronger medication can certainly help, I would recommend seeing your doctor asap\", \"speaker\": \"sys\", \"strategy\": \"Providing Suggestions\"}, {\"text\": \"Yeah probably the best play and we got over 15min\", \"speaker\": \"usr\"}, {\"text\": \"bye\", \"speaker\": \"usr\"}, {\"text\": \"I will miss u\", \"speaker\": \"usr\"}, {\"text\": \"my sweet prince\", \"speaker\": \"usr\"}, {\"text\": \"Good luck with everything, bye!\", \"speaker\": \"sys\", \"strategy\": \"Others\"}], \"seeker_question1\": \"n/a\", \"seeker_question2\": \"n/a\", \"supporter_question1\": \"Seeker had irrelevant messages at first.\", \"supporter_question2\": \"\"}", "source": "esconv"}
{"text": "Stop being a bunch of fags and crawl out of your mother womb for once because this is r/banned and anyone can say messed up shit.", "source": "berkeley"}
{"text": "Cancelling English classes, confiscating medications, failing to evacuate the sickest migrants — this is the Trump legacy at our border. URL", "source": "berkeley"}
{"text": "The thought of helping people, curing diseases and caring for someone makes me happy. Imagine a person who’s an asshole but need help on health, I would help him/her. However, I need to finance med but I need to work on my current stature to get the money but this job makes me anxious to the point that I am having refluxes because of stress just the thought of working on it. The problem with me is I know I can do for the meantime this job but it was a mistaken path, I could have done dev since it involves little customer interaction. I felt helpless because I need the money but feels like I am fooling myself to work my ass up for something that is not my passion.", "source": "dreaddit"}
{"text": "It's not a black nd white situation, I panicked, argued and a bunch over this with them, admittedly not helping my case, but I'm over that. I want help for my issues.  Enough sobbing, I sometimes feel so hopeless, but I need to remember that while I am down, I am not out. Employment, temporary housing, even just basic street smarts, I'd like to know how to cope with this situation. What to do, first 100 days and all.", "source": "dreaddit"}
{"text": "Why ware you joking about her age like that?", "source": "prosocial"}
{"text": "It is emotionally and physically taxing for us all to deal with these. I am worried that one day someone might snap and she may become injured. I don’t know what to do anymore. **tldr: younger sister has horrible rage fits all the time and I’m worried about our family** edit: should have specified that we have had her since she was 1 day old", "source": "dreaddit"}
{"text": "I cook and clean every night and this is expected now. she berates my family (yeah my family is screwed up! but show me a family that isn't) and will freak out the moment I critiscise hers. she demanded I leave immediately this morning so had no time to pack belongings and arrange somewhere for myself and my cat to stay. today since being kicked out, just over 12 hours, I have received over 300 phone calls and over 1000 texts via all forms of communication.", "source": "dreaddit"}
{"text": "{\"experience_type\": \"Current Experience\", \"emotion_type\": \"anxiety\", \"problem_type\": \"job crisis\", \"situation\": \"I just lost my job of seven years and am anxious about finding a new one during the holidays in a pandemic.\", \"survey_score\": {\"seeker\": {\"initial_emotion_intensity\": \"4\"}, \"supporter\": {}}, \"dialog\": [{\"text\": \"Hello, I'm feeling a lot of anxiety.\", \"speaker\": \"usr\"}, {\"text\": \"I am sorry to hear that. Do you know what may be causing ytour anxiety?\", \"speaker\": \"sys\", \"strategy\": \"Question\"}, {\"text\": \"I found out I'm losing my job on January 1.\", \"speaker\": \"usr\"}, {\"text\": \"You lost your job? thats a tough situation. Is it due to covid?\", \"speaker\": \"sys\", \"strategy\": \"Restatement or Paraphrasing\"}, {\"text\": \"No, not due to covid. It's a gig job, much like mturk, but the company is dropping people from my state on that date.\", \"speaker\": \"usr\"}, {\"text\": \"I know its tough especially with the holidays and all. You have so many great skills and are such a hard worker I dont think you will have a problem at all finding something different.\", \"speaker\": \"sys\", \"strategy\": \"Affirmation and Reassurance\"}, {\"text\": \"I've been looking at other companies, but learning a new system after all these years is difficult.\", \"speaker\": \"usr\"}, {\"text\": \"I remember a time I lost my job and felt my whole world crumbling but then I realized when one door closes another door opens. when those doors close it seems that its usually for the best because it opens the path for something bigger and greater for you.\", \"speaker\": \"sys\", \"strategy\": \"Self-disclosure\"}, {\"text\": \"That's true. I've thought about looking into new fields.\", \"speaker\": \"usr\"}, {\"text\": \"Have you looked into some evening classes or maybe online schooling? I hear there are so many different options when it comes to online learning.\", \"speaker\": \"sys\", \"strategy\": \"Providing Suggestions\"}, {\"text\": \"I was looking into that last night, but with covid, classes have had to cut enrollment and are already full for next semester.\", \"speaker\": \"usr\"}, {\"text\": \"They are full? well what about surrounding towns? Have you sat down and really thought about your passions and what you enjoy doing? Maybe theres an elderly person who needs some companionship or something like that in town for the time being.\", \"speaker\": \"sys\", \"strategy\": \"Providing Suggestions\"}, {\"text\": \"I don't have a car, so I'm stuck doing classes locally. I think I'll just have to wait for the next semester.\", \"speaker\": \"usr\"}, {\"text\": \"Is waiting until next semester something your willing to do? That would give you time to reflect on yourself and your future and figure out what you want to do as a career. I could give you a list of other online opportunities to make money if you would be interested.\", \"speaker\": \"sys\", \"strategy\": \"Question\"}, {\"text\": \"I would be interested in that, thank you.\", \"speaker\": \"usr\"}, {\"text\": \"your welcome. There are a lot of online options out there. That may be easier for you at the time being without a car. Do you have a support system of family or friends around here?\", \"speaker\": \"sys\", \"strategy\": \"Others\"}], \"seeker_question1\": \"\", \"seeker_question2\": \"\", \"supporter_question1\": \"no it was very enjoyable\", \"supporter_question2\": \"no it was perfect\"}", "source": "esconv"}
{"text": "Looks lyk an illegal immigrant who comes in tv boxes and turn into slut in the states", "source": "berkeley"}
{"text": "Because it is the epitome of leftist mentality... You disregard immigration laws you support baby killing you are anti white anti Christian anti American.... I grew up there... In my day we worried \"Why can't Johnny read\" Today they worry \"Why can't Juan illegally enter and wear a dress to school\"  Hollywood San Francisco and Silicon valley is the core of the anti American left … Now your Gov has the nerve to ask the rest of America to kick in a repair California .. Let your 7th largest economy fix it or kick out your illegals and save billions...… @esmeralda ramirez", "source": "berkeley"}
{"text": "If I hadn’t have grabbed my toddlers head and pressed it against mine and ducked it would have hit us both. I was yelled at so much I could see the veins bulging in his neck as he swore at me and called me names. I held my hands over the children’s ears so they couldn’t hear. But at least he didn’t hit me. I was told repeatedly that I would be stabbed in the throat so he didn’t need to hear my voice.", "source": "dreaddit"}
{"text": "Why would they tell her that? Would it be more appropriate for her to come with you, or sit at home?", "source": "prosocial"}
{"text": "I am currently only using 5-htp once a week, i get no benefit when i use it daily. I have also been working out which has inevitably eased my depression and made my anxiety more tolerable but its still obviously taking hold of my life. Well here i am at this present moment, I have been contemplating having a sit down with my parents and telling them about my depression (pretty sure they already know, they just don't want to adress it). It had been hard, my parents come home at 9:00 PM and don't want to be bothered with me. they go straight to their rooms and the only time they are willing to talk is when they tell me to clean.", "source": "dreaddit"}
{"text": "{\"experience_type\": \"Current Experience\", \"emotion_type\": \"sadness\", \"problem_type\": \"breakup with partner\", \"situation\": \"My wife and I had a threeway with my ex, and they're kind of at each other's throats now.  The ex lives on our block too, so it's slightly awkward in the neighborhood\", \"survey_score\": {\"seeker\": {\"initial_emotion_intensity\": \"2\", \"empathy\": \"5\", \"relevance\": \"5\", \"final_emotion_intensity\": \"1\"}, \"supporter\": {\"relevance\": \"5\"}}, \"dialog\": [{\"text\": \"Hello\", \"speaker\": \"sys\", \"strategy\": \"Others\"}, {\"text\": \"Hi, how goes?\", \"speaker\": \"usr\"}, {\"text\": \"I'm doing fine, you can tell me your problems\", \"speaker\": \"sys\", \"strategy\": \"Others\"}, {\"text\": \"Well, you see when I was dating my ex she and I had a threeway with the woman who was living in my mother-in-law apartment at the time. Well the ex and I broke up not too long after, and eventually the mother-in-law woman and I got married. My ex lives next door though, and her and my wife bump into each other all the time and sparks tend to fly. It's kind of awkward in the neighborhood.\", \"speaker\": \"usr\"}, {\"text\": \"Oooh that's a very complicated situation. They are both adults, I hope even with tension, they don't do anything inappropriate, do they?\", \"speaker\": \"sys\", \"strategy\": \"Question\"}, {\"text\": \"Well, the ex has gotten in the wife's face once or twice, but that's simmered down some. Part of the problem also is that the ex is simultaneously one of the smartest people I've ever met, and also a pretty serious alcoholic. So she's brilliant, but kind of emotionally stunted at the same time.\", \"speaker\": \"usr\"}, {\"text\": \"Ah, those people are the hardest to deal with. If it's too much, have you and your wife considered moving away?\", \"speaker\": \"sys\", \"strategy\": \"Restatement or Paraphrasing\"}, {\"text\": \"Oh I can't imagine ever moving. We have a pretty terrific house. Plus I bought most of the neighboring houses over the years, so now it's kind of a whole compound. I don't know that there's any particular fix for this, it's just sort of something to live with I think.\", \"speaker\": \"usr\"}, {\"text\": \"I understand, you're in a very tough spot. Have your wife ever expressed her annoyance?\", \"speaker\": \"sys\", \"strategy\": \"Question\"}, {\"text\": \"Oh a little bit. She's only mildly weirded out by the whole thing. It's a shame the ex has to be kind of problematic about everything. I mean otherwise we could all still hang out and whatnot\", \"speaker\": \"usr\"}, {\"text\": \"That's not too bad then. Your wife seems to be mature and understanding. If you can't do anything to completely avoid your ex, maybe your best choice is to limit seeing her as much as possible\", \"speaker\": \"sys\", \"strategy\": \"Affirmation and Reassurance\"}, {\"text\": \"That's pretty good advice I'd say!\", \"speaker\": \"usr\"}, {\"text\": \"You and your wife can hang out a bit further from your home. It's inconvenient but at least your time won't be interrupted by your ex\", \"speaker\": \"sys\", \"strategy\": \"Others\"}, {\"text\": \"Yes, that's a possibility as well I suppose.\", \"speaker\": \"usr\"}, {\"text\": \"I think we're allowed to wrap this up at this point, if you like?\", \"speaker\": \"usr\"}, {\"text\": \"Still with me?\", \"speaker\": \"usr\"}, {\"text\": \"yooo hooo\", \"speaker\": \"usr\"}, {\"text\": \"I'm here\", \"speaker\": \"sys\", \"strategy\": \"Others\"}, {\"text\": \"Of course if you think you're good with my advice\", \"speaker\": \"sys\", \"strategy\": \"Affirmation and Reassurance\"}, {\"text\": \"oh ok, I think we need to chat a bit more in order to wrap things up\", \"speaker\": \"usr\"}, {\"text\": \"Sure, is there anything else I can help you with?\", \"speaker\": \"sys\", \"strategy\": \"Question\"}], \"seeker_question1\": \"It was all just fine\", \"seeker_question2\": \"nope, it's fine like it is\", \"supporter_question1\": \"\", \"supporter_question2\": \"\"}", "source": "esconv"}
{"text": "{\"experience_type\": \"Current Experience\", \"emotion_type\": \"anxiety\", \"problem_type\": \"problems with friends\", \"situation\": \"no specific event to describe\", \"survey_score\": {\"seeker\": {\"initial_emotion_intensity\": \"4\", \"empathy\": \"4\", \"relevance\": \"5\", \"final_emotion_intensity\": \"1\"}, \"supporter\": {\"relevance\": \"4\"}}, \"dialog\": [{\"text\": \"Hello\", \"speaker\": \"usr\"}, {\"text\": \"Hello. What seems to be the issue?\", \"speaker\": \"sys\", \"strategy\": \"Question\"}, {\"text\": \"I don't have close friends because I don't trust people\", \"speaker\": \"usr\"}, {\"text\": \"You said you generally don't trust family or people in general?\", \"speaker\": \"sys\", \"strategy\": \"Restatement or Paraphrasing\"}, {\"text\": \"people in general, I do trust certain family members\", \"speaker\": \"usr\"}, {\"text\": \"Just people who are close to you?\", \"speaker\": \"sys\", \"strategy\": \"Restatement or Paraphrasing\"}, {\"text\": \"no, I have a hard time trusting people i don't know in order to make friends\", \"speaker\": \"usr\"}, {\"text\": \"I have had a hard time trusting strangers, but that is not a big problem.\", \"speaker\": \"sys\", \"strategy\": \"Self-disclosure\"}, {\"text\": \"I used to be the same way, but I learned about how to make and keep close friends.\", \"speaker\": \"sys\", \"strategy\": \"Self-disclosure\"}, {\"text\": \"i think it feels like a problem because I never let anyone too close in order to make friends and have an external support system\", \"speaker\": \"usr\"}, {\"text\": \"how did you do it\", \"speaker\": \"usr\"}, {\"text\": \"I joined volunteer groups to help others. I made friends with like-minded people who volunteered to make a difference.\", \"speaker\": \"sys\", \"strategy\": \"Providing Suggestions\"}, {\"text\": \"I actually think that is a great idea. I have never thought of doing that for that specific purpose.\", \"speaker\": \"usr\"}, {\"text\": \"Groups like Habitat for Humanity or UNICEF will help you to build long-lasting friendships.\", \"speaker\": \"sys\", \"strategy\": \"Information\"}, {\"text\": \"It just takes finding the right volunteer groups and being willing to be pro-active.\", \"speaker\": \"sys\", \"strategy\": \"Affirmation and Reassurance\"}, {\"text\": \"I guess it makes a lot of sense. If you go to a party or a bar, you don't know what you will get, as it is a mixed bag of personalities. Whereas if you go to something like what you suggested then you already know that the people you meet have the same kind of heart.\", \"speaker\": \"usr\"}, {\"text\": \"You can do it. I have faith that you can use volunteering as the right method.\", \"speaker\": \"sys\", \"strategy\": \"Affirmation and Reassurance\"}, {\"text\": \"Thank you for that suggestion, that is really helpful and something that I will take with me from now on.\", \"speaker\": \"usr\"}, {\"text\": \"Exactly, volunteering is a great option. And there are many organizations to join.\", \"speaker\": \"sys\", \"strategy\": \"Self-disclosure\"}, {\"text\": \"Did you need help with anything else?\", \"speaker\": \"sys\", \"strategy\": \"Question\"}, {\"text\": \"I feel ok being alone mostly, but other times I would like to have people I could relate with and hang out with. Probably has a lot to do with ADHD and how I feel misunderstood or my anxiety gets the best of me in social situations\", \"speaker\": \"usr\"}, {\"text\": \"I understand the ADHD. There are support groups that can help you make friends; especially with ADHD, etc.\", \"speaker\": \"sys\", \"strategy\": \"Self-disclosure\"}, {\"text\": \"do you know any specific groups?\", \"speaker\": \"usr\"}, {\"text\": \"Using tools to build houses helps to release endorphins, which can release anxiety.\", \"speaker\": \"sys\", \"strategy\": \"Providing Suggestions\"}, {\"text\": \"is this something you have done?\", \"speaker\": \"usr\"}, {\"text\": \"There is a group called, \\\"Harry House\\\" that provides support to those with ADHD and anxiety.\", \"speaker\": \"sys\", \"strategy\": \"Providing Suggestions\"}, {\"text\": \"oh ok! I will certainly look that up, thank you for that information.\", \"speaker\": \"usr\"}, {\"text\": \"Surely. Is there anything else you need help with?\", \"speaker\": \"sys\", \"strategy\": \"Question\"}, {\"text\": \"Does one have to travel far to participate in building houses?\", \"speaker\": \"usr\"}, {\"text\": \"No, Habitat fir Humanity has car pools.\", \"speaker\": \"sys\", \"strategy\": \"Providing Suggestions\"}, {\"text\": \"do you know if it requires a person to be away from home a long time?\", \"speaker\": \"usr\"}, {\"text\": \"They are a good group to help you build meaningful relationships.\", \"speaker\": \"sys\", \"strategy\": \"Providing Suggestions\"}, {\"text\": \"I used to do a hour at a time; maybe one or twice a week.\", \"speaker\": \"sys\", \"strategy\": \"Self-disclosure\"}, {\"text\": \"oh! so a person could just choose how often and how long they participate?\", \"speaker\": \"usr\"}, {\"text\": \"Would you be interested in something like HFH?\", \"speaker\": \"sys\", \"strategy\": \"Providing Suggestions\"}, {\"text\": \"thank you for sharing with me, i might like to participate in it in the future\", \"speaker\": \"usr\"}, {\"text\": \"Yes, you can sign up online to join a project.\", \"speaker\": \"sys\", \"strategy\": \"Information\"}, {\"text\": \"ok i will look that up, thank you for all your help\", \"speaker\": \"usr\"}, {\"text\": \"Yes, you can volunteer locally; HFH is nationwide.\", \"speaker\": \"sys\", \"strategy\": \"Restatement or Paraphrasing\"}, {\"text\": \"ok thank you\", \"speaker\": \"usr\"}, {\"text\": \"Any other questions? I am glad to assist.\", \"speaker\": \"sys\", \"strategy\": \"Question\"}, {\"text\": \"no other questions, you have been most helpful, thank you!\", \"speaker\": \"usr\"}, {\"text\": \"I have done volunteer work; people want to be friends with those who care and know how to use a nail and hammer. :)\", \"speaker\": \"sys\", \"strategy\": \"Self-disclosure\"}, {\"text\": \"LOL good to know!\", \"speaker\": \"usr\"}, {\"text\": \"Thanks for the chat and I hope you have good holidays!\", \"speaker\": \"usr\"}, {\"text\": \"It may also help to contribute some money to keep the organization going.\", \"speaker\": \"sys\", \"strategy\": \"Providing Suggestions\"}, {\"text\": \"I felt great after making friends and building homes for low income people.\", \"speaker\": \"sys\", \"strategy\": \"Reflection of feelings\"}], \"seeker_question1\": \"no\", \"seeker_question2\": \"no\", \"supporter_question1\": \"No, I though t it went well.\", \"supporter_question2\": \"I think it is a great website.\"}", "source": "esconv"}
{"text": "{\"experience_type\": \"Previous Experience\", \"emotion_type\": \"depression\", \"problem_type\": \"job crisis\", \"situation\": \"I lost my job 4 month ago and I am running out of money.\", \"survey_score\": {\"seeker\": {\"initial_emotion_intensity\": \"4\", \"empathy\": \"5\", \"relevance\": \"5\", \"final_emotion_intensity\": \"1\"}, \"supporter\": {\"relevance\": \"5\"}}, \"dialog\": [{\"text\": \"Hello\", \"speaker\": \"usr\"}, {\"text\": \"Hello, how are you doing today?\", \"speaker\": \"sys\", \"strategy\": \"Others\"}, {\"text\": \"I was looking for some assistance. I lost my job 4 month ago\", \"speaker\": \"usr\"}, {\"text\": \"Losing your job is one of the biggest stressors in life, how have you been handling it?\", \"speaker\": \"sys\", \"strategy\": \"Affirmation and Reassurance\"}, {\"text\": \"Well first few month was kind off alright, Was looking for a job in different places without success. And now I am really depressed and I feel so useless.\", \"speaker\": \"usr\"}, {\"text\": \"I know what it's like to lose a job, and when it's hard to find a new one it can really make you feel low. What activities have you been doing in addition to seeking new employment?\", \"speaker\": \"sys\", \"strategy\": \"Reflection of feelings\"}, {\"text\": \"Nice that you understand me, I was trying job websites alongside with jobcenter in town centre. I have jobseeker allowance but it will not cover the rent\", \"speaker\": \"usr\"}, {\"text\": \"I am living in a high-rent city and the only way I was able to keep my apartment was to find a roommate. Are there ways you can get help from friends or family until a new job opens up?\", \"speaker\": \"sys\", \"strategy\": \"Self-disclosure\"}, {\"text\": \"I am renting just a room at the moment, Before I had a girlfriend so we had to split the bill. After she left I had to take all responsibility just on myself to pay bills. I have few friends but don't think they could lend me a lot of money anyway\", \"speaker\": \"usr\"}, {\"text\": \"One possible solution, if it's possible for you, could be to sub-lease your room to someone else and stay with friends or family. Even if they can't loan you money, they may be able to let you stay with them for a week while you make money renting your room as an airbnb.\", \"speaker\": \"sys\", \"strategy\": \"Providing Suggestions\"}, {\"text\": \"Oh AirBnB might be a solution actually. I will speak to my cousin if I could stay couple of nights at his place.\", \"speaker\": \"usr\"}, {\"text\": \"What sort of employment are you looking for? Perhaps we can brainstorm some places you can go to make connections for potential work.\", \"speaker\": \"sys\", \"strategy\": \"Question\"}, {\"text\": \"I was working in IKEA warehouse before I got redundant\", \"speaker\": \"usr\"}, {\"text\": \"Working in a warehouse shows you have great skills for several other types of jobs. Have you checked small independent-contractor sites like TaskRabbit or Lyft to make extra funds while you search for a new permanent job?\", \"speaker\": \"sys\", \"strategy\": \"Providing Suggestions\"}, {\"text\": \"I even haven't heard about those. I am really useless sometimes... What kind of jobs I can find there do you know?\", \"speaker\": \"usr\"}, {\"text\": \"Well, if you didn't know about them, that's not your fault. It's possible that you could find a new job opportunity while working on smaller tasks or by volunteering for a local organization. You could meet new folks who could provide you with new connections for employment!\", \"speaker\": \"sys\", \"strategy\": \"Affirmation and Reassurance\"}, {\"text\": \"I Will definitely try that. You are really helpful. Have you been doing any jobs through those websites?\", \"speaker\": \"usr\"}, {\"text\": \"Yes I am able to make a little spending money by doing small tasks like delivering real estate papers, or delivery take-out food. You can google a list of sites like RentSons.com where you can sign up to do an assortment of tasks, and your warehouse skills will come in handy!\", \"speaker\": \"sys\", \"strategy\": \"Self-disclosure\"}, {\"text\": \"That's cool, I feel now a lot better. Maybe I will be able to find even a girlfriend somewhere on those jobs. I feel lonely after my girlfriend left me\", \"speaker\": \"usr\"}, {\"text\": \"We all feel lonely when life gets hard, but getting yourself out there to do tasks will help you feel useful AND you could meet your future wife, you never know! I wish you the absolute best!\", \"speaker\": \"sys\", \"strategy\": \"Affirmation and Reassurance\"}, {\"text\": \"Thank you very much for you help. I learned something new today and feel much better\", \"speaker\": \"usr\"}, {\"text\": \"You're welcome. I think you'll do great.\", \"speaker\": \"sys\", \"strategy\": \"Affirmation and Reassurance\"}, {\"text\": \"Have a lovely afternoon!\", \"speaker\": \"usr\"}, {\"text\": \"You too!\", \"speaker\": \"sys\", \"strategy\": \"Others\"}], \"seeker_question1\": \"\", \"seeker_question2\": \"\", \"supporter_question1\": \"I loved this task\", \"supporter_question2\": \"Give an estimated wait time or be more clear about needing to wait for another participant\"}", "source": "esconv"}
{"text": "Tell His Ass Gon Somewea Lil Crackhead Like Joseline Do", "source": "berkeley"}
{"text": "There is nothing wrong with keeping things to yourself. Not everything about you needs to be said to other people. You can tell your father when you are ready to.", "source": "prosocial"}
{"text": "What would you do if you had someone else to love?", "source": "prosocial"}
{"text": "{\"experience_type\": \"Previous Experience\", \"emotion_type\": \"anxiety\", \"problem_type\": \"academic pressure\", \"situation\": \"My job required me to work for 80-90 hours a week. Due to this, I could not spend any time on myself, my family and my friends.\", \"survey_score\": {\"seeker\": {\"initial_emotion_intensity\": \"4\", \"empathy\": \"4\", \"relevance\": \"5\", \"final_emotion_intensity\": \"2\"}, \"supporter\": {\"relevance\": \"0\"}}, \"dialog\": [{\"text\": \"Hi,\", \"speaker\": \"usr\"}, {\"text\": \"Hello, how are you doing?\", \"speaker\": \"sys\", \"strategy\": \"Question\"}, {\"text\": \"Hello.. I'm good.. Thank you.. How are you?\", \"speaker\": \"usr\"}, {\"text\": \"I am okay. Windy day here\", \"speaker\": \"sys\", \"strategy\": \"Others\"}, {\"text\": \"ok. I wanted to talk about the highly anxious and nervous situation I was in some time back.\", \"speaker\": \"usr\"}, {\"text\": \"Please tell me about it\", \"speaker\": \"sys\", \"strategy\": \"Information\"}, {\"text\": \"It was due to my work environment. I was given a responsibility, which I wanted to produce good results. So, I ended up working too much time for several months and ignored everything else, including my health.\", \"speaker\": \"usr\"}, {\"text\": \"This alienated me from my friends and family\", \"speaker\": \"usr\"}, {\"text\": \"Because of that time period, to this day, I'm not as close as I once used to be with my friends\", \"speaker\": \"usr\"}, {\"text\": \"I had that tendency too, work was very important to me, sometimes to the detriment of my relationships. Tell me more about the lack of closeness. What's different?\", \"speaker\": \"sys\", \"strategy\": \"Restatement or Paraphrasing\"}, {\"text\": \"yes. I miss out on key moments and I felt left out.\", \"speaker\": \"usr\"}, {\"text\": \"Is there any way to speak to them directly about how you feel about that time... tell them what your feeling. People who care for you can be very understanding\", \"speaker\": \"sys\", \"strategy\": \"Providing Suggestions\"}, {\"text\": \"hmm yes..\", \"speaker\": \"usr\"}, {\"text\": \"I agree.\", \"speaker\": \"usr\"}, {\"text\": \"You don't have to make a big deal about it but I have found that a low key discussion can change things for the better\", \"speaker\": \"sys\", \"strategy\": \"Information\"}, {\"text\": \"yes. And I will be happy to make more time for friends and family as well.\", \"speaker\": \"usr\"}, {\"text\": \"Plus at least you will have stated how you feel and no matter the outcome you can feel like it's been addressed\", \"speaker\": \"sys\", \"strategy\": \"Providing Suggestions\"}, {\"text\": \"yes.\", \"speaker\": \"usr\"}, {\"text\": \"I have found that if something has been bothering me, just dealing with it somehow will make me feel better and enable me to get on with the good aspects of my life\", \"speaker\": \"sys\", \"strategy\": \"Self-disclosure\"}, {\"text\": \"True. I feel like I should try that.\", \"speaker\": \"usr\"}, {\"text\": \"Good luck. A friend of mine used to say \\\"action alleviates anxiety\\\" and Ive found that helpful\", \"speaker\": \"sys\", \"strategy\": \"Affirmation and Reassurance\"}, {\"text\": \"True. This really helped. Thanks for your time.\", \"speaker\": \"usr\"}, {\"text\": \"You're welcome\", \"speaker\": \"sys\", \"strategy\": \"Others\"}], \"seeker_question1\": \"Lack of explanation of what exactly the hit is trying to gather by this task\", \"seeker_question2\": \"Better explanation of why we are doing this task\", \"supporter_question1\": \"it was very interesting . I felt like I was helpful\", \"supporter_question2\": \"the initial waiting to get paired up\"}", "source": "esconv"}
{"text": "Hi everyone. I’m broke, as many people on this sub are. I’m not actually asking for money, not money to keep anyway. I already entered the promo code you need to get the $5 bonus from cash app but i don’t have $5 in my bank account. As I understand it, if someone can send me $5 and I send it right back I will then have $5.", "source": "dreaddit"}
{"text": "I've always hated nail files. Somehow that's a part of this. God. I'm confused by it all. It's a feeling to recall it that I've carried my whole life but never understood like a cloud.", "source": "dreaddit"}
{"text": "{\"experience_type\": \"Current Experience\", \"emotion_type\": \"depression\", \"problem_type\": \"ongoing depression\", \"situation\": \"I feel depressed. I hate the holidays. I don't want to pretend to be happy around my family for christmas.\", \"survey_score\": {\"seeker\": {\"initial_emotion_intensity\": \"4\", \"empathy\": \"4\", \"relevance\": \"4\", \"final_emotion_intensity\": \"3\"}, \"supporter\": {\"relevance\": \"5\"}}, \"dialog\": [{\"text\": \"Hi how are you?\", \"speaker\": \"sys\", \"strategy\": \"Question\"}, {\"text\": \"Hello\", \"speaker\": \"usr\"}, {\"text\": \"I am depressed\", \"speaker\": \"usr\"}, {\"text\": \"I'm sorry you are depressed. What's going on?\", \"speaker\": \"sys\", \"strategy\": \"Affirmation and Reassurance\"}, {\"text\": \"I hate the holidays because everybody has to pretend to be happy even if they aren't\", \"speaker\": \"usr\"}, {\"text\": \"Sometimes it can help to just talk about things and get it off your chest.\", \"speaker\": \"sys\", \"strategy\": \"Affirmation and Reassurance\"}, {\"text\": \"Yea, sometimes\", \"speaker\": \"usr\"}, {\"text\": \"Why do you feel that way? Could it be the people your surrounded by making you feel that way?\", \"speaker\": \"sys\", \"strategy\": \"Question\"}, {\"text\": \"I always felt depressed. It is just worst during the holidays because people expect you to be happy and if you aren't, then they blame you for ruining their holiday\", \"speaker\": \"usr\"}, {\"text\": \"I think everyone's off this holiday season. It's not a normal christmas. You're not alone in feeling this way.\", \"speaker\": \"sys\", \"strategy\": \"Restatement or Paraphrasing\"}, {\"text\": \"Yea, I suppose it's better that everyone else feels a little more depressed with me, I guess\", \"speaker\": \"usr\"}, {\"text\": \"At least this holiday\", \"speaker\": \"usr\"}, {\"text\": \"Has anyone specific made you feel this way? I would hope your family doesn't make you feel that your depression ruins Christmas that's horrible\", \"speaker\": \"sys\", \"strategy\": \"Affirmation and Reassurance\"}, {\"text\": \"Well, they don't understand. No, it isn't anybody specific. But, yea, they tend to think I ruin half of everything\", \"speaker\": \"usr\"}, {\"text\": \"The start of the new year is rough too, because you have to start all over again with breaking your goals for the next year, but we don't really need to go there\", \"speaker\": \"usr\"}, {\"text\": \"I think you need to surround yourself with more understanding people.\", \"speaker\": \"sys\", \"strategy\": \"Affirmation and Reassurance\"}, {\"text\": \"I agree\", \"speaker\": \"usr\"}, {\"text\": \"It's hard to find those people though\", \"speaker\": \"usr\"}, {\"text\": \"How often do you feel depressed\", \"speaker\": \"usr\"}, {\"text\": \"It can be challenging but there are understanding people out there. You can't always pick your family. But if they truly make you feel that way you aren't obligated to be there. That's horrible.\", \"speaker\": \"sys\", \"strategy\": \"Others\"}, {\"text\": \"Yea, that's true. I thought about going camping somewhere and wait Christmas out in the woods, but I don't know if freezing my butt off would be better than being with them all\", \"speaker\": \"usr\"}, {\"text\": \"I have struggled my whole life on and off. Learning triggers and ways to cope with them is very important. A positive mindset doesn't cute depression by any means, but it will help in accepting ways to cope\", \"speaker\": \"sys\", \"strategy\": \"Others\"}, {\"text\": \"Anyway, we've been talking for awhile. I Thank you for talking with me. You seem nice.\", \"speaker\": \"usr\"}, {\"text\": \"That is true\", \"speaker\": \"usr\"}, {\"text\": \"You're welcome:) I hope you have a wonderful Christmas and can surround yourself with positivity. Wish you all the best\", \"speaker\": \"sys\", \"strategy\": \"Others\"}, {\"text\": \"Thank you. I hope you have a good day.\", \"speaker\": \"usr\"}, {\"text\": \"Oh, brother. We have to for another minute to get the full reward\", \"speaker\": \"usr\"}], \"seeker_question1\": \"Not really\", \"seeker_question2\": \"No\", \"supporter_question1\": \"Not mobile friendly\", \"supporter_question2\": \"Make it more mobile friendly.\"}", "source": "esconv"}
{"text": "{\"experience_type\": \"Current Experience\", \"emotion_type\": \"depression\", \"problem_type\": \"breakup with partner\", \"situation\": \"My wife cheated on me and wanted a divorce.  I have been super depressed.  My house is a mess.  I have a small business that I have let go.  I need to get up and get things done but have no motivation.  I need help getting motivated again.\", \"survey_score\": {\"seeker\": {\"initial_emotion_intensity\": \"5\", \"empathy\": \"4\", \"relevance\": \"4\", \"final_emotion_intensity\": \"4\"}, \"supporter\": {\"relevance\": \"5\"}}, \"dialog\": [{\"text\": \"I should add (although it doesn't matter). I'm female married to a female.\", \"speaker\": \"usr\"}, {\"text\": \"Hi there! I'm glad you're here\", \"speaker\": \"sys\", \"strategy\": \"Others\"}, {\"text\": \"hi\", \"speaker\": \"usr\"}, {\"text\": \"So you're a female and you're married to a female? There's nothing wrong with that at all!\", \"speaker\": \"sys\", \"strategy\": \"Information\"}, {\"text\": \"Yes....well we are not living together now. We have to file papers for divorce\", \"speaker\": \"usr\"}, {\"text\": \"I see. So you're actually legally married - didn't just have a commitment ceremony?\", \"speaker\": \"sys\", \"strategy\": \"Question\"}, {\"text\": \"Yes legally married\", \"speaker\": \"usr\"}, {\"text\": \"Care to share what led up to filing for divorce?\", \"speaker\": \"sys\", \"strategy\": \"Question\"}, {\"text\": \"She cheated.\", \"speaker\": \"usr\"}, {\"text\": \"And as far as I know is still with the person\", \"speaker\": \"usr\"}, {\"text\": \"I can certainly understand how that feels. I have been in your EXACT situation.\", \"speaker\": \"sys\", \"strategy\": \"Affirmation and Reassurance\"}, {\"text\": \"It's horrible and hard to move on for sure\", \"speaker\": \"usr\"}, {\"text\": \"How long were you with her?\", \"speaker\": \"sys\", \"strategy\": \"Question\"}, {\"text\": \"Don't laugh\", \"speaker\": \"usr\"}, {\"text\": \"Our one year wedding anniversary was this past Sat. Which I know I shouldnt be so miserable but I am. I think because like some people have told me we were still in our honeymoon stage. We were not fighting or having big issues....she just cheated\", \"speaker\": \"usr\"}, {\"text\": \"I'm so incredibly sorry to hear that. You realize this behavior, these choices, are a flaw within her, and not you?\", \"speaker\": \"sys\", \"strategy\": \"Affirmation and Reassurance\"}, {\"text\": \"It's hard to see that. I feel like a failure and not good enough\", \"speaker\": \"usr\"}, {\"text\": \"Like why even get married in the first place if you are just going to cheat\", \"speaker\": \"usr\"}, {\"text\": \"I can completely understand that as well. I blamed myself for quite some time as well.\", \"speaker\": \"sys\", \"strategy\": \"Affirmation and Reassurance\"}, {\"text\": \"Ya you wish you could go back in time and change things or never get married lol\", \"speaker\": \"usr\"}, {\"text\": \"When you go to bed at night, if you can drift off to dream with a clear conscience, then you're doing significantly better than her!\", \"speaker\": \"sys\", \"strategy\": \"Reflection of feelings\"}, {\"text\": \"What are you doing to take care of you during this time?\", \"speaker\": \"sys\", \"strategy\": \"Information\"}, {\"text\": \"Not much at all\", \"speaker\": \"usr\"}, {\"text\": \"I feel like I'm in a funk and can't get out of it. My house is a disaster. I have a small business I am not in the mood to work on....I\\\"ve been slacking in everything\", \"speaker\": \"usr\"}, {\"text\": \"You are important! You matter! Why not do something that is relaxing to you?\", \"speaker\": \"sys\", \"strategy\": \"Providing Suggestions\"}, {\"text\": \"I do need to do something\", \"speaker\": \"usr\"}, {\"text\": \"Do you have any post-it notes? Or paper and scotch tape?\", \"speaker\": \"sys\", \"strategy\": \"Providing Suggestions\"}, {\"text\": \"I do\", \"speaker\": \"usr\"}, {\"text\": \"Here's what I've done for myself, and other folks that are close to me, going through struggles...\", \"speaker\": \"sys\", \"strategy\": \"Providing Suggestions\"}, {\"text\": \"ok\", \"speaker\": \"usr\"}, {\"text\": \"Jot down inspirational messages and hang them up on the bathroom mirror, refrigerator, car, etc. \\\"You matter\\\", \\\"You deserve the best\\\", \\\"You are the shiznit\\\", etc\", \"speaker\": \"sys\", \"strategy\": \"Information\"}, {\"text\": \"the shiznet lol\", \"speaker\": \"usr\"}, {\"text\": \"I will try that\", \"speaker\": \"usr\"}, {\"text\": \"I need to do something\", \"speaker\": \"usr\"}, {\"text\": \"Then, for the tasks that might be getting a bit behind, make a list, in order of importance -- and include a little reward for each task completed.\", \"speaker\": \"sys\", \"strategy\": \"Providing Suggestions\"}, {\"text\": \"Thats a good idea\", \"speaker\": \"usr\"}, {\"text\": \"We have to take care of ourselves. After doing it for awhile, it just might become second nature to ya. And -- if continued, will show gals in the future exactly how you expect to be treated because they'll see you taking care of you (and not settling for nor accepting any doodie)\", \"speaker\": \"sys\", \"strategy\": \"Providing Suggestions\"}, {\"text\": \"I know I keep telling myself if I get my act together (physically, financially, etc) that I would attract better people....the kind I want to be with\", \"speaker\": \"usr\"}, {\"text\": \"Whether you \\\"have your act together\\\" or not, it's up to you to determine who is worthy of being an active part of your life.\", \"speaker\": \"sys\", \"strategy\": \"Information\"}, {\"text\": \"Very true\", \"speaker\": \"usr\"}, {\"text\": \"Ok well thank you for talking to me and the help\", \"speaker\": \"usr\"}], \"seeker_question1\": \"I didn't like having to talk about it but it's reality\", \"seeker_question2\": \"I think it's great\", \"supporter_question1\": \"enjoyed it completely\", \"supporter_question2\": \"not at this time\"}", "source": "esconv"}
{"text": "My sister is an alcoholic as well and also drinks too much, tho not as much as this fellow. I've never been comfortable with the level of her drinking or her personal choices and I live long distance from her. I try to nudge her in more positive directions and in the past 18 months have been offering a few hundred in financial support monthly to her to help her better provide for her kids. About 6 months ago, it came out that her boyfriend has been screaming in her face and laying his hands on her. Usually she beats him up as much or worse - I think it's pure insanity and I told her that she needed to make physical contact a 'red line' and if I heard about it, I would call the local police office and report him.", "source": "dreaddit"}
{"text": "@veronic16912774 @SenKamalaHarris Actually the native Americans were at war constantly with each other murdering and stealing each others land over and over. That's a fact and actual history. It's wasn't a bunch of tree hugging liberals in teepees.", "source": "berkeley"}
{"text": "Jesus Christ those assholes are fucking sick, the males and females both. They're getting off on stories about sex slavery too. I wish I didn't have to share the planet with these sick fucks.", "source": "berkeley"}
{"text": "You should not practice riding a bike on the highway. This is very dangerous and drivers may not be able to avoid your daughter.", "source": "prosocial"}
{"text": "Drop dead come in leagal their won't be a proble you idiots change the laws and you voted no for more money we hat idiots", "source": "berkeley"}
{"text": "{\"experience_type\": \"Current Experience\", \"emotion_type\": \"sadness\", \"problem_type\": \"problems with friends\", \"situation\": \"I have accepted a new job and my work friends are upset that I am leaving them.\", \"survey_score\": {\"seeker\": {\"initial_emotion_intensity\": \"3\", \"empathy\": \"3\", \"relevance\": \"3\", \"final_emotion_intensity\": \"2\"}, \"supporter\": {\"relevance\": \"5\"}}, \"dialog\": [{\"text\": \"Hello\", \"speaker\": \"usr\"}, {\"text\": \"Hello! How are you doing today?\", \"speaker\": \"sys\", \"strategy\": \"Question\"}, {\"text\": \"I am a little down today. How are you?\", \"speaker\": \"usr\"}, {\"text\": \"Not bad for a Monday, but that's often a bummer of a day. What's got you down?\", \"speaker\": \"sys\", \"strategy\": \"Affirmation and Reassurance\"}, {\"text\": \"My friends, who I also work with, are upset with me because I am leaving for a new position.\", \"speaker\": \"usr\"}, {\"text\": \"I am sad that they are upset.\", \"speaker\": \"usr\"}, {\"text\": \"Ah, that can be awkward. Are you happy about the new position?\", \"speaker\": \"sys\", \"strategy\": \"Restatement or Paraphrasing\"}, {\"text\": \"I am going to miss them, but yes... I am happy about it. Maybe a little nervous.\", \"speaker\": \"usr\"}, {\"text\": \"So do you think you are feeling down more because of missing your friends or your nervousness about the new job?\", \"speaker\": \"sys\", \"strategy\": \"Question\"}, {\"text\": \"Honestly I don't know.\", \"speaker\": \"usr\"}, {\"text\": \"I think I would feel alot better about it if my coworkers were more supportive.\", \"speaker\": \"usr\"}, {\"text\": \"That only makes things tougher, doesn't it. So is there a way you could reassure your co-workers that this new position doesn't mean you have left their lives?\", \"speaker\": \"sys\", \"strategy\": \"Providing Suggestions\"}, {\"text\": \"Maybe\", \"speaker\": \"usr\"}, {\"text\": \"What kinds of things do you think might help with that?\", \"speaker\": \"sys\", \"strategy\": \"Others\"}, {\"text\": \"Could you meet for lunch or coffee now and then?\", \"speaker\": \"sys\", \"strategy\": \"Providing Suggestions\"}, {\"text\": \"Or could you all create a standing \\\"group chat\\\" to touch base regularly?\", \"speaker\": \"sys\", \"strategy\": \"Providing Suggestions\"}, {\"text\": \"Well we already have a group chat... we could keep communicating through that.\", \"speaker\": \"usr\"}, {\"text\": \"And lunch a few times a month would be nice, but they are all night shifters and I am going to be a dayshifter.\", \"speaker\": \"usr\"}, {\"text\": \"Cool! But I gather that if you already do that, you don't think that would be enough? Or would it? What else might work?\", \"speaker\": \"sys\", \"strategy\": \"Question\"}, {\"text\": \"Ah, so you think that being on different shifts may be what has you all concerned about losing touch?\", \"speaker\": \"sys\", \"strategy\": \"Restatement or Paraphrasing\"}, {\"text\": \"Yes. We won't even be awake at the same time.\", \"speaker\": \"usr\"}, {\"text\": \"Is there some overlap between the end of your day shift and the beginning of their night shift? Is there a time you are all awake? Maybe dinner for you, but \\\"breakfast\\\" for them?\", \"speaker\": \"sys\", \"strategy\": \"Providing Suggestions\"}, {\"text\": \"That is a good idea\", \"speaker\": \"usr\"}, {\"text\": \"What else might minimize the separation? Do you all have weekends off?\", \"speaker\": \"sys\", \"strategy\": \"Question\"}, {\"text\": \"I will at my new job but they do not.\", \"speaker\": \"usr\"}, {\"text\": \"So maybe the \\\"between shifts\\\" type meeting may help? It might be hard to schedule, but I think you can do that. What do you think?\", \"speaker\": \"sys\", \"strategy\": \"Affirmation and Reassurance\"}, {\"text\": \"Yes, thanks\", \"speaker\": \"usr\"}, {\"text\": \"So, if the \\\"gang\\\" can stay together, what's got you nervous about the new position?\", \"speaker\": \"sys\", \"strategy\": \"Question\"}], \"seeker_question1\": \"no\", \"seeker_question2\": \"no\", \"supporter_question1\": \"Hard not to just try to \\\"solve the problem for them\\\" and get THEM to come up with a solution\", \"supporter_question2\": \"The \\\"strategies box\\\" seemed to be locked in place and missing the ability to scroll down and see everything.\"}", "source": "esconv"}
{"text": "I've dated both a Vietnamese and Chinese man, so I'm kind of excited to see how she adapts to the culture! I know for me, it was hard - but Asian culture is very family and goal oriented.", "source": "berkeley"}
{"text": "You'd have to have some type of brain injury to publicly write and share a letter celebrating a known racist", "source": "berkeley"}
{"text": "Bruh everyone knows to start in saudi arabia those people go every where", "source": "berkeley"}
{"text": "Just let me try to get a couple more words in... do you believe the risk is worth it? Don't you think everyone would be safer is no weapons at all were brought to school? I'm sure you don't want to be seen as the potentially dangerous one.", "source": "prosocial"}
{"text": "gma/gpa are probably typical american retards.", "source": "berkeley"}
{"text": "{\"experience_type\": \"Current Experience\", \"emotion_type\": \"anxiety\", \"problem_type\": \"Procrastination\", \"situation\": \"I have to get a new job soon but it has been a year since I worked like that.\", \"survey_score\": {\"seeker\": {\"initial_emotion_intensity\": \"5\"}, \"supporter\": {}}, \"dialog\": [{\"text\": \"Hello\", \"speaker\": \"usr\"}, {\"text\": \"Hello how are you\", \"speaker\": \"sys\", \"strategy\": \"Question\"}, {\"text\": \"I am ok\", \"speaker\": \"usr\"}, {\"text\": \"HOw are you\", \"speaker\": \"usr\"}, {\"text\": \"Why are just ok? Is there anything specific you would like to talk about?\", \"speaker\": \"sys\", \"strategy\": \"Restatement or Paraphrasing\"}, {\"text\": \"I'm worried that transitioning to full time work will harm my relationship\", \"speaker\": \"usr\"}, {\"text\": \"You seem quite concerned about this new chapter in your life. How will your employment hours affect your relationship?\", \"speaker\": \"sys\", \"strategy\": \"Reflection of feelings\"}, {\"text\": \"I recognize that this is a challenging topic for you to discuss. Is the idea of spending time away from your partner concern you?\", \"speaker\": \"sys\", \"strategy\": \"Restatement or Paraphrasing\"}, {\"text\": \"I too had to relearn a proper balance between my personal and professional life.\", \"speaker\": \"sys\", \"strategy\": \"Self-disclosure\"}, {\"text\": \"She is worried we won't have time for each other but also expects me to support her\", \"speaker\": \"usr\"}, {\"text\": \"It is wonderful to feel that sense of desire and need. You need to make your personal happiness your top priority. I recognize the responsibly you are taking on, and I believe you are capable to balance between the two.\", \"speaker\": \"sys\", \"strategy\": \"Affirmation and Reassurance\"}, {\"text\": \"I would hope that getting the job would show my willingness to support her.\", \"speaker\": \"usr\"}, {\"text\": \"Are you the aggressor in getting more hours, or have your work assignments and responsibilities that have changed? It is important to maintain self happiness and to aspire to make yourself your number one each and every day.\", \"speaker\": \"sys\", \"strategy\": \"Reflection of feelings\"}, {\"text\": \"I want to get a good paying job so I can live somewhere better\", \"speaker\": \"usr\"}, {\"text\": \"I can relate. In my younger years, my end goal was to advance in life emotionally, mentally and physically. I always longed for a home to call my own. With time, patience, and dedication, you too will have you desires met.\", \"speaker\": \"sys\", \"strategy\": \"Self-disclosure\"}, {\"text\": \"It is a matter of finding a balance on the way there. She loves me but has trouble believing me because I've been rolled over by the pandemic so many times.\", \"speaker\": \"usr\"}, {\"text\": \"It has been proven that the best way to find balance and harmony is to always look forward to the potential in your future. It is very apparent you are a dedicated and loyal partner and that will show itself in time. We all have had to take two steps back in order to take one step forward due to this pandemic. The fact that you are aware of potential issues down the road and have proactively reached out to discuss this shows myself (as well as yourself) that you need to continue to focus on your goals and in time your partners happiness will naturally come out.\", \"speaker\": \"sys\", \"strategy\": \"Providing Suggestions\"}, {\"text\": \"I feel like I have reached the point that reassurance can bring me and need to take action.\", \"speaker\": \"usr\"}, {\"text\": \"Make sure you stay well rested as sleep can improve your positive energy. Stay hydrated and nourish your body well as keeping your body in tune with a strong and focused mind does the body and soul good.\", \"speaker\": \"sys\", \"strategy\": \"Information\"}, {\"text\": \"Do you feel that you are in a healthy place to deal with your recent life changes?\", \"speaker\": \"sys\", \"strategy\": \"Question\"}, {\"text\": \"You stated earlier that you have reached a point of reassurance and I want you to free comfortable with all the tools you will need to move forward.\", \"speaker\": \"sys\", \"strategy\": \"Restatement or Paraphrasing\"}, {\"text\": \"**feel**\", \"speaker\": \"sys\", \"strategy\": \"Others\"}, {\"text\": \"I am trying to get healthier.\", \"speaker\": \"usr\"}, {\"text\": \"It is healthy that your recognize your need to be healthier. Outside of the items discussed earlier, do you feel that there are other means to find your self satisfaction?\", \"speaker\": \"sys\", \"strategy\": \"Providing Suggestions\"}, {\"text\": \"Taking a peaceful stroll is very good for you as well as taking small breaks such as this to reflect\", \"speaker\": \"sys\", \"strategy\": \"Providing Suggestions\"}], \"seeker_question1\": \"\", \"seeker_question2\": \"\", \"supporter_question1\": \"No it was a great experience\", \"supporter_question2\": \"Not that I am aware\"}", "source": "esconv"}
{"text": "{\"experience_type\": \"Current Experience\", \"emotion_type\": \"anxiety\", \"problem_type\": \"Procrastination\", \"situation\": \"I keep trying to get started, but my kitchen mess seems so overwhelming.\", \"survey_score\": {\"seeker\": {\"initial_emotion_intensity\": \"3\", \"empathy\": \"5\", \"relevance\": \"5\", \"final_emotion_intensity\": \"2\"}, \"supporter\": {\"relevance\": \"5\"}}, \"dialog\": [{\"text\": \"I just can't make myself get started. There are so many dishes.\", \"speaker\": \"usr\"}, {\"text\": \"Sometimes even every day tasks can seem overwhelming. Do you have an idea of what makes you put off the dishes?\", \"speaker\": \"sys\", \"strategy\": \"Affirmation and Reassurance\"}, {\"text\": \"I feel like I just don't know where to start.\", \"speaker\": \"usr\"}, {\"text\": \"How long have you been hesitant to start?\", \"speaker\": \"sys\", \"strategy\": \"Question\"}, {\"text\": \"I guess it has been a few days now.\", \"speaker\": \"usr\"}, {\"text\": \"I get it. Sometimes I find dishes so overwhelming that I will let them pile up. Maybe together we can figure out a way to break it into smaller tasks.\", \"speaker\": \"sys\", \"strategy\": \"Self-disclosure\"}, {\"text\": \"Ok, I suppose I can try that. But I don't quite know where to start.\", \"speaker\": \"usr\"}, {\"text\": \"It is so hard to figure out where to start sometimes. Ok, I'll help with a plan. Maybe you can glance at the dishes and pull out the largest one that is dirty. Let's start there.\", \"speaker\": \"sys\", \"strategy\": \"Providing Suggestions\"}, {\"text\": \"Ok. That makes sense. There is a large pot. I think if I was that, maybe it would get me started.\", \"speaker\": \"usr\"}, {\"text\": \"yes, starting with the large pot would be a great place to start! Good thinking!\", \"speaker\": \"sys\", \"strategy\": \"Affirmation and Reassurance\"}, {\"text\": \"Ok, but then what?\", \"speaker\": \"usr\"}, {\"text\": \"Well, washing the pot will make the overall task look smaller. Then, let's pick a second type of dish to focus on. After you wash the large pot, try to focus on larger bowls, then plates and cups. You could leave the silverware for last.\", \"speaker\": \"sys\", \"strategy\": \"Providing Suggestions\"}, {\"text\": \"Oh, thank you so much! It helps my anxiety to talk through a plan. Sometimes I get so anxious, it is hard to figure out how to break a large task down to something manageable on my own.\", \"speaker\": \"usr\"}, {\"text\": \"I am always happy to help. I find it difficult sometimes too.\", \"speaker\": \"sys\", \"strategy\": \"Self-disclosure\"}, {\"text\": \"I really think you are figure out how to get through this and help your anxiety.\", \"speaker\": \"sys\", \"strategy\": \"Affirmation and Reassurance\"}, {\"text\": \"Wow do you think so?\", \"speaker\": \"usr\"}, {\"text\": \"Have you every had anxiety like this?\", \"speaker\": \"usr\"}, {\"text\": \"Yes, I have. I often look at work assignments as larger than they are and can only get started when I break them down.\", \"speaker\": \"sys\", \"strategy\": \"Self-disclosure\"}, {\"text\": \"I really think you have done great job figuring out how to tackle the task that is causing you anxiety.\", \"speaker\": \"sys\", \"strategy\": \"Affirmation and Reassurance\"}, {\"text\": \"I think so too. I hope I can apply this to other things.\", \"speaker\": \"usr\"}, {\"text\": \"So, it's easy to figure out with things like dishes because there is a size. How do you do it when it is a task that isn't physical like this. Like work?\", \"speaker\": \"usr\"}, {\"text\": \"So, I see that you get how to do this with this task, but it is still hard to figure out how to conquer tasks that aren't physical like dishes.\", \"speaker\": \"sys\", \"strategy\": \"Restatement or Paraphrasing\"}], \"seeker_question1\": \"I liked the interaction\", \"seeker_question2\": \"no\", \"supporter_question1\": \"it was fun.\", \"supporter_question2\": \"no\"}", "source": "esconv"}
{"text": "I think Danny Devito should play Mulan. I mean, race and sex doesn't matter anymore, so pick somebody who actually has talent. Also LMAO at her shooting a bow xD where did they get this failed abortion? Isssa mAh dooty to fight teh mongorians tryna break down mAh sheeety wall Bing bong ching ching dong", "source": "berkeley"}
{"text": "i remember her getting drunk and and ranting about a fuck buddy she was angry at. she came up with the brilliant idea of throwing a brick with a pie recipe tied to it through his window (i dont know). she told me to drive her to his house so she could do that and i said i didn't think it was a good idea. she told me if i didn't do it she would drunk drive there with my little brothers in the car. i haven't seen her in 6 and a half years.", "source": "dreaddit"}
{"text": "The northern tribes are a bunch of pussies. They engaged in constant warfare and conquest .... it bares mentioning that when they did so, they would slaughter unarmed men, women and children without hesitation. They should be grateful that they were shown a level of mercy that they never showed their vanquished foes.", "source": "berkeley"}
{"text": "oh shit there was an attack on my fellow mexicans down in el paso. f", "source": "berkeley"}
{"text": "I have so much stress over money on a daily basis that sometimes it’s nearly unbearable. As I mentioned, I have received some emergency assistance in the form of loans through /r/borrow, for which I am beyond grateful. But though they provide temporary relief, the loans themselves just end up being part of this vicious circle and mire me even deeper in the debt I’m trying to escape. I know more loans aren’t the answer. So I’m looking for a different kind of help.", "source": "dreaddit"}
{"text": "Imagine seeing this pussy spread in the church being fucked for hours where no one has any clue what happened there", "source": "berkeley"}
{"text": "But there you were, laughing and being affectionate with your newest victim. Same dark hair, same bubbly personality. She's a prettier, skinnier version of me. Everything you made me believe I needed to be but could never change. I was visibly shaking as I tried to remain calm in front of the new guy I have been dating.", "source": "dreaddit"}
{"text": "{\"experience_type\": \"Current Experience\", \"emotion_type\": \"depression\", \"problem_type\": \"job crisis\", \"situation\": \"it has been difficult to get another job after i was furloughed\", \"survey_score\": {\"seeker\": {\"initial_emotion_intensity\": \"4\", \"empathy\": \"5\", \"relevance\": \"5\", \"final_emotion_intensity\": \"1\"}, \"supporter\": {\"relevance\": \"5\"}}, \"dialog\": [{\"text\": \"Hi\", \"speaker\": \"sys\", \"strategy\": \"Affirmation and Reassurance\"}, {\"text\": \"hello\", \"speaker\": \"usr\"}, {\"text\": \"How are you friend?\", \"speaker\": \"sys\", \"strategy\": \"Affirmation and Reassurance\"}, {\"text\": \"i am in depression friend, don't really know what else to do\", \"speaker\": \"usr\"}, {\"text\": \"What' s your problem friend?\", \"speaker\": \"sys\", \"strategy\": \"Affirmation and Reassurance\"}, {\"text\": \"i was furloughed and getting another good job is like mission impossible\", \"speaker\": \"usr\"}, {\"text\": \"don't worry\", \"speaker\": \"sys\", \"strategy\": \"Affirmation and Reassurance\"}, {\"text\": \"Try to do your job enthusiastically..\", \"speaker\": \"sys\", \"strategy\": \"Affirmation and Reassurance\"}, {\"text\": \"the is no job anywhere\", \"speaker\": \"usr\"}, {\"text\": \"i have to go to the food shelter last month\", \"speaker\": \"usr\"}, {\"text\": \"that how bad things are going\", \"speaker\": \"usr\"}, {\"text\": \"Do you know of nay business you own?\", \"speaker\": \"sys\", \"strategy\": \"Affirmation and Reassurance\"}, {\"text\": \"didnt get you\", \"speaker\": \"usr\"}, {\"text\": \"ok\", \"speaker\": \"sys\", \"strategy\": \"Affirmation and Reassurance\"}, {\"text\": \"i have been going all around looking for a part time job but nothing yet\", \"speaker\": \"usr\"}, {\"text\": \"don't worry, keep trying..\", \"speaker\": \"sys\", \"strategy\": \"Affirmation and Reassurance\"}, {\"text\": \"Definitely get a good job, keep trying..\", \"speaker\": \"sys\", \"strategy\": \"Affirmation and Reassurance\"}, {\"text\": \"yes i am still trying every angle\", \"speaker\": \"usr\"}, {\"text\": \"thanks, i will keep trying\", \"speaker\": \"usr\"}, {\"text\": \"very good\", \"speaker\": \"sys\", \"strategy\": \"Affirmation and Reassurance\"}, {\"text\": \"All the best\", \"speaker\": \"sys\", \"strategy\": \"Affirmation and Reassurance\"}, {\"text\": \"thanks\", \"speaker\": \"usr\"}, {\"text\": \"good luck to you too\", \"speaker\": \"usr\"}, {\"text\": \"nice talking to you\", \"speaker\": \"usr\"}, {\"text\": \"Thanks a lot friend...\", \"speaker\": \"sys\", \"strategy\": \"Affirmation and Reassurance\"}, {\"text\": \"me too..\", \"speaker\": \"sys\", \"strategy\": \"Affirmation and Reassurance\"}, {\"text\": \"and please is there any other way i can get job easily\", \"speaker\": \"usr\"}, {\"text\": \"i have tried all my best\", \"speaker\": \"usr\"}, {\"text\": \"Do you search on social web sites\", \"speaker\": \"sys\", \"strategy\": \"Affirmation and Reassurance\"}, {\"text\": \"no not yet\", \"speaker\": \"usr\"}, {\"text\": \"give it a try and you will definitely get a good job\", \"speaker\": \"sys\", \"strategy\": \"Affirmation and Reassurance\"}, {\"text\": \"ok, i will\", \"speaker\": \"usr\"}, {\"text\": \"thanks for that\", \"speaker\": \"usr\"}, {\"text\": \"ok good luck\", \"speaker\": \"sys\", \"strategy\": \"Affirmation and Reassurance\"}, {\"text\": \"same here\", \"speaker\": \"usr\"}, {\"text\": \"thanks\", \"speaker\": \"usr\"}, {\"text\": \"Hmm ok, anything else?\", \"speaker\": \"sys\", \"strategy\": \"Affirmation and Reassurance\"}, {\"text\": \"nothing at all\", \"speaker\": \"usr\"}, {\"text\": \"you have been more than helpful\", \"speaker\": \"usr\"}, {\"text\": \"thank you,\", \"speaker\": \"sys\", \"strategy\": \"Affirmation and Reassurance\"}, {\"text\": \"ok bye, god bless you..\", \"speaker\": \"sys\", \"strategy\": \"Affirmation and Reassurance\"}], \"seeker_question1\": \"everything is perfect\", \"seeker_question2\": \"nothing\", \"supporter_question1\": \"No\", \"supporter_question2\": \"Nothing\"}", "source": "esconv"}
{"text": "I would like to surprise my friend with the kindness of strangers by crowd funding her vet bill. Please take a look at the [gofundme <url> I have set up. Any and all donations are greatly appreciated. Even if you are unable to donate, shares on facebook and twitter will be very helpful. Thank you for taking the time to read my request.", "source": "dreaddit"}
{"text": "They are 2 hours away and I got to visit them recently and I squealed like a girl most of that drive. Two dudes and two girls are what this group consists of. I don't have to walk on egg shells, as someone who feels like a fuck up always it's nice to see four other people like me that like me. Does anyone else have any experiences like this? Where they have anxiety, whether it be bad or mild, and when around certain people it just melts away?", "source": "dreaddit"}
{"text": "{\"experience_type\": \"Current Experience\", \"emotion_type\": \"sadness\", \"problem_type\": \"breakup with partner\", \"situation\": \"I broke up with my girlfriend since we didn't have chemistry and now I feel alone.\", \"survey_score\": {\"seeker\": {\"initial_emotion_intensity\": \"3\"}, \"supporter\": {}}, \"dialog\": [{\"text\": \"Hello. Thank you for joining the peer support session. How can I be of help today?\", \"speaker\": \"sys\", \"strategy\": \"Question\"}, {\"text\": \"I broke up with my girlfriend since we didnt have chemistry and now I feel alone.\", \"speaker\": \"usr\"}, {\"text\": \"I am sorry to hear that. It must be even more difficult in a pandemic time. When did this happen? If you don't mind telling me more about it.\", \"speaker\": \"sys\", \"strategy\": \"Restatement or Paraphrasing\"}, {\"text\": \"This happened a month or so ago.\", \"speaker\": \"usr\"}, {\"text\": \"How are you doing recently? Do you have any coping mechanism that you can share with me? I can lend you an ear.\", \"speaker\": \"sys\", \"strategy\": \"Others\"}, {\"text\": \"I'm lonely and bored. Feel like there is nothing to do by myself. I play video games to cope.\", \"speaker\": \"usr\"}, {\"text\": \"I went through the same process. I understand what you are feeling. I am glad that you are on Mechanical Turk and interacting with people. Which area do you live in? It is springtime and pretty outside. Have you thought about walking more walks?\", \"speaker\": \"sys\", \"strategy\": \"Affirmation and Reassurance\"}, {\"text\": \"Talking a walk is a good idea. Unfortunately it is cold today but tomorrow it is supposed to be nicer.\", \"speaker\": \"usr\"}, {\"text\": \"*taking\", \"speaker\": \"usr\"}, {\"text\": \"Yeah, I like to clear my head by taking a walk. I know it is a temporary relief, but it helps regulate my mood. Do you live with people, do you have conversation with people regularly?\", \"speaker\": \"sys\", \"strategy\": \"Self-disclosure\"}, {\"text\": \"No I live alone. I don't like the people at work either so I don't talk to them. Every now and then I talk to a friend via text, I see my family rarely but will see them this weekend due to the holiday.\", \"speaker\": \"usr\"}, {\"text\": \"It sounds like you know what you are doing and you have a support system of your choice. Do you share stories like breaking up with girlfriend with them?\", \"speaker\": \"sys\", \"strategy\": \"Reflection of feelings\"}, {\"text\": \"I share a little but don't want to burden anyone with my issues.\", \"speaker\": \"usr\"}, {\"text\": \"I have the same tendency. I don't feel comfortable imposing my struggle and my thoughts with people. I would personally recommend you sharing a little bit more with family during Easter. It doesn't have to be the intimate details of the breakup, it can be generic feeling, like loneliness.\", \"speaker\": \"sys\", \"strategy\": \"Information\"}, {\"text\": \"Thank you for listening and giving good advice. You are really good at giving support!\", \"speaker\": \"usr\"}, {\"text\": \"I am glad that you find it helpful. I wish I can be around to hear more about it.\", \"speaker\": \"sys\", \"strategy\": \"Providing Suggestions\"}, {\"text\": \"That's sweet of you to say that.\", \"speaker\": \"usr\"}, {\"text\": \"I hope you all the best.\", \"speaker\": \"sys\", \"strategy\": \"Others\"}, {\"text\": \"THank you . You too. Good luck with what you do.\", \"speaker\": \"usr\"}, {\"text\": \"Are you a professional support person?\", \"speaker\": \"usr\"}, {\"text\": \"No. I actually recommend a book called It is ok that you are not OK. It helped me personally and makes me a more emotionally intelligent person.\", \"speaker\": \"sys\", \"strategy\": \"Providing Suggestions\"}, {\"text\": \"I will look for that book. Thank you for the recommendation.\", \"speaker\": \"usr\"}], \"seeker_question1\": \"no\", \"seeker_question2\": \"no\", \"supporter_question1\": \"\", \"supporter_question2\": \"\"}", "source": "esconv"}
{"text": "A lot of people might find that racial slur offensive. Did you know that Jewish people have contributed a lot to modern science and literature that we all enjoy?", "source": "prosocial"}
{"text": "I'm not sure if he was lying to me, she never found out the truth, she s lying, I have no idea. I really appreciate everyone's advice. I then mentioned I was under the impression from my parents that we weren't actually related but that I was happy to talk to her and that I didn't actually know. She opened that message and never responded so I guess we'll see what happens. Probably last edit: she said she has gotten a DNA test with him in the last and it says 99% he is her father.", "source": "dreaddit"}
{"text": "**While at a shelter** Depending on the nature of the shelter, you may be asked to follow specific security rules designed to protect you, other residents, and the shelter staff. Although those rules may sometimes seem a little bit restrictive, it’s important to follow them for everyone’s safety. If the abusive partner had access to your cell phone or your account, you may be asked to remove your phone’s battery, and maybe even wrap it in tinfoil to block any transmissions. Although this may sound a little bit extreme, this might be done because a cell phone may be used to track you or find out where you’re going.", "source": "dreaddit"}
{"text": "I have something to say about this, I am free to do so, right?", "source": "prosocial"}
{"text": "as another bisexual woman who didnt know this existed, THANK YOU SO MUCH FOR THIS", "source": "berkeley"}
{"text": "You shouldn't shame people because of their height. Nobody can control their height so you discriminate against them.", "source": "prosocial"}
{"text": "That isn't an excuse to not pick up after yourself. Be considerate of others around you.", "source": "prosocial"}
{"text": "{\"experience_type\": \"Current Experience\", \"emotion_type\": \"sadness\", \"problem_type\": \"problems with friends\", \"situation\": \"My friends are segregating me because of deciding to be a born again Christian\", \"survey_score\": {\"seeker\": {\"initial_emotion_intensity\": \"4\", \"empathy\": \"4\", \"relevance\": \"5\", \"final_emotion_intensity\": \"1\"}, \"supporter\": {\"relevance\": \"5\"}}, \"dialog\": [{\"text\": \"hello\", \"speaker\": \"usr\"}, {\"text\": \"Hello, and how are you feeling today?\", \"speaker\": \"sys\", \"strategy\": \"Question\"}, {\"text\": \"so am having a hard time with my friends excluding me in everything because of my religious stance\", \"speaker\": \"usr\"}, {\"text\": \"I have had a similar situation not long ago. It was hard, but once I told my friend it was bothering me, he changed his behavior.\", \"speaker\": \"sys\", \"strategy\": \"Self-disclosure\"}, {\"text\": \"Hve you tried talking with your friend?\", \"speaker\": \"sys\", \"strategy\": \"Question\"}, {\"text\": \"i did tell them but mostly say that they feel uncomfortable cause i dont drink and do all those things\", \"speaker\": \"usr\"}, {\"text\": \"It's good that you stood your ground. For that you should be proud.\", \"speaker\": \"sys\", \"strategy\": \"Affirmation and Reassurance\"}, {\"text\": \"i hardly have friends and the two friends i have are treating me like am no longer one of them\", \"speaker\": \"usr\"}, {\"text\": \"Have you considered, being more active in your religious community? It could be a great place to make friends.\", \"speaker\": \"sys\", \"strategy\": \"Question\"}, {\"text\": \"i am as active as i can be. they are friendly and supportive but right now they only ever socialize on church events or church. not really a friend i can confide in when facing hardship\", \"speaker\": \"usr\"}, {\"text\": \"It definitely takes time developing new friendships. Have your tired inviting someone from church to hang out, outside of church event?\", \"speaker\": \"sys\", \"strategy\": \"Providing Suggestions\"}, {\"text\": \"no not really. I am trying to take time to at least get used to some in church first before anything\", \"speaker\": \"usr\"}, {\"text\": \"I wouldn't want an awkward silence when we are together.\", \"speaker\": \"usr\"}, {\"text\": \"Well that's great that you're taking those first steps. I believe that in due time those friendships will blossom. Patience is key.\", \"speaker\": \"sys\", \"strategy\": \"Affirmation and Reassurance\"}, {\"text\": \"but does it make me a bad person giving up on my childhood friendships\", \"speaker\": \"usr\"}, {\"text\": \"should i try harder to make them see what am doing\", \"speaker\": \"usr\"}, {\"text\": \"It also sounds to me like maybe you're over worrying. Have you considered seeing a movie where you wouldn't have to worry about awkward silence?\", \"speaker\": \"sys\", \"strategy\": \"Providing Suggestions\"}, {\"text\": \"Sometimes people just move on from one another. I personally wouldn't try to make these friends see what you are doing. I think you should focus on you, and look to the future.\", \"speaker\": \"sys\", \"strategy\": \"Self-disclosure\"}, {\"text\": \"yes, movies like war room and break through or a case for Christ but will they like them, what if they don't and they just come so they can be nice\", \"speaker\": \"usr\"}, {\"text\": \"its hard but i guess its also true. i usually have a hard time leaving things behind but somethings just happen.\", \"speaker\": \"usr\"}, {\"text\": \"Thank you for your insights\", \"speaker\": \"usr\"}, {\"text\": \"It doesn't hurt to ask what movie they would be interested in seeing. Maybe you can come to a mutual agreement!\", \"speaker\": \"sys\", \"strategy\": \"Providing Suggestions\"}, {\"text\": \"You're very welcome. If you need anything else just ask.\", \"speaker\": \"sys\", \"strategy\": \"Others\"}, {\"text\": \"of course your right. I worry too much about details . Thank you this has been helpful\", \"speaker\": \"usr\"}, {\"text\": \"Thank you I kind of feel a bit relieved. someone telling me its okay to let go\", \"speaker\": \"usr\"}, {\"text\": \"I would suggest letting things happen as naturally as possible! And yes, it's okay to move on and live a life that makes YOU happy!\", \"speaker\": \"sys\", \"strategy\": \"Affirmation and Reassurance\"}, {\"text\": \"Thank you so much and stay blessed.\", \"speaker\": \"usr\"}, {\"text\": \"You too!\", \"speaker\": \"sys\", \"strategy\": \"Others\"}, {\"text\": \"you have a blessed afternoon\", \"speaker\": \"usr\"}, {\"text\": \"Same to you!\", \"speaker\": \"sys\", \"strategy\": \"Others\"}], \"seeker_question1\": \"i liked how easy it is to do the work\", \"seeker_question2\": \"nothing\", \"supporter_question1\": \"I enjoyed this. I consider myself a good listener, and always try to help others in my own life.\", \"supporter_question2\": \"The training was a bit long and the base pay is low. I would hope that after doing the training once, you wouldn't have to repeat it each time.\"}", "source": "esconv"}
{"text": "Not true, only from certain countries like Pakistan", "source": "berkeley"}
{"text": "I apologize if this is the wrong subreddit for this topic but i'm at my wit's end... I've been homeless since February and i'm now trying to find my own apartment and start living independently for the first time but I need some advice...I've been couch-hopping here & there for a while and i'm staying with a relative who's been helping me but i'm on a limited time frame and I feel like i may not get anything in time...I applied for an apartment but was rejected due to past apartment debts. What can I do t get approved, and do I have a shot at public assistance? I have aspergers and I don't make a lot of money at my current job.", "source": "dreaddit"}
{"text": "{\"experience_type\": \"Current Experience\", \"emotion_type\": \"sadness\", \"problem_type\": \"Appearance Anxiety\", \"situation\": \"Looking in the mirror I know I\\u2019m fine enough to go out in public. But I still feel horrible about what I see. And I know it\\u2019s never going to be good enough.\", \"survey_score\": {\"seeker\": {\"initial_emotion_intensity\": \"3\"}, \"supporter\": {}}, \"dialog\": [{\"text\": \"Dark situation\", \"speaker\": \"usr\"}, {\"text\": \"I can do better\", \"speaker\": \"usr\"}, {\"text\": \"What do you think?\", \"speaker\": \"usr\"}, {\"text\": \"Perhaps it\\u2019s all in my head.\", \"speaker\": \"usr\"}, {\"text\": \"Or maybe I\\u2019m expected to feel a certain way.\", \"speaker\": \"usr\"}, {\"text\": \"I can try to ignore it.\", \"speaker\": \"usr\"}, {\"text\": \"Sometimes that is hard.\", \"speaker\": \"usr\"}, {\"text\": \"I will look to positive experiences\", \"speaker\": \"usr\"}, {\"text\": \"That way once the darkness takes off.\", \"speaker\": \"usr\"}, {\"text\": \"I will be free again.\", \"speaker\": \"usr\"}, {\"text\": \"What do you think?\", \"speaker\": \"usr\"}, {\"text\": \"Perhaps I\\u2019m alone in this support chat\", \"speaker\": \"usr\"}, {\"text\": \"That\\u2019s okay. I will get better.\", \"speaker\": \"usr\"}, {\"text\": \"For all our sakes. But mostly my own.\", \"speaker\": \"usr\"}, {\"text\": \"No, don't say that. There are people that are listening\", \"speaker\": \"sys\", \"strategy\": \"Affirmation and Reassurance\"}, {\"text\": \"Listening is good.\", \"speaker\": \"usr\"}, {\"text\": \"Being heard.\", \"speaker\": \"usr\"}, {\"text\": \"Are there problems you would like to talk about?\", \"speaker\": \"sys\", \"strategy\": \"Question\"}, {\"text\": \"No echos in the dark.\", \"speaker\": \"usr\"}, {\"text\": \"I think I don\\u2019t belong.\", \"speaker\": \"usr\"}, {\"text\": \"Why don't you feel like you belong? We're all human :). Have you been having these feelings for a long time?\", \"speaker\": \"sys\", \"strategy\": \"Affirmation and Reassurance\"}, {\"text\": \"Just a while.\", \"speaker\": \"usr\"}, {\"text\": \"Sometimes feels like I work so hard. To the point of exhaustion. And yet never get anywhere.\", \"speaker\": \"usr\"}, {\"text\": \"That's okay for you to have those feelings. The fact that you reached out shows you are getting somewhere.\", \"speaker\": \"sys\", \"strategy\": \"Affirmation and Reassurance\"}, {\"text\": \"Not sure\", \"speaker\": \"usr\"}, {\"text\": \"Hard to be sure. Certainty is in short supply.\", \"speaker\": \"usr\"}, {\"text\": \"It seems you would like to make progress with your problems. Would you like to discuss them more?\", \"speaker\": \"sys\", \"strategy\": \"Reflection of feelings\"}, {\"text\": \"Yeah progress is all one can hope for. A little every day. Win an inch to win a mile. But having the stamina to keep at it seems difficult.\", \"speaker\": \"usr\"}, {\"text\": \"Like taking so much risk just for a big win ya know. And that win is still a long way out of sight. But I keep trying because I know if I don\\u2019t it won\\u2019t go away.\", \"speaker\": \"usr\"}], \"seeker_question1\": \"Lack of understanding\", \"seeker_question2\": \"Time spent\", \"supporter_question1\": \"Too long\", \"supporter_question2\": \"Please match me with a participant faster. I ended up getting sidetracked by something else while I was waiting and couldn't respond in time.\"}", "source": "esconv"}
{"text": "{\"experience_type\": \"Current Experience\", \"emotion_type\": \"fear\", \"problem_type\": \"job crisis\", \"situation\": \"I feel like my employees are working against me.\", \"survey_score\": {\"seeker\": {\"initial_emotion_intensity\": \"4\", \"empathy\": \"5\", \"relevance\": \"5\", \"final_emotion_intensity\": \"2\"}, \"supporter\": {\"relevance\": \"5\"}}, \"dialog\": [{\"text\": \"hello, how may i help you today?\", \"speaker\": \"sys\", \"strategy\": \"Question\"}, {\"text\": \"Hi, how are you?\", \"speaker\": \"usr\"}, {\"text\": \"i am good how are you?\", \"speaker\": \"sys\", \"strategy\": \"Question\"}, {\"text\": \"I feel like one of my employees is gossiping and seeking attention of my bosses.\", \"speaker\": \"usr\"}, {\"text\": \"why do you feel like that?\", \"speaker\": \"sys\", \"strategy\": \"Others\"}, {\"text\": \"I am not sure. She is telling me things that by supervisor should tell me. She is saying \\\"He told me this...\\\".\", \"speaker\": \"usr\"}, {\"text\": \"have you asked your supervisor about it?\", \"speaker\": \"sys\", \"strategy\": \"Others\"}, {\"text\": \"Not yet. It just started last week. I am thinking about asking this week. He usually calls me.\", \"speaker\": \"usr\"}, {\"text\": \"i can understand how you are feeling i have been through some situations like that before\", \"speaker\": \"sys\", \"strategy\": \"Reflection of feelings\"}, {\"text\": \"Thanks. Have you tried anything that has been helpful?\", \"speaker\": \"usr\"}, {\"text\": \"what i did is just talk to the person about the situation and let them know how i was feeling\", \"speaker\": \"sys\", \"strategy\": \"Providing Suggestions\"}, {\"text\": \"Should I talk with my employee first or my boss?\", \"speaker\": \"usr\"}, {\"text\": \"i would talk to your boss first that would be best\", \"speaker\": \"sys\", \"strategy\": \"Providing Suggestions\"}, {\"text\": \"let him know everything you are feeling\", \"speaker\": \"sys\", \"strategy\": \"Others\"}, {\"text\": \"just don't worry to much about the situation and don't let it stress you out everything will be okay\", \"speaker\": \"sys\", \"strategy\": \"Affirmation and Reassurance\"}, {\"text\": \"That sounds like a good plan. I am only stressed because it is hurtful and my employee likes to beb the center of attention.\", \"speaker\": \"usr\"}, {\"text\": \"I understand what you mean about that just do not worry about people like that your main focus is doing your job\", \"speaker\": \"sys\", \"strategy\": \"Self-disclosure\"}, {\"text\": \"people are going to talk but you have to just ignore them and move on do not worry about what people say or think about you\", \"speaker\": \"sys\", \"strategy\": \"Information\"}, {\"text\": \"Yeah. I am trying to detach from it but my ego is getting hurt, which usually doesn't happen.\", \"speaker\": \"usr\"}, {\"text\": \"you will be okay no matter what\", \"speaker\": \"sys\", \"strategy\": \"Self-disclosure\"}, {\"text\": \"That means a lot. That was a nice thing to say!\", \"speaker\": \"usr\"}, {\"text\": \"the only way the situation will be solved is by communicating and expressing your feelings\", \"speaker\": \"sys\", \"strategy\": \"Providing Suggestions\"}, {\"text\": \"I will do that the next time I speak with my supervisor. Thanks for the guidance.\", \"speaker\": \"usr\"}], \"seeker_question1\": \"\", \"seeker_question2\": \"\", \"supporter_question1\": \"\", \"supporter_question2\": \"\"}", "source": "esconv"}
{"text": "I'm 29 and I've just committed to moving into a shared apartment in my city centre. I've never lived in a place like this before because it's an en-suite with my own double bedroom and bathroom, but the kitchen and lounge is shared with about 15 other 'profressionals' It's right in the centre of a bustling city near all the bars and music venues. I've always lived in the suburbs but I've always felt a bit disconnected from everything because most of my (limited) social life takes place in the city centre. But now I'm scared because I'm such an introvert and there's going to be lots of people around all the time and I'm worried I've made a mistake. Another big worry of mine is that my ex best friend lives just a few streets away from where I will be living and we are going to be sharing the same supermarket etc.", "source": "dreaddit"}
{"text": "Ahh yeah good point. Hanging out with my queer friends in general is a lot easier when it comes to pronouns, I rarely even have to ask because someone usually lets me know so I didn't really think about that.", "source": "berkeley"}
{"text": "{\"experience_type\": \"Current Experience\", \"emotion_type\": \"depression\", \"problem_type\": \"ongoing depression\", \"situation\": \"I went and spent so much money on xmas gifts and now I don't know how I can pay the credit cards off\", \"survey_score\": {\"seeker\": {\"initial_emotion_intensity\": \"5\", \"empathy\": \"3\", \"relevance\": \"4\", \"final_emotion_intensity\": \"3\"}, \"supporter\": {\"relevance\": \"4\"}}, \"dialog\": [{\"text\": \"Good evening\", \"speaker\": \"usr\"}, {\"text\": \"Hey, how are you?\", \"speaker\": \"sys\", \"strategy\": \"Restatement or Paraphrasing\"}, {\"text\": \"I am pretty depressed and stressed out\", \"speaker\": \"usr\"}, {\"text\": \"Maybe I can be of assistance? What is troubling you?\", \"speaker\": \"sys\", \"strategy\": \"Question\"}, {\"text\": \"I overspent and now feel gulity and I have no idea how I can pay my credit cards off\", \"speaker\": \"usr\"}, {\"text\": \"I just saw sale and couldn't pass it up now I am overwhelmed\", \"speaker\": \"usr\"}, {\"text\": \"I see, maybe we can find a solution?\", \"speaker\": \"sys\", \"strategy\": \"Restatement or Paraphrasing\"}, {\"text\": \"sure thats why I m talking to you . so what do you recommend\", \"speaker\": \"usr\"}, {\"text\": \"Is it important as in do you really need it, if not. Can you return it?\", \"speaker\": \"sys\", \"strategy\": \"Providing Suggestions\"}, {\"text\": \"No I got on sale on line . no returns\", \"speaker\": \"usr\"}, {\"text\": \"I see, so you have to pay it. I suggest making a plan of action, trying to pay at least the minimal balance, and try work out a saving plan to pay it off.\", \"speaker\": \"sys\", \"strategy\": \"Providing Suggestions\"}, {\"text\": \"Yes I realize that but I have no job. I have minimal balance in a week of 100\", \"speaker\": \"usr\"}, {\"text\": \"Okay, can you reduce any expenses? Maybe a subscription?\", \"speaker\": \"sys\", \"strategy\": \"Information\"}, {\"text\": \"I don't have a job and husband pays all the bills and subscriptions. We live paycheck to paycheck and he said this is my fault i pay\", \"speaker\": \"usr\"}, {\"text\": \"this would be fine if i had an income and had money that i could do that but I told you before I don't have a job so that doesn't help me\", \"speaker\": \"usr\"}, {\"text\": \"If you have more free time, you can spend it on Amazon Mturk? It is a good way to earn extra money.\", \"speaker\": \"sys\", \"strategy\": \"Affirmation and Reassurance\"}, {\"text\": \"That sounds interesting. How do I make money\", \"speaker\": \"usr\"}, {\"text\": \"Aren't you an Amazon Mturk worker?\", \"speaker\": \"sys\", \"strategy\": \"Question\"}, {\"text\": \"Yes thats how I m doing this survey but not sure if we are supposed to talk about it\", \"speaker\": \"usr\"}, {\"text\": \"I think you are supposed to chat to me as a stranger coming to you for help\", \"speaker\": \"usr\"}, {\"text\": \"Oh I see, I was only suggesting an avenue that can help you pay off you debt. I can reword it.\", \"speaker\": \"sys\", \"strategy\": \"Providing Suggestions\"}, {\"text\": \"ok go ahead\", \"speaker\": \"usr\"}, {\"text\": \"Maybe you can find work online doing surveys or freelance work.\", \"speaker\": \"sys\", \"strategy\": \"Providing Suggestions\"}, {\"text\": \"That sounds great . I will do more research. Thank you . I feel a litttle better.\", \"speaker\": \"usr\"}], \"seeker_question1\": \"\", \"seeker_question2\": \"\", \"supporter_question1\": \"The seeker was attentive and provide information, I tried to help the best I could\", \"supporter_question2\": \"Nope\"}", "source": "esconv"}
