{"text": "I am devastated!  --   where to begin.   Not nearly recovered from this horrifying shock. Feel like our core values have been broadsided by a monster, and to think that the Catholic Church helped....", "source": "civil_comments"}
{"text": "This is what comes when Obama was allowed to severely restrict, reduce and underfund the Dept. of Defense", "source": "civil_comments"}
{"text": "Definition of a rigged election: \"Using tactics to predetermine the outcome of an election.\"\nIn other words the side doing the rigging knows that their side will win. And that's what happened in November.\nBTW: Trump is both an imbecile AND a fraud.\n\nBest,\n\nRTD", "source": "civil_comments"}
{"text": "Spoken like a true Russian troll.", "source": "civil_comments"}
{"text": "It will be funny to watch these corporate buffoons sewer their operations chasing the green koolaide.", "source": "civil_comments"}
{"text": "Good point.  NCR can hardly claim to be a 24 hour a day news source unless it is constantly updating its reporting.  Obviously this lack of reporting is a conspiracy by the mainstream media, I notice Crux and Churchmilitant have not reported on this either.", "source": "civil_comments"}
{"text": "And let me guess... you claim to believe in \"science\" but probably think there are 19 genders too.\n\nThe left is just as loony when it comes to their \"scientific\" beliefs.\n\nAmericans - all of 'em are nuts.", "source": "civil_comments"}
{"text": "Does the Baroness recall that most guns used in crime are illegal?  Which means, of course, that there ARE gun laws.....I am usually left wondering what it is about the word \"illegal\" that so many seem to forget - illegal guns, illegal immigration, illegal drug use.......\n\nI am not a gun enthusiast.  I despise even hunting.  I have no trouble with gun control laws - usually law abiding citizens obey the law.  But these sound-bite condemnations are not addressing the problem of a basic disrespect for life that is so prevalent...a disrespect that starts with denying the humanity of an unborn child.", "source": "civil_comments"}
{"text": "As my grandpa used to say \n\"If you ask a stupid question, don't complain about the answer...\"", "source": "civil_comments"}
{"text": "What is 'Islamophobia'? For example: is German Chancellor Angela Merkel 'Islamophobic' for stating recently that the Islamic full-face veil and burqa make it impossible for women to integrate into German society and should therefore be banned to the furthest extent possible under the German constitution? Or, was the Dutch film-maker Theo Van Gogh 'Islamophobic' for making a film about the mistreatment of women in Islam?", "source": "civil_comments"}
{"text": "Just another \"makes me feel good\" idea by people that have no clue. If you really want to \"feel good\" bring these illegal people into your home and hide them. Cannot believe that educated persons would even consider this. What is the point. Do the people that support this idea believe this will contribute to the well being and positive growth for our community. In case you haven't noticed the presidential candidate that lost supported an open border policy.", "source": "civil_comments"}
{"text": "We are all going to play dearly for the greed and stupidity of the Trump.", "source": "civil_comments"}
{"text": "Well, BLM says the herds there in Oregon are too large for the area they populate, this reversal on the ban will allow culling there in Oregon as well as anywhere else that is over populated.  Like it or not it must be done in order to maintain healthy herds.  IFG has been doing this with wild game herds here in Idaho for over 50 years and we have some of the healthiest wild game in the nation.  I would think we would see the same type of results with the horses.", "source": "civil_comments"}
{"text": "\"Around 56 percent backed a constitutional amendment to increase school funding by $2 billion per biennium, without being told which tax would be increased.\"\n\nUhm.. who did they send the poll too.. \n\nBy CONSTITUTIONAL MANDATE the Oregon Legislature is supposed to \"adequately\" fund education before all other spending.. Which they fail to do and there is NEVER enough money.  \n\nBut 56% of those polls are OK with being told they are going to increase spending.. and they are not told what taxes would be increased to spend it...   \n\nI got a Bridge in Brooklyn New York to sell to you.. because that statement is pure Bull Excrement.", "source": "civil_comments"}
{"text": "Sadly your religion is based on lies.", "source": "civil_comments"}
{"text": "Until Hell freezes over.", "source": "civil_comments"}
{"text": "The New Senate Bill Is Still Unimaginably Horrible Legislation\nMaintaining the ACA’s tax on investment income just fixes a really dumb political blunder.\nThe new version of TrumpCare substantially expands Health Savings Accounts, which are a massive tax giveaway to the wealthy.\nAnd, of course, the richest Americans will be getting an equivalent tax cut later in the year anyway.\nThis is still a huge cut in social spending to pay for huge tax cuts for the rich — it’s just that some of the details and sequencing has changed.\nThe Cruz Amendment is a big deal, and would essentially end the ACA’s regulation of private insurance markets.\nUnder the ACA, insurance companies had to make money by actually providing insurance that covered things to all comers.\nUnder BCRA, insurance companies could go back to making money by selling people useless insurance and effectively locking people with pre-existing conditions out of the market.\nThe massive Medicaid cuts are still there too.", "source": "civil_comments"}
{"text": "Hard to believes our congress has the power to diminish the title of Professor Emeritus by using it politically, more so on a corrupt Don Young who is good on highways, but has been worthless for 40 years opening ANWR, etc,,,,like he promised us so long ago. He is the scum on top of the swamp that needs to drained in DC.", "source": "civil_comments"}
{"text": "Lies, lies and more lies. Disgraceful, blatant, and damnable lies.", "source": "civil_comments"}
{"text": "\"...violates every norm of civilized conflict\" - Islamist militants are inherently uncivilized and inhuman - they have the mental capacity of rabid dogs and should be dealt with accordingly.", "source": "civil_comments"}
{"text": "Oh, please.  Could this article have been more obnoxious?  Stop this whole Russian narrative!  I can't stand anymore stupid remarks about the Russian conspiracy with Trump.  How about  Clinton and her real collusion with Russia in selling them Uranium.  Can't any of you talk about real issues?", "source": "civil_comments"}
{"text": "only an idiot would bring up Trump in a sports article.", "source": "civil_comments"}
{"text": "Thanks for another great article!", "source": "civil_comments"}
{"text": "A traitor. Taxpayers footing the bill for his hormones. The military being used to push a LBGT heavy agenda.", "source": "civil_comments"}
{"text": "\"So there we have it. You are a demonstrated liar and hypocrite. That's not libel, it's just pointing out a reality, a fact.\"\n\nExactly.", "source": "civil_comments"}
{"text": "My thought exactly.  How does one credibly position fringe white supremacists alongside Islamic State? This ridiculousness is symptomatic of the overwhelming need of some to reduce the bluntness of a position that could potentially result in a call of racism or Islamaphobia or other with a, \"and whites are bad too don't you know?\"  ISIS is a cancer on the world.  Period.  That has nothing to do with white supremacists or the price of butter.", "source": "civil_comments"}
{"text": "As usual, Margaret Wente exhibits shrewd assessment of troll reaction.  Also in keeping with her practice is her uncritical endorsement of it. As someone who just a few days ago was proclaiming her love for her adopted country she is quite forgetful of the politicization of the Khadr case over the past 15 years . . . and of other complex stories left over from our engagement in Afghanistan, such as the \"friendly fire\" death of four Canadian soldiers by an totally unrepentant American air force pilot. Why is that the trolls only see things from what - for want of a better term - is a Fox News perspective?", "source": "civil_comments"}
{"text": "I see co-author Ian Mosby is described as a settler,a derogatory name First Nations use to describe the rest of us!!", "source": "civil_comments"}
{"text": "Oh but your all wrong. They did approve 3 million towards another legislative office building that will adaquately host lobbyists willing to divide government from the people", "source": "civil_comments"}
{"text": "And you base that on you thorough research of Lucia's life and her community? Please.", "source": "civil_comments"}
{"text": "Yeah, temporary workers. Doing jobs that many in a booming economy would be crazy to trade a full time, permanent job for a 'temporary' job   He is shipping  people \"IN\" for a few months to work at jobs that are impossible to fill in a  booming  economy, not shipping millions of jobs overseas.  Very big difference.  When your help wanted ads get zero local responses what would you do?   This is legal and these people pay taxes.", "source": "civil_comments"}
{"text": "\"It's the overall \"anti muslim\" narrative that is the problem.\" That is your opinion, obviously subjective as it is the only possible way to fit the left-wing anti- Trump narratives. The vast majority of folks with commonsense know the concerns of Trump over Muslims is in direct connection to Muslim terrorist and terrorism. Any other false narratives being offered are only the resulting drama of hyperventilating.", "source": "civil_comments"}
{"text": "Yeah, Trump Worshipers, he's one of you, alright. He's white.", "source": "civil_comments"}
{"text": "The real issue here is cost - the value of land is through the roof - the best indicator of that is the number of gas stations that are left in downtown Vancouver - these tech guys should move out to Richmond and develop some farmland or move further into the interior or to Vancouver Island", "source": "civil_comments"}
{"text": "Grace (I hope this photo is not of a innocent person) please send regards to the Gupta's when you see them again. Your efforts are pathetic and stopped being effective long ago.", "source": "civil_comments"}
{"text": "\"Although combat ended eight years ago, the torture and abuse occurred from early 2016 to as recently as July this year.\"\n\nToo bad the general charged with these crimes last year has been given immunity from his govt. They continue so the military is out of control.", "source": "civil_comments"}
{"text": "Agreed! And the technology now exists to charge for such differential use. But implementing it would cost (even by government standards) a fortune, assuming the public would even agree to the measure. It would mean transponders in every car, and government receivers on every road in the province. Think of the implications.", "source": "civil_comments"}
{"text": "It is a self-evident truth that there is no place anywhere for white supremacy, and their violence is condemned by most on the right as well as most on the left. The spectacle of a few thousand ( at the most ) meeting to duke it out in Virginia is disgusting and should never have taken place.  Regrettably, Governor Terry McAuliffe is up for election and saw the opportunity for a lot of media face-time, the word went out from the state Capital to the city police chief to hold back on intervention. The result is death and destruction and a ton of politicians coming out of the woodwork. But let's have a little balance to the commentary, shall we?  There are as many, if not more, violent radicals from the left, including BLM, anarchists and Antifa thugs who have not hesitated to create mayhem and killing in extremus. Berkeley riots and the New Jersey baseball field shooting come to mind. This is not a Trump thing unless you think America is or has become Trump.", "source": "civil_comments"}
{"text": "You're a stupid, sick human being. But then again, you're just another liberal full of hatred...", "source": "civil_comments"}
{"text": "you ignorant sheep need serious help for your stupidity\nhttps://www.youtube.com/watch?v=SXxHfb66ZgM", "source": "civil_comments"}
{"text": "i think trudeau was pretty clever..considering some of the folks we've read about. he knew where an outside to inside hole in the wall made the machine vulnerable. it doesn't sound like they got inside.. the article is really kind of hazy... he cased the place, checking how the ATM was attached. a perfect location tucked away behind taller buildings, not good line of sight... he knew when nobody would be there...and then got stupid for having a pretty identifiable rig and parking at his house...i'm surprised he wasn't out in his yard with a crowbar when the cops showed up...\n he didn't fall through any ceilings...or steal a donation jar for the Girl Scouts.. at least..", "source": "civil_comments"}
{"text": "How is 1/4 acre = 2 acres??\nIn any case, the price is obviously completely insane.\nI suppose if it really is 2 acres, and it can be developed to a much higher density, and the bubble continues forever, with no limits on outside buyers, and rates never increase, and.............?", "source": "civil_comments"}
{"text": "Administration is doing some good refocusing. It is atrocious to hear that WE the USA taxpayers have been supporting Palestinian murderers, while shouting at our retirees they are to blame for USA being broke. Retirees paid into Social Security, Congress took the money, shifted it to war budget, and under Obama blamed those who paid into the Social Security Fund. So finally some\ncommon sense returning to Washington under Trump administration.\nHow are they going to double check money is not going AGAIN to the murderers and WHY are we paying to Palestine anything at all ?  We have enough pressing domestic issues to take care of - such as repairing our bridges ? Why pay Palestinians - for what ?", "source": "civil_comments"}
{"text": "He's no idiot, just  dangerous fool!", "source": "civil_comments"}
{"text": "There is no bigger liar on the current world stage than Donald J. Trump.", "source": "civil_comments"}
{"text": "Nothing redeemable about the man. But ya'll have a nice day now. Gotta get on with scooping up this dog poop.", "source": "civil_comments"}
{"text": "The Crusades were not perpetrated by Rome.  What's more, a \"client state\" of Rome means one that was colonized.  What possible claim could an Italian city-state have in the Middle East?   The Crusades took place in the medieval period,  long after Rome had been conquered, and mainly by what is now England, France, and Germany.\n\nThe Crusades were nasty and had no valid land claims to back them.  It was attempted conquest.\n\nThis is hardly left wing amnesia, and you would do well to refrain from whitewashing history.", "source": "civil_comments"}
{"text": "Multi-culturalist moron.", "source": "civil_comments"}
{"text": "If only we could keep firearms out of the hands of murderers and racists; besides the badges they hide behind, they also have tasers, pepper spray, and night sticks. Isn't that enough?", "source": "civil_comments"}
{"text": "People get fired for many seemingly silly reasons. More often they get fired because they're poor employees. If I'm fired for my heterosexuality I'll just go get another job. I might have to wait a couple of months if I didn't want to relocate, oh well. Employers are more interested in my skills then my sexuality.", "source": "civil_comments"}
{"text": "It will be decriminalized. So who cares what these fools say?", "source": "civil_comments"}
{"text": "Allie always has something negative to say when they lose. When they win and are successful, she has nothing to say, what a hypocrite", "source": "civil_comments"}
{"text": "All this faux outrage about draft deferments.  Don't recall the libs harping on Bill Clinton fleeing the nation to avoid the draft.  I seriously doubt any of these hateful slugs served either.", "source": "civil_comments"}
{"text": "It's that multi-paged booklike thing with hundreds of pages of print that's too damn small for anyone to read.  You keep one around \"just in case\", then when the new one comes, you put it in the recycle bin.......", "source": "civil_comments"}
{"text": "So what exactly is the alt-right?\n\nThose mythical beasts that are in office right now that are anti-semitic? I mean you seem to think Nazis are a myth but your own antifas/blm/radiacal muslims are the real myths.\n\nYou need to look outside your infowars/drudge/fox bubble and see how the real world is.", "source": "civil_comments"}
{"text": "While Trump's assaults on women are upsetting, the denial and lack of action to mitigate the global warming crisis is alarming.  Both Clinton and Trump are not addressing this issue enough, Trump actually denying humans role in it being worse.  Clinton has been pushed by Sanders to make more noise on this issue, but that fact that she takes fracking money speaks volumes.  Time is quickly running out before we will be helplessly on the train falling into the abyss on our way to certain devastation taking the entire biosphere with us.  Shame on all of us.", "source": "civil_comments"}
{"text": "This is a pretty weak attempt at damage control by SNAP.", "source": "civil_comments"}
{"text": "Kim was working there as a university instructor but I do get your point.  Anyone holding American citizenship should expect enhanced scrutiny and possible detainment once they cross into North Korea.  Maybe the risk is acceptable if you really value a job or career there, but maybe not.  It'd be interesting to know how many Americans have found long-term gainful employment in the North.", "source": "civil_comments"}
{"text": "Rrrrrrrr, but this is Eugene.   If you're thinking Eugene will save a net $80M [2x return], I guarantee you they won't refund it to taxpayers, they'll probably end up doubling the auditor budget for a net zero.   That's the mentality of Eugene city govt.", "source": "civil_comments"}
{"text": "Don't forget back stabbing", "source": "civil_comments"}
{"text": "Time for a new razor blade.  Your edge is uselessly dull. The Clinton campaign have lied from the start stating that they had nothing to do this fake dossier. They financed it.  This fake dossier was the basis for the FBI getting into investigating the Trump Campaign using their false pretense to spy on a political opponent. Your idiotic statement, “trump likes to be peed on” neglects that he is a germ-a-phobe. You are telling on yourself.  The Russians have all the leverage they needed but on Hillary who they paid 145 million bucks to obtain 20% of our strategic uranium supply. It goes all the way to Obama.  They have sold out this country... the house of cards is tumbling.  You have been played.   \n\nThe headline is TRUMP WAS RIGHT... AGAIN.", "source": "civil_comments"}
{"text": "Must have been drunk...", "source": "civil_comments"}
{"text": "Geez! You mean that repeated, violent blows to the head can damage the brain? Who knew?", "source": "civil_comments"}
{"text": "being a sheep supporting climate change bs shows your endorsements are pathetic", "source": "civil_comments"}
{"text": "I think this one statement by Strader gets at why folks are supporting Trump.  Read it carefully:\n\n\"Trump complained about our mutual defense treaty with Japan and our NATO alliance, saying those nations weren’t paying their fair share of the costs of their defense. But earlier, when Clinton asked why Trump wasn’t paying his fair share of federal taxes to support American troops, he said he was just being smart.\"\n\nTranslation:  Japan and NATO are smart, Trump is smart, US political leaders are naive amateurs playing in a game that is beyond them, they are the \"mark\".  Trump supporters drive home point, politicians have failed us miserably as we can see, give a non-politician a chance to make things better.\n\nI'm not so sure if I were Hillary, I would take Srader's advice for debating on a national stage.  This one alone sets her up for a real \"zinger\".  Maybe Srader is a closet Trump supporter?", "source": "civil_comments"}
{"text": "Trump took an Obama EO from several years ago, changed absolutely nothing, and put his signature on it.\n\nFASCISM!!! KRISTALLNACHT!!!\n\nTrump is exposing the bed-wetters for the hypocrites they are.", "source": "civil_comments"}
{"text": "agreed.  it's a welcomed relief from the incredibly biased horseshit these jokers typically produce.", "source": "civil_comments"}
{"text": "\"Notre Dame for instance has yielded many iotas.\"\n\nNot sure what you mean -- that ND has \"yielded to many iotas\" --when ND still has an excellent Theology program, attracts many notable Catholic scholars, has an undergraduate student body that is predominately Catholic (nearly 80%), has liturgies in all its dorms, has a critical mass of religious there (i.e., Congregation of Holy Cross, including the president, who is a Holy Cross priest), who comprise half the membership of the Board of Fellows (with lay men comprising the other half), and, finally, nurtures a very active seminary program for future Holy Cross priests and brothers, among other things. What else is missing?", "source": "civil_comments"}
{"text": "Seems to me he's taking a page from the Trumpster playbook; trying to drum up even bad press will help with his \"opening\".  Especially since he stated he was aware of the previous baker that ran afoul of a local discrimination statute.", "source": "civil_comments"}
{"text": "Something makes me suspect they might be electricity thieves that tried to steal juice from the grid and took a nice jolt in the process leaving them disabled :-p", "source": "civil_comments"}
{"text": "there is a reason you make such posts of nonsense, STUPIDITy", "source": "civil_comments"}
{"text": "Could you please state your source for \"hundreds of thousands of guns are stolen every year\"?  I'd like to look at that data.", "source": "civil_comments"}
{"text": "No hon.  I am needed here.  One needs to contribute.", "source": "civil_comments"}
{"text": "We have Canadian Republicans, which explains Harper fund raising for them in Vegas.", "source": "civil_comments"}
{"text": "I think it's excellent that she can breathe through both sides of her nose, because she has been TALKING out of both sides of her mouth for years......", "source": "civil_comments"}
{"text": "And you are absolutely allowed that opinion Bill.   But the process is clear and should be followed.   \n\nIt's tough to balance majority rule and still keep a strong defenses for the rights of a the minority., \n\nI have a bigger concern that neither party can claim representation of a majority of Americans.   The Parties are self serving private entities who are sustained rewarding their sponsors, not representing a broad public consensus.   I'm very tired of those who believe a representative goverment is designed for a 'winner take all' rewards system that we have in American politics today.", "source": "civil_comments"}
{"text": "I see that Tru Dope took another opportunity to prattle on in front of the cameras in New York while attending the \" Come From Away \" show on Broadway. Interestingly however he could not find the time to attend the 15 th anniversary last year of 911 in Gander even though they were receiving a special thank you from the US in the form of a I beam from one of the twin towers as he was taking a personal day. He did find time however to attend a Mosque the next day.\n\nWhat a hypocrite", "source": "civil_comments"}
{"text": "Really? Who cares or better yet why care?  Given all the facts known so far show that democrats have turned the IRS into a weapon in which to inflict harm upon U.S. citizens that they disagree with or who don't support the liberal nut case mentality. Secondly given all the libbers crazy conspiracy stories Trump should not release his returns. What Trump should do is castrate the IRS and see to it that any government employees who use the powers of government as a weapon against U.S. citizens be imprisoned. The minimum sentence not one day less of 10 years if found guilty!", "source": "civil_comments"}
{"text": "Hell yeah he won the encounter. You miss the point COMPLETELY.  Megyn is so obsessed with getting Clinton into the Whitehouse she'll attack Trump and ignore Clinton for doing FAR WORSE than Trump.", "source": "civil_comments"}
{"text": "It's sad that so many are being taken in by the 'blame the Russian government' mantra (a distraction from the content of the leaked emails that clearly show the criminal and corrupt intent of highly placed American officials). This seems to be another case of 'WMDs in Iraq' and the uncritical repetition of an accusation of this magnitude without evidence is not only irresponsible but potentially quite harmful.", "source": "civil_comments"}
{"text": "In 2010, rookie Tim Tebow ranked 1st in the NFL for TDs per completion and 5th for TDs per attempt. He had a 50% completion percentage throwing an unheard of 16 yards per completion. If Lance Ball had caught the pass that he dropped in the end zone, Tebow would have also ranked 1st for TDs per attempt.\nManning wasn't in the top 5.\nTebow scored every 16.4 attempts\nManning scored every 20.5 attempts", "source": "civil_comments"}
{"text": "No doubt he will get politically loaded questions like \"What sock design are you wearing today?\".", "source": "civil_comments"}
{"text": "We don't need to worry. Only prepare.\n\nNot only is the Orange blob a bully, he is ignorant and chaotic. He doesn't care about the facts, only the politics and his crooked ideology. Shouldn't be too hard to run rings around the clown.", "source": "civil_comments"}
{"text": "Where is the proof of what you just posted?", "source": "civil_comments"}
{"text": "I don;t think I've ever said that Trump was \"high quality.\"  In fact, most of my comments about Trump himself are quite negative.  I've generally called him a bum, a bully, and a blowhard.", "source": "civil_comments"}
{"text": "Thanks for the clear explanation.", "source": "civil_comments"}
{"text": "Get over it already! Smokers are going to smoke whether you like it or not. I'm not advocating for cigarettes, but unless they are made completely illegal (Which will never happen as long as the Government is making a few bucks) people aren't just going to quit! That's the truth, right or wrong. Deal with it and leave them alone. Don't like cigarettes? Don't smoke them. Period.", "source": "civil_comments"}
{"text": "I graduated from nursing school in 1972. At that time we focused on preventative care and had many satellite clinics located in many communities with the objective of keeping citizens out of the Emergency Room for their health care. The health care system was set up to prevent people from getting sick in the first place with education on lifestyle and halting the progress of chronic conditions. That started to change in the 1980's when new technology and medications were developed and were expensive. We went from a nation of being pr0-active on preventing and controlling disease conditions to \"what the heck\", get or prevent a disease by taking a pill. Just watch the adds for medications on tv.   Chronic heartburn is best treated by diet and losing weight. Who is the man on tv who promotes the over the counter medication for \"frequent\" heartburn, he is obese, and eats all the heartburn triggers that will lead to a life long disease, GERD, and a lifetime of medical treatment.", "source": "civil_comments"}
{"text": "Immigration is not a bad thing unless the immigrants are here only for the benefits that the natural-born citizens provide and pay for.  If the immigrants are here only for the benefits and reject the culture and traditions of the U.S., then we have a problem... a severe problem.", "source": "civil_comments"}
{"text": "@Miss...One group overtaking another in pursuit of resources and territory has taken place on every continent in every decade since the dawn of time. The tools, mechanisms, and landscapes may change,  and, correspondingly so, the degree and duration, outcome, and depth of loss, but it's still the same thing: taking from one by another. By your logic, the wars that took place centuries ago weren't really wars because they couldn't wreak death and destruction on the same scale and with the same relative ease as is the case in the modern world. Similarly, by your logic, diseases today are less virulent because they don't wipe out entire villages/cities nowadays as they did years ago.  I'm sooooo tired of the white guilt thing, as well as the \"only those in power can be racist\" thing, etc etc etc.  And, finally, for what it's worth, I happen to agree with the idea that the Sea Shepherd crew is a ship of meddling fools who should take their do-goodery elsewhere. But the theft thing...naw.", "source": "civil_comments"}
{"text": "Pence managed the transition.\nThere is no way that he could have avoided knowing everything about Flynn's activities.\nHe plays a good 'dumb' with those droopy, puppy-dog, poor-me eyebrows.", "source": "civil_comments"}
{"text": "This is an opinion piece disguised as a news article.", "source": "civil_comments"}
{"text": "Stop the damned dam! We don't need it and we don't want it. I believe we have said that multiple times so why aren't they hearing us?", "source": "civil_comments"}
{"text": "Stop giving them money in traffic when the damn light is green. Subaru and Prius drivers, I'm talking to you.", "source": "civil_comments"}
{"text": "YOU'RE so full-of-shyiiyyttt... (bam!)", "source": "civil_comments"}
{"text": "The trail is getting bigger and bigger of those who were involved and where the involvement took place.  I'm sure there are those who will claim it is all fake news and a conspiracy between the DNC and the countries reporting the contact of Trump's team with Russians.  The preponderance of the evidence keeps being ignored by so many.", "source": "civil_comments"}
{"text": "Best and the most obvious way for all Alaskans to show their displeasure is to make sure that ALL of these bobbleheads in Juneau are jettison out the airlock at election time. And to elect their replacements after they promise to introduce a law that states that they will NOT be paid when the regular legislature session is over (90 days limit). Creating a term limit won't hurt either. You got one for the governor....why not for the legislature???  With such simple solution, what could be a problem outside of many Alaskans who cannot let go of some politicians may they be Republicans or Democrats.", "source": "civil_comments"}
{"text": "yes, they are stupid.  Low IQ more like it.  Useless trash more like it!.  Mexicans and blacks are the lowest forms.  .", "source": "civil_comments"}
{"text": "Yeah, you are indeed Deplorable.  Come out, come out whoever you are.", "source": "civil_comments"}
{"text": "Its folly to design new town square when the city can't maintain the parks we have already.  Mr. Steve Rafuse should start planning on how to maintain what we got instead of going off on some grandiose project that will just cost money we don't have to spare. If you want to improve it, put a big statue of Woodsey Owl there to scare away the pooping birds. (And score points with the tourists who will be lining up posing next to it!!)", "source": "civil_comments"}
